k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
/*
 *
 * Copyright (c) 2011 Nuvoton technology corporation
 * All rights reserved.
 *
 */

#ifndef _w55fa92_REG_H
#define _w55fa92_REG_H

/*
   Register map
*/
#define 	SYS_BA    		0xB0000000	/* System Manager Control */
#define   	GCR_BA			SYS_BA
#define    	CLK_BA			0xB0000200	/* Clock Controller */
#define 	ROT_BA			0xB0002000	/* Rotation Engine Control Registers */
#define 	SDRAM_BA	   	0xB0003000	/* SDRAM Inteface Control Registers */
#define    	CRC_BA    		0xB0004000	/* CRC Control */
#define    	SDIODMAC_BA  	0xB0005000	/* SDIO DMA Control */
#define    	SDIOFMI_BA  	0xB0005800	/* SDIO Interface */
#define    	CRC1_BA    		0xB0006000	/* CRC1 Control */
#define    	EDMA_BA		0xB0008000	/* EDMA Controller */
#define    	SPU_BA			0xB1000000	/* SPU Controller */
#define    	I2S_BA			0xB1001000	/* I2S Controller */
#define    	VPOST_BA  		0xB1002000	/* VPOST Controller */
#define    	VIN_BA    		0xB1003000	/* Video-In Controller */
#define     MDCT_BA    		0xB1004000	/* AAC MDCT / IMDCT Controller */
#define	UOHCI20_BA		0xB1005000	/* USB 2.0 OHCI Host Control*/
#define    	DMAC_BA    		0xB1006000	/* DMA Control */
#define    	FMI_BA    		0xB1006800	/* Flash Memory Card Interface */
#define    	USBD_BA   		0xB1008000	/* USB Device Control */
#define    	USB_BA   		0xB1008000	/* USB Device Control */
#define    	USBH_BA   		0xB1009000	/* USB Host Control */
#define    	JPG_BA    		0xB100A000	/* JPEG Engine Control */
#define	UEHCI20_BA		0xB100B000	/* USB 2.0 EHCI Host Control*/
#define 	GE_BA			0xB100C000	/* GVE Control */
#define 	VPE_BA			0xB100C800	/* VPE Control */
#define     BLT_BA          	0xB100D000  /* 2D BLT Accelerator */
#define 	EMAC_BA		0xB100E000	/* Ethernet MAC */
#define     AES_BA          	0xB100F000  /* AES Control */
#define     H264E_BA       	0xB1010000  /* H.264 Encoder Controller */
#define     H264D_BA       	0xB1007000  /* H.264 Decoder Controller */

#define    	AIC_BA    		0xB8000000	/* Interrupt Controller */
#define    	GPIO_BA   		0xB8001000	/* GPIO Control */
#define    	TMR_BA    		0xB8002000	/* Timer Control */
#define    	RTC_BA    		0xB8003000	/* Real Time Clock Control */
#define    	I2C_BA    		0xB8004000	/* I2C Control */
#define    	KPI_BA    		0xB8005000	/* KPI Control */
#define    	TMR2_BA    		0xB8006000	/* Timer2 Control */
#define    	PWM_BA    		0xB8007000	/* Pulse Width Modulation (PWM) Control */
#define    	UART_BA   		0xB8008000	/* UART Control (console) */
#define    	RF_BA    		0xB8009000	/* RF Codec Control */
#define    	RSC_BA    		0xB800A000	/* RS Codec Control */
#define    	SPI0_BA  		0xB800C000	/* Serial Interface Control 0 */
#define    	SPI1_BA  		0xB800C400	/* Serial Interface Control 1 */
#define    	AR_BA    		0xB800E000	/* ADC Control */
#define    	TP_BA    			0xB800F000	/* Touch ADC Control */


// Define one bit mask
#define BIT0	0x00000001
#define BIT1	0x00000002
#define BIT2	0x00000004
#define BIT3	0x00000008
#define BIT4	0x00000010
#define BIT5	0x00000020
#define BIT6	0x00000040
#define BIT7	0x00000080
#define BIT8	0x00000100
#define BIT9	0x00000200
#define BIT10	0x00000400
#define BIT11	0x00000800
#define BIT12	0x00001000
#define BIT13	0x00002000
#define BIT14	0x00004000
#define BIT15	0x00008000
#define BIT16	0x00010000
#define BIT17	0x00020000
#define BIT18	0x00040000
#define BIT19	0x00080000
#define BIT20	0x00100000
#define BIT21	0x00200000
#define BIT22	0x00400000
#define BIT23	0x00800000
#define BIT24	0x01000000
#define BIT25	0x02000000
#define BIT26	0x04000000
#define BIT27	0x08000000
#define BIT28	0x10000000
#define BIT29	0x20000000
#define BIT30	0x40000000
#define BIT31	0x80000000

// Define bits mask
#define NVTBIT(start,end) ((0xFFFFFFFFUL >> (31 - start)) & (0xFFFFFFFFUL >>end  << end))

#define REG_CHIPID	(GCR_BA+0x00)	// R	Chip Identification Register
	#define CHIP_ID			NVTBIT(23, 0)	// Chip Identification

#define REG_CHIPCFG	(GCR_BA+0x04)	// R/W	Chip Power-On Configuration Register
	#define HVMODE			BIT17		// ARM vector mode
	#define CAP_SRC		BIT14			// Common mode. Capture0 and Capture1 share the common sensor.
	#define ROT_IRM		BIT13			// IR mode. Rotate Engine's 32KB SRAM is for internal RAM or working memory
	#define DLL_TEST		BIT12			// Enter DLL test mode
	#define DQSWAP		BIT11			// Swap DDRII DQ8/DQ15 and DQ9/DQ14
	#define NTYPE			BIT10			// NAND Type
	#define NPAGE			NVTBIT(9, 8)		// NAND Page Size
	#define NADDR			BIT7 				// NAND Address Cycle
	#define CLK_SRC		BIT6				// System Clock Source Selection
	#define SDRAMSEL		NVTBIT(5, 4)		// SDRAM Type Selection
	#define COPMODE		NVTBIT(3, 0)		// Chip Operation Mode Selection

#define REG_OVCKCFG	(GCR_BA+0x08)	// R/W	Overclk Configuration Register
	#define OVCK_SEL		NVTBIT(18, 17)		// Overclk counter output select
	#define OVCK_SET		BIT16			// Overclk_circuit enable
	#define OVCK_CNT		NVTBIT(15, 0)		// Overclk circuit counting result (Read Only)


#define REG_AHBCTL	(GCR_BA+0x10)	// R/W	AHB Bus Arbitration Control Register
	#define IPACT			BIT5 				// Interrupt Active Status
	#define IPEN			BIT4 				// CPU Priority Raising Enable during Interrupt Period
	#define PRTMOD1		BIT1 				// Priority Mode Control 1
	#define PRTMOD0		BIT0 				// Priority Mode Control 0

#define REG_AHBIPRST	(GCR_BA+0x14)	// R/W	AHB IP Reset Control Resister
	#define CRC1_RST		BIT24			// CRC2 Controller Reset
	#define SDIO_RST            BIT23			// SDIO Controller Reset
	#define CRC_RST		BIT22			// CRC Controller Reset
	#define UHC20_RST		BIT21			// USB Host 2.0 Controller Reset
	#define ROT_RST		BIT20			// ROT Reset
	#define VPE_RST		BIT19			// VPE Reset
	#define VIN1_RST		BIT18			// VIN1 Reset
	#define JPG_RST		BIT17 			// JPG Reset
	#define BLT_RST		BIT16			// BLT Reset
	#define VDE_RST		BIT15 			// H.264 Video Decoder Reset
	#define IPSEC_RST		BIT14			// AES Reset
	#define VEN_RST		BIT13 			// H.264 Video Encoder Reset
	#define AAC_RST		BIT12 			// OVG Reset
	#define VIN0_RST		BIT11 			// VIN 0 Reset
	#define VPOST_RST		BIT10 			// VPOST Reset
	#define I2S_RST		BIT9 				// I2S Reset
	#define SPU_RST		BIT8 				// SPU Reset
	#define UHC_RST		BIT7 				// UHC Reset
	#define UDC_RST		BIT6 				// UDC Reset
	#define SIC_RST		BIT5 				// SIC Reset
	#define TIC_RST		BIT4 				// TIC Reset
	#define EDMA_RST		BIT3 				// EDMA Reset
	#define SRAM_RST		BIT2 				// SRAM Reset
	#define EMAC_RST		BIT1				// EDMA Reset
	#define SDIC_RST		BIT0 				// SDIC Reset

#define REG_APBIPRST	(GCR_BA+0x18)	// R/W	APB IP Reset Control Resister
	#define TMR3RST			BIT17		// Timer 3 Reset
	#define TMR2RST			BIT16		// Timer 2 Reset
	#define KPIRST				BIT15		// KPI Reset
	#define ADCRST			BIT14		// ADC Reset
	#define SPI1RST			BIT13 		// SPI 1 Reset
	#define SPI0RST			BIT12 		// SPI 0 Reset
	#define RSCRST			BIT11 		// RSC Reset
	#define PWMRST			BIT10 		// PWM Reset
	#define RFCRST			BIT9 			// RFC Reset
	#define I2CRST				BIT8 			// I2C Reset

	#define UART1RST			BIT7 			// UART 1 Reset
	#define UART0RST			BIT6 			// UART 0 Reset
	#define TMR1RST			BIT5 			// TMR1 Reset
	#define TMR0RST			BIT4 			// TMR0 Reset
	#define WDTRST			BIT3 			// WDT Reset
	//#define RTCRST			BIT2 			// RTC Reset
	#define GPIORST			BIT1 			// RTC Reset
	#define TOUCHRST			BIT0 		// TOUCH Reset

