k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_MISCR	(GCR_BA+0x20)	// R/W	Miscellaneous Control Register
	#define WDTRSTEN			BIT24		// WatchDog Timer Reset Connection Enable
	#define UTMISnoop			BIT23		// UTMI Monitor Mode Enable
	#define SEL_HSCUR			NVTBIT(19, 18)	// USB 2.0 PHY Control SEL_HSCUR
	#define SEL_PHASE			NVTBIT(17, 16)	// USB 2.0 PHY Control SEL_PHASE
	#define UTMISnoop_HOST		BIT15		// UTMI Monitor HOST Mode Enable
	#define SEL_HSCUR_HOST	NVTBIT(11, 10)// USB 2.0 HOST PHY Control SEL_HSCUR
	#define SEL_PHASE_HOST		NVTBIT(9, 8)	// USB 2.0 HOST PHY Control SEL_PHASE
	#define CPURSTON			BIT1 			// CPU always keep in reset state for TIC
	#define CPURST		 	BIT0 			// CPU one shutte reset.

#define REG_SDRBIST	(GCR_BA+0x24)	// R/W	Power Management Control Register
	#define TEST_BUSY			BIT31 		// Test BUSY
	#define CON_BUSY			BIT30		// Connection Test Busy
	#define BIST_BUSY			BIT29		// BIST Test Busy
	#define TEST_FAIL			BIT28 		// Test Failed
	#define CON_FAIL			BIT27		// Connection Test Failed
	#define BIST_FAIL			BIT26 		// BIST Test Failed

#define REG_ED0SSR	(GCR_BA+0x2C)	// R/W	EDMA Service Selection Control Register
	#define CH4_TXSEL			NVTBIT(30, 28)	// EDMA Channel 4 Tx Selection
	#define CH3_TXSEL			NVTBIT(26, 24)	// EDMA Channel 3 Tx Selection
	#define CH2_TXSEL			NVTBIT(22, 20)	// EDMA Channel 2 Tx Selection
	#define CH1_TXSEL			NVTBIT(18, 16)	// EDMA Channel 1 Tx Selection
	#define CH4_RXSEL			NVTBIT(14, 12)	// EDMA Channel 4 Rx Selection
	#define CH3_RXSEL			NVTBIT(10, 8)	// EDMA Channel 3 Rx Selection
	#define CH2_RXSEL			NVTBIT(6, 4)	// EDMA Channel 2 Rx Selection
	#define CH1_RXSEL			NVTBIT(2, 0)	// EDMA Channel 1 Rx Selection

#define REG_ED1SSR	(GCR_BA+0x30)	// R/W	EDMA Service Selection Control Register
	#define CH12_TXSEL			NVTBIT(30, 28)	// EDMA Channel 12 Tx Selection
	#define CH11_TXSEL			NVTBIT(26, 24)	// EDMA Channel 11 Tx Selection
	#define CH10_TXSEL			NVTBIT(22, 20)	// EDMA Channel 10 Tx Selection
	#define CH9_TXSEL			NVTBIT(18, 16)	// EDMA Channel 9 Tx Selection
	#define CH12_RXSEL		NVTBIT(14, 12)	// EDMA Channel 12 Rx Selection
	#define CH11_RXSEL		NVTBIT(10, 8)	// EDMA Channel 11 Rx Selection
	#define CH10_RXSEL		NVTBIT(6, 4)	// EDMA Channel 10 Rx Selection
	#define CH9_RXSEL			NVTBIT(2, 0)	// EDMA Channel 9 Rx Selection

#define REG_MISSR	(GCR_BA+0x34)	// R/W	Miscellaneous Status Register
	#define KPI_WS			BIT31	//KPI Wake-Up Status
	#define ADC_WS			BIT30	//ADC Wake-Up Status
	#define UHC_WS			BIT29	//UHC Wake-Up Status
	#define UDC_WS			BIT28	//UDC Wake-Up Status
	#define UART_WS			BIT27	//UART Wake-Up Status
	#define SDH_WS			BIT26	//SDH Wake-Up Status
	#define RTC_WS			BIT25	//RTC Wake-Up Status
	#define GPIO_WS			BIT24	//GPIO Wake-Up Status
	#define KPI_WE				BIT23	//KPI Wake-Up Enable
	#define ADC_WE			BIT22	//ADC Wake-Up Enable
	#define UHC_WE			BIT21	//UHC Wake-Up Enable
	#define UDC_WE			BIT20	//UDC Wake-Up Enable
	#define UART_WE			BIT19	//UART Wake-Up Enable
	#define SDH_WE			BIT18	//SDH Wake-Up Enable
	#define RTC_WE			BIT17	//RTC Wake-Up Enable
	#define GPIO_WE			BIT16	//GPIO Wake-Up Enable
	#define UHC20_WS			BIT15	//UHC20 Wake-Up Status
	#define EMAC_WS			BIT14	//EMAC Wake-Up Status
	#define UHC20_WE			BIT7		//UHC20 Wake-Up Enable
	#define EMAC_WE			BIT6		//EMAC Wake-Up Enable
	#define POR12_RST			BIT5		//POR12 Reset Active Status
	#define CPU_RST			BIT4		//CPU RST
	#define WDT_RST			BIT3		//WDT RST
	#define KPI_RST			BIT2		//KPI RST
	#define LVR_RST			BIT1		//LVR RST
	#define EXT_RST			BIT0		//EXT RST

#define REG_AHB4_TOC0	(GCR_BA+0x40)	// R/W	AHB4 Master's 1st Time-Out Counter Control Register
	#define Master3_TOC		NVTBIT(31, 24)		// AHB4 Master3 Time-Out Counter
	#define Master2_TOC		NVTBIT(23, 16)		// AHB4 Master2 Time-Out Counter
	#define Master1_TOC		NVTBIT(15, 8)		// AHB4 Master1 Time-Out Counter
	#define Master0_TOC		NVTBIT(7,   0)		// AHB4 Master0 Time-Out Counter


#define REG_AHB4_TOC1	(GCR_BA+0x44)	// R/W	AHB4 Master's 1st Time-Out Counter Control Register
	#define Master7_TOC		NVTBIT(31, 24)		// AHB4 Master7 Time-Out Counter
	#define Master6_TOC		NVTBIT(23, 16)		// AHB4 Master6 Time-Out Counter
	#define Master5_TOC		NVTBIT(15, 8)		// AHB4 Master5 Time-Out Counter
	#define Master4_TOC		NVTBIT(7,   0)		// AHB4 Master4 Time-Out Counter

#define REG_CDCVC		(GCR_BA+0x48)	// R/W	AHB4 Master's 1st Time-Out Counter Control Register
	#define YEAR				NVTBIT(31, 24)		// Year Code (8 bits)
	#define MONTH				NVTBIT(23, 16)		// Month Code (8 bits)
	#define DAY				NVTBIT(15, 8)		// Day Code (8 bits)
	#define VERSION			NVTBIT(7,   0)		// Version Code (8 bits)

#define REG_POR_LVRD	(GCR_BA+0x74)	// R/W	POR and LVRD Control Register
	#define MPLL_LKDT			BIT7				// MPLL lock status
	#define UPLL_LKDT			BIT6				// UPLL lock status
	#define APLL_LKDT			BIT5				// APLL lock status
	#define POR_ENB			BIT4				// Power on circuit enable bar: active low (default low)
	#define EN_LVR				BIT3				// LVR enable: active high (default high)
	#define EN_LVD			BIT2				// LVR enable: active high (default high)
	#define LVD_SEL			BIT1				// LVD enable: active high (default low)
	#define LVD_OUTB			BIT0				// LVD flag. read only

#define REG_GPAFUN0	(GCR_BA+0x80)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPA7				NVTBIT(31, 28)		// GPA[7] Multi Function
	#define MF_GPA6				NVTBIT(27, 24)		// GPA[6] Multi Function
	#define MF_GPA5				NVTBIT(23, 20)		// GPA[5] Multi Function
	#define MF_GPA4				NVTBIT(19, 16)		// GPA[4] Multi Function
	#define MF_GPA3				NVTBIT(15, 12)		// GPA[3] Multi Function
	#define MF_GPA2				NVTBIT(11, 8)		// GPA[2] Multi Function
	#define MF_GPA1				NVTBIT(7, 4)		// GPA[1] Multi Function
	#define MF_GPA0				NVTBIT(3, 0)		// GPA[0] Multi Function

#define REG_GPAFUN1	(GCR_BA+0x84)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPA15				NVTBIT(31, 28)		// GPA[15] Multi Function
	#define MF_GPA14				NVTBIT(27, 24)		// GPA[14] Multi Function
	#define MF_GPA13				NVTBIT(23, 20)		// GPA[13] Multi Function
	#define MF_GPA12				NVTBIT(19, 16)		// GPA[12] Multi Function
	#define MF_GPA11				NVTBIT(15, 12)		// GPA[11] Multi Function
	#define MF_GPA10				NVTBIT(11, 8)		// GPA[10] Multi Function
	#define MF_GPA9				NVTBIT(7, 4)		// GPA[9] Multi Function
	#define MF_GPA8				NVTBIT(3, 0)		// GPA[8] Multi Function


#define REG_GPBFUN0	(GCR_BA+0x88)	// R/W	Multi Function Pin Control Register 0

	#define MF_GPB7			NVTBIT(31, 28)	// GPB[7] Multi Function
	#define MF_GPB6			NVTBIT(27, 24)	// GPB[6] Multi Function
	#define MF_GPB5			NVTBIT(23, 20)	// GPB[5] Multi Function
	#define MF_GPB4			NVTBIT(19,16)	// GPB[4] Multi Function
	#define MF_GPB3			NVTBIT(15, 12)	// GPB[3] Multi Function
	#define MF_GPB2			NVTBIT(11, 8)	// GPB[2] Multi Function
	#define MF_GPB1			NVTBIT(7, 4)	// GPB[1] Multi Function
	#define MF_GPB0			NVTBIT(3, 0)	// GPB[0] Multi Function

#define REG_GPBFUN1	(GCR_BA+0x8C)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPB15			NVTBIT(31, 28)	// GPB[15] Multi Function
	#define MF_GPB14			NVTBIT(27, 24)	// GPB[14] Multi Function
	#define MF_GPB13			NVTBIT(23, 20)	// GPB[13] Multi Function
	#define MF_GPB12			NVTBIT(19, 16)	// GPB[12] Multi Function
	#define MF_GPB11			NVTBIT(15, 12)	// GPB[11] Multi Function
	#define MF_GPB10			NVTBIT(11, 8)	// GPB[10] Multi Function
	#define MF_GPB9			NVTBIT(7, 4)	// GPB[9] Multi Function
	#define MF_GPB8			NVTBIT(3, 0)	// GPB[8] Multi Function

