k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_GPCFUN0	(GCR_BA+0x90)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPC7			NVTBIT(31, 28)	// GPC[7] Multi Function
	#define MF_GPC6			NVTBIT(27, 24)	// GPC[6] Multi Function
	#define MF_GPC5			NVTBIT(23, 20)	// GPC[5] Multi Function
	#define MF_GPC4			NVTBIT(19, 16)	// GPC[4] Multi Function
	#define MF_GPC3			NVTBIT(15, 12)	// GPC[3] Multi Function
	#define MF_GPC2			NVTBIT(11, 8)	// GPC[2] Multi Function
	#define MF_GPC1			NVTBIT(7, 4)	// GPC[1] Multi Function
	#define MF_GPC0			NVTBIT(3, 0)	// GPC[0] Multi Function

#define REG_GPCFUN1	(GCR_BA+0x94)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPC15			NVTBIT(31, 28)	// GPC[15] Multi Function
	#define MF_GPC14			NVTBIT(27, 24)	// GPC[14] Multi Function
	#define MF_GPC13			NVTBIT(23, 20)	// GPC[13] Multi Function
	#define MF_GPC12			NVTBIT(19, 16)	// GPC[12] Multi Function
	#define MF_GPC11			NVTBIT(15, 12)	// GPC[11] Multi Function
	#define MF_GPC10			NVTBIT(11, 8)	// GPC[10] Multi Function
	#define MF_GPC9			NVTBIT(7, 4)	// GPC[9] Multi Function
	#define MF_GPC8			NVTBIT(3, 0)	// GPC[8] Multi Function


#define REG_GPDFUN0	(GCR_BA+0x98)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPD7			NVTBIT(31, 28)	// GPD[7] Multi Function
	#define MF_GPD6			NVTBIT(27, 24)	// GPD[6] Multi Function
	#define MF_GPD5			NVTBIT(23, 20)	// GPD[5] Multi Function
	#define MF_GPD4			NVTBIT(19, 16)	// GPD[4] Multi Function
	#define MF_GPD3			NVTBIT(15, 12)	// GPD[3] Multi Function
	#define MF_GPD2			NVTBIT(11, 8)	// GPD[2] Multi Function
	#define MF_GPD1			NVTBIT(7, 4)	// GPD[1] Multi Function
	#define MF_GPD0			NVTBIT(3, 0)	// GPD[0] Multi Function

#define REG_GPDFUN1	(GCR_BA+0x9C)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPD15			NVTBIT(31, 28)	// GPD[15] Multi Function
	#define MF_GPD14			NVTBIT(27, 24)	// GPD[14] Multi Function
	#define MF_GPD13			NVTBIT(23, 20)	// GPD[13] Multi Function
	#define MF_GPD12			NVTBIT(19, 16)	// GPD[12] Multi Function
	#define MF_GPD11			NVTBIT(15, 12)	// GPD[11] Multi Function
	#define MF_GPD10			NVTBIT(11, 8)	// GPD[10] Multi Function
	#define MF_GPD9			NVTBIT(7, 4)	// GPD[9] Multi Function
	#define MF_GPD8			NVTBIT(3, 0)	// GPD[8] Multi Function

#define REG_GPEFUN0	(GCR_BA+0xA0)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPE7			NVTBIT(31, 28)		// GPE[7] Multi Function
	#define MF_GPE6			NVTBIT(27, 24)		// GPE[6] Multi Function
	#define MF_GPE5			NVTBIT(23, 20)		// GPE[5] Multi Function
	#define MF_GPE4			NVTBIT(19, 16)		// GPE[4] Multi Function
	#define MF_GPE3			NVTBIT(15, 12)		// GPE[3] Multi Function
	#define MF_GPE2			NVTBIT(11, 8)		// GPE[2] Multi Function
	#define MF_GPE1			NVTBIT(7, 4)		// GPE[1] Multi Function
	#define MF_GPE0			NVTBIT(3, 0)		// GPE[0] Multi Function

#define REG_GPEFUN1	(GCR_BA+0xA4)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPE15			NVTBIT(31, 28)		// GPE[15] Multi Function
	#define MF_GPE14			NVTBIT(27, 24)		// GPE[14] Multi Function
	#define MF_GPE13			NVTBIT(23, 20)		// GPE[13] Multi Function
	#define MF_GPE12			NVTBIT(19, 16)		// GPE[12] Multi Function
	#define MF_GPE11			NVTBIT(15, 12)		// GPE[11] Multi Function
	#define MF_GPE10			NVTBIT(11, 8)		// GPE[10] Multi Function
	#define MF_GPE9			NVTBIT(7, 4)		// GPE[9] Multi Function
	#define MF_GPE8			NVTBIT(3, 0)		// GPE[8] Multi Function

#define REG_MISFUN		(GCR_BA+0xA8)	// R/W	Miscellaneous Multi Function Control Register
	#define MF_I2S				BIT0				// I2S I/F Functional Selection

#define REG_SPI_LVD_GPH 	(GCR_BA+0xAC)	// R/W	PI[3:2] And LVDATA[23:18] (GPIO H) Control Register
	#define DS_SPI_GPH			NVTBIT(23, 22)		// SPI_DATA[3:2] (GPIO_H[7:6]) Pin Driver Strength Control
	#define DS_LVD_GPH		NVTBIT(21, 16)		// LVDATAT[23:18] (GPIO_H[5:0]) Pin Driver Strength Control
	#define SL_SPI_GPH			NVTBIT(7, 6)		// SPI_DATA[3:2] (GPIO_H[7:6]) Pin Slew Rate Control
	#define SL_LVD_GPH		NVTBIT(5, 0)		// LVDATA[23:18] (GPIO_H[5:0]) Pin Slew Rate Control

#define REG_MISCPCR	(GCR_BA+0xB0)	// R/W	Miscellaneous Pin Control Register
	#define SL_MD				BIT7				// MD Pin Slew Rate Control
	#define SL_MA				BIT6				// MA Pin Slew Rate Control
	#define SL_MCTL			BIT5				// Memory I/F Control Pin Slew Rate Control
	#define SL_MCLK			BIT4				// MCLK Pin Rate Control
	#define DS_MD				BIT3				// MD Pins Driving Strength Control
	#define DS_MA				BIT2				// MA Pins Driving Strength Control
	#define DS_MCTL			BIT1				// MCTL Pins Driving Strength Control
	#define DS_MCLK			BIT0				// MCLK Pins Driving Strength Control

#define REG_MISC_SL_GPA	(GCR_BA+0xB4)	// R/W	GPIO A Slew Rate Control Register
	#define SL_GPA				NVTBIT(11, 0)		// GPA Pins Slew Rate Control
#define REG_MISC_SL_GPB	(GCR_BA+0xB8)	// R/W	GPIO B Slew Rate Control Register
	#define SL_GPB				NVTBIT(15, 0)		// GPB Pins Slew Rate Control
#define REG_MISC_SL_GPC	(GCR_BA+0xBC)	// R/W	GPIO C Slew Rate Control Register
	#define SL_GPC				NVTBIT(15, 0)		// GPC Pins Slew Rate Control
#define REG_MISC_SL_GPD	(GCR_BA+0xC0)	// R/W	GPIO D Slew Rate Control Register
	#define SL_GPD				NVTBIT(15, 0)		// GPD Pins Slew Rate Control
#define REG_MISC_SL_GPE	(GCR_BA+0xC4)	// R/W	GPIO E Slew Rate Control Register
	#define SL_GPE				NVTBIT(11, 0)		// GPE Pins Slew Rate Control
#define REG_MISC_SL_ND	(GCR_BA+0xC8)	// R/W  NAND Data PAD Slew Rate Control Register
	#define SL_ND			NVTBIT(7, 0)		// NAND Data Pin Slew Rate Control

#define REG_MISC_DS_GPA	(GCR_BA+0xCC)	// R/W	GPIO A Driver Strength Control Register
	#define DS_GPA			NVTBIT(11, 0)		// Driver Strength Control
#define REG_MISC_DS_GPB	(GCR_BA+0xD0)	// R/W	GPIO B Driver Strength Control Register
	#define DS_GPB			NVTBIT(15, 0)		// Driver Strength Control
#define REG_MISC_DS_GPC	(GCR_BA+0xD4)	// R/W	GPIO C Driver Strength Control Register
	#define DS_GPC			NVTBIT(15, 0)		// Driver Strength Control
#define REG_MISC_DS_GPD	(GCR_BA+0xD8)	// R/W	GPIO D Driver Strength Control Register
	#define DS_GPD			NVTBIT(15, 0)		// Driver Strength Control
#define REG_MISC_DS_GPE	(GCR_BA+0xDC)	// R/W	GPIO E Driver Strength Control Register
	#define DS_GPE			NVTBIT(11, 0)		// Driver Strength Control
#define REG_MISC_DS_ND	(GCR_BA+0xE0)	// R/W  NAND Data PAD Driver Strength Control Register
	#define DS_ND			NVTBIT(7, 0)		// NAND Data Pin Driver Strength Control

