k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_MISC_SSEL	(GCR_BA+0xE4)
	#define SDRAM_MCLK		NVTBIT(9, 8)		// MCLK Pins Driving Strength Control and Mode.
	#define SDRAM_MA			NVTBIT(7, 6)		// MA Pins Driving Strength Control and Mode.
	#define SDRAM_MBA			NVTBIT(5, 4)		// MBA Pins Driving Strength  Control and Mode.
	#define SDRAM_MCTL		NVTBIT(3, 2)		// MCTL Pins Driver Strength Control and Mode.
	#define SDRAM_MD			NVTBIT(1, 0)		// MD Data Pins Driver Strength Control and Mode

#define REG_GPGFUN0	(GCR_BA+0xE8)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPG7			NVTBIT(31, 28)	// GPG[7] Multi Function
	#define MF_GPG6			NVTBIT(27, 24)	// GPG[6] Multi Function
	#define MF_GPG5			NVTBIT(23, 20)	// GPG[5] Multi Function
	#define MF_GPG4			NVTBIT(19, 16)	// GPG[4] Multi Function
	#define MF_GPG3			NVTBIT(15, 12)	// GPG[3] Multi Function
	#define MF_GPG2			NVTBIT(11, 8)	// GPG[2] Multi Function
	#define MF_GPG1			NVTBIT(7, 4)	// GPG[1] Multi Function
	#define MF_GPG0			NVTBIT(3, 0)	// GPG[0] Multi Function

#define REG_GPGFUN1	(GCR_BA+0xEC)	// R/W	Multi Function Pin Control Register 0
	#define MF_GPG15			NVTBIT(31, 28)	// GPG[15] Multi Function
	#define MF_GPG14			NVTBIT(27, 24)	// GPG[14] Multi Function
	#define MF_GPG13			NVTBIT(23, 20)	// GPG[13] Multi Function
	#define MF_GPG12			NVTBIT(19, 16)	// GPG[12] Multi Function
	#define MF_GPG11			NVTBIT(15, 12)	// GPG[11] Multi Function
	#define MF_GPG10			NVTBIT(11, 8)	// GPG[10] Multi Function
	#define MF_GPG9			NVTBIT(7, 4)	// GPG[9] Multi Function
	#define MF_GPG8			NVTBIT(3, 0)	// GPG[8] Multi Function

#define REG_GPHFUN	(GCR_BA+0xF0)	// R/W	Dummy GPIO
	#define MF_GPH15			NVTBIT(31, 30)		// GPH[15] Multi Function
	#define MF_GPH14			NVTBIT(29, 28)		// GPH[14] Multi Function
	#define MF_GPH13			NVTBIT(27, 26)		// GPH[13] Multi Function
	#define MF_GPH12			NVTBIT(25, 24)		// GPH[12] Multi Function
	#define MF_GPH11			NVTBIT(23, 22)		// GPH[11] Multi Function
	#define MF_GPH10			NVTBIT(21, 20)		// GPH[10] Multi Function
	#define MF_GPH9			NVTBIT(19, 18)		// GPH[9] Multi Function
	#define MF_GPH8			NVTBIT(17, 16)		// GPH[8] Multi Function
	#define MF_GPH7			NVTBIT(15, 14)		// GPH[7] Multi Function
	#define MF_GPH6			NVTBIT(13, 12)		// GPH[6] Multi Function
	#define MF_GPH5			NVTBIT(11, 10)		// GPH[5] Multi Function
	#define MF_GPH4			NVTBIT(9, 8)		// GPH[4] Multi Function
	#define MF_GPH3			NVTBIT(7, 6)		// GPH[3] Multi Function
	#define MF_GPH2			NVTBIT(5, 4)		// GPH[2] Multi Function
	#define MF_GPH1			NVTBIT(3, 2)		//GPH[1] Multi Function
	#define MF_GPH0			NVTBIT(1, 0)		// GPH[0] Multi Function

#define REG_SHRPIN_TVDAC	(GCR_BA+0xF4)	// R/W	Share Pin With TV DAC
	#define SMTVDACAEN		BIT31

#define REG_SHRPIN_AUDIO	(GCR_BA+0xF8)	// R/W	Share Pins with AUDIO ADC
	#define MIC_AEN			BIT31			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC MICP, MICN
	#define AIN2_AEN			BIT30			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC AIN2 Pins
	#define AIN3_AEN			BIT29			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC AIN3 Pins
	#define AIN4_AEN			BIT28			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC AIN4 Pins

#define REG_SHRPIN_TOUCH	(GCR_BA+0xFC)	// R/W	Share Pins with TOUCH ADC
	#define SAR_AHS_AEN		BIT31			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC AHS Pins.
	#define TP_AEN				BIT30			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC XP, XM, YP, YM Pins
	#define MIC_BIAS_AEN		BIT29			// Analog and Digital Share I/O Pad Control Bit for SAR-ADC MIC_BIAS Pin

#define REG_EXTRST_DEBOUNCE	(GCR_BA+0x100)	// R/W	External RESET Debounce Control Register
	#define EXTRST_DEBOUNCE		BIT0				// External RESET Debounce Control

#define REG_DEBOUNCE_CNTR	(GCR_BA+0x104)	// R/W	 External RESET Debounce Counter Register
	#define DEBOUNCE_CNTR		NVTBIT(15, 0)				// External RESET Debounce Counter


/*
	Clock controller Registers
*/
#define REG_PWRCON	(CLK_BA+0x00)	// R/W	System Power Down Control Register
	#define PRE_SCALAR			NVTBIT(23, 8)		// Pre-Scalar counter
	#define SEN1_OFF_ST		BIT5				// Sensor 1 clock level if clock off state
	#define SEN0_OFF_ST		BIT4				// Sensor 0 clock level if clock off state
	#define INT_EN				BIT3				// Power On Interrupt Enable
	#define INTSTS				BIT2				// Power Down interrupt status
	#define XIN_CTL			BIT1				// Crystal pre-divide control for Wake-up from power down mode
	#define XTAL_EN			BIT0				// Crystal (Power Down) Control

#define REG_AHBCLK	(CLK_BA+0x04)	// R/W¡@AHB Clock Enable Control Register
	#define SDIO_CKE			BIT31			// SDIO Clock Enable Control
	#define ADO_CKE			BIT30			// Audio DAC Engine Clock Enable Control0 = Disable1 = Enable
	#define SEN_CKE			BIT29			// Sensor Interface Clock Enable Control0 = Disable1 = Enable
	#define SEN0_CKE			SEN_CKE
	#define VIN_CKE			BIT28			// Capture Clock Enable Control (Also is Capture engine clock enable control)0 = Disable1 = Enable
	#define VIN0_CKE			VIN_CKE
	#define VPOST_CKE			BIT27			// VPOST Clock Enable Control (Also is VPOST engine clock enable control)0 = Disable1 = Enable
	#define I2S_CKE			BIT26			// I2S Controller Clock Enable Control0 = Disable1 = Enable
	#define SPU_CKE			BIT25			// SPU Clock Enable Control0 = Disable1 = Enable
	#define HCLK4_CKE			BIT24			// HCLK4 Clock Enable Control0 = Disable1 = Enable
	#define SD_CKE			BIT23			// SD Card Controller Engine Clock Enable Control0 = Disable1 = ENable
	#define NAND_CKE			BIT22			// NAND Controller Clock Enable Control0 = Disable1 = ENable
	#define SIC_CKE			BIT21			// SIC Clock Enable Control0 = Disable1 = ENable
	//#define OVG_CKE			BIT20			// Graphic Processing Unit Clock Enable Control0 = Disable1 = ENable
	#define GVE_CKE			BIT19			// GE4P Clock Enable Control0 = Disable1 = ENable
	#define USBD_CKE			BIT18			// USB Device Clock Enable Control0 = Disable1 = Enable
	#define USBH_CKE			BIT17			// USB Host Controller Clock Enable Control0 = Disable1 = Enable
	#define HCLK3_CKE			BIT16			// HCLK3 Clock Enable Control.0 = Disable1 = Enable
	#define VDE_CKE			BIT15			// Video Decoder Clock Enable Control
	#define EDMA4_CKE			BIT14			// EDMA Controller Channel 4 Clock Enable Control
	#define EDMA3_CKE			BIT13			// EDMA Controller Channel 3 Clock Enable Control
	#define EDMA2_CKE			BIT12			// EDMA Controller Channel 2 Clock Enable Control
	#define EDMA1_CKE			BIT11			// EDMA Controller Channel 1 Clock Enable Control
	#define EDMA0_CKE			BIT10			// EDMA Controller Channel 0 Clock Enable Control
	#define IPSEC_CKE			BIT9				// AES Clock Enable Control. 0 = Disable; 1 = Enable.
	#define HCLK1_CKE			BIT8				// HCLK1 Clock Enable Control.0 = Disable1 = Enable
	#define JPG_CKE			BIT7				// JPEG Clock Enable
	#define VPE_CKE			BIT6				// Video Engine Clock Enable Control
	#define BLT_CKE			BIT5				// Bitblt Engine Clock Enable Control
	#define DRAM_CKE			BIT4				// SDRAM and SDRAM Controller Clock Enable Control.0 = Disable1 = Enable
	#define SRAM_CKE			BIT3				// SRAM Controller Clock Enable Control.0 = Disable1 = Enable
	#define HCLK_CKE			BIT2				// HCLK Clock Enable Control. (This clock is used for DRAM controller, SRAM controller and AHB-to-AHB bridge)0 = Disable1 = Enable
	#define APBCLK_CKE			BIT1				// APB Clock Enable Control.0 = Disable1 = Enable
	#define CPU_CKE	 		BIT0				// CPU Clock Enable Control

#define REG_APBCLK	(CLK_BA+0x08)	// R/W¡@APB Clock Enable Control Register
	#define KPI_CKE			BIT25 			// KPI Clock Enable Control
	#define TIC_CKE			BIT24 			// TIC Clock Enable
	#define TMR3_CKE			BIT17		//Timer3 Clock Enable Control
	#define TMR2_CKE			BIT16		//Timer2 Clock Enable Control
	#define WDCLK_CKE			BIT15			// Watch Dog Clock Enable Control (Also is Watch Dog engine clock enable control)
	#define RSC_CKE			BIT12			// Reed-Solomon Codec Clock Enable Control
	#define CONVENC_CKE		BIT11			// Convolution Encoder Clock Enable Control
	#define TOUCH_CKE			BIT10			// TOUCH Clock Enable Control
	#define TMR1_CKE			BIT9				// Timer1 Clock Enable Control0 = Disable1 = Enable
	#define TMR0_CKE			BIT8				// Timer0 Clock Enable Control0 = Disable1 = Enable
	#define SPIMS1_CKE			BIT7				// SPIM (Master Only) Clock Enable Control0 = Disable1 = Enable
	#define SPIMS0_CKE			BIT6				// SPIMS (Master / Slave) Clock Enable Control0 = Disable1 = Enable
	#define PWM_CKE			BIT5				// PWM Clock Enable Control0 = Disable1 = Enable
	#define UART1_CKE			BIT4				// UART1 Clock Enable Control0 = Disable1 = Enable
	#define UART0_CKE			BIT3				// UART0 Clock Enable Control0 = Disable1 = Enable
	#define RTC_CKE			BIT2				// RTC Clock Enable Control (NOT X32K clock enable control)0 = Disable1 = Enable
	#define I2C_CKE			BIT1				// I2C Clock Enable Control0 = Disable1 = Enable
	#define ADC_CKE			BIT0				// ADC Clock Enable Control (Also is ADC engine clock enable control)0 = Disable1 = Enable

#define REG_CLKDIV0	(CLK_BA+0x0C)	// R/W¡@Clock Divider Register0
	//#define SYSTEM_INTEG		NVTBIT(31, 29)		// Sensor clock divide number from sensor clock source
	//#define SYSTEM_FRACTM		NVTBIT(28, 27)		// Sensor clock divide number from sensor clock source
	#define SENSOR0_N1		NVTBIT(27, 24)		// Sensor clock divide number from sensor clock source
	#define SENSOR0_S			NVTBIT(23, 22)		// Sensor clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define SENSOR0_N0		NVTBIT(21, 19)		// Sensor clock pre-divider number from Sensor clock source if Sensor clock source select is APLL or UPLL
	#define KPI_N0				NVTBIT(18, 12)		// KPI Engine Clock Divider Bits [3:0]
	#define SYSTEM_FRACTL		NVTBIT(11, 8)		// SYSTEM clock divide number from system clock source
	#define SYSTEM_N1			SYSTEM_FRACTL	// SYSTEM clock divide number from system clock source
	#define KPI_S				BIT5				// KPI Engine Clock Source Selection
	#define SYSTEM_S			NVTBIT(4, 3)		// System clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define SYSTEM_N0			NVTBIT(2, 0)		// SYSTEM clock pre-divider number from system clock source if System clock source select is APLL or UPLL

#define REG_CLKDIV1	(CLK_BA+0x10)	// R/W¡@Clock Divider Register1
	#define ADO_N1			NVTBIT(31, 24)		// Audio DAC engine clock divide number from Audio DAC engine clock source
	#define ADO_S				NVTBIT(20, 19)		// Audio DAC engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define ADO_N0			NVTBIT(18, 16)		// Audio DAC engine clock pre-divide number
	#define VPOST_N1			NVTBIT(15, 8)		// VPOST engine clock divide number from VPOST engine clock source
	#define VPOST_S			NVTBIT(4, 3)		// VPOST engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define VPOST_N0			NVTBIT(2, 0)		// VPOST engine clock pre-divide number

#define REG_CLKDIV2	(CLK_BA+0x14)	// R/W¡@Clock Divider Register2
	#define SD_N1				NVTBIT(31, 24)		// SD engine clock divide number from SD engine clock source
	#define SD_S				NVTBIT(20, 19)		// SD engine clock source select  00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define SD_N0				NVTBIT(18, 16)		// SD engine clock pre-divide number
	#define U20PHY_SS			NVTBIT(22, 21)		// USB Device
	#define U20PHY_N			NVTBIT(15, 12)		// USB Device
	#define USB_N1			NVTBIT(11, 8)		// USB host engine clock divide number from USB engine clock source
	#define U20PHY_DS			NVTBIT(7, 5)		// USB Device
	#define USB_S				NVTBIT(4, 3)		// USB host engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define USB_N0			NVTBIT(2, 0)		// USB host engine clock Pre-divide number

