k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_CLKDIV3	(CLK_BA+0x18)	// R/W¡@Clock Divider Register3
	#define ADC_N1			NVTBIT(31, 24) 	// ADC engine clock divide number from ADC engine clock source
	#define ADC_S				NVTBIT(20, 19) 	// ADC engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define ADC_N0			NVTBIT(18, 16) 	// ADC engine clock pre-divide number from ADC engine clock source
	#define UART1_N1			NVTBIT(15, 13) 	// UART1 engine clock divide number from UART1 engine clock source
	#define UART1_S			NVTBIT(12, 11)		// UART1 engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define UART1_N0			NVTBIT(10, 8)  		// UART1 engine clock pre-divide number from UART1 engine clock source
	#define UART0_N1			NVTBIT(7, 5) 		// UART0 engine clock divide number from UART1 engine clock source
	#define UART0_S			NVTBIT(4, 3) 		// UART0 engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define UART0_N0			NVTBIT(2, 0)   		// UART0 engine clock pre-divide number from UART1 engine clock source

#define REG_CLKDIV4	(CLK_BA+0x1C)	// R/W¡@Clock Divider Register4
	#define VIN1_N				NVTBIT(29, 27)		// JPG 	engine clock divide number from HCLK4
	#define JPG_N				NVTBIT(26, 24)		// JPG 	engine clock divide number from HCLK3
	#define GPIO_N			NVTBIT(23, 17)		// GPIO engine clock divide number from GPIO engine clock source
	#define CAP_N				NVTBIT(14, 12)		// Capture engine clock divide number from HCLK4 clock.Engine Clock frequency = HCLK4 / (CAP_N + 1)
	#define VIN0_N				CAP_N
	#define CHG_APB			BIT11
	#define APB_N				NVTBIT(10, 8) 		// APB clock divide number from HCLK1 clock. The HCLK1 clock frequency is the lower of system clock divided by 2 or the CPU clockThe APB clock frequency = (HCLK1 frequency) / (APB_N + 1)
	#define HCLK234_N			NVTBIT(7, 4)		// HCLK2, HCLK3 and HCLK4 clock divide number from HCLK clock. The HCLK clock frequency is the system clock frequency divided by two.The HCLK2,3,4 clock frequency = (HCLK frequency) / (HCLK234_N + 1)
	#define CPU_N				NVTBIT(3, 0)		// CPU clock divide number from System clock.The CPU clock frequency = (System frequency) / (CPU_N + 1)

#define REG_APLLCON	(CLK_BA+0x20)	// R/W¡@APLL Control Register
#define REG_UPLLCON	(CLK_BA+0x24)	// R/W¡@UPLL Control Register
#define REG_MPLLCON	(CLK_BA+0x28)	// R/W¡@UPLL Control Register
	#define BP				BIT15			// PLL By Pass Control
	#define PD				BIT14			// Power Down Mode
	#define OUT_DV			NVTBIT(12, 11)		// PLL Output Divider Control
	#define IN_DV				NVTBIT(10, 7)		// PLL Input Divider Control
	#define FB_DV				NVTBIT(6, 0)		// PLL Feedback Divider Control

#define REG_CLK_TREG	(CLK_BA+0x30)
	#define TEST_CKE			BIT7				// Test Colck Output Enable.
	#define SW_CLK				BIT6			// Software Generated Clock.
	#define TEST_CLK_SEL		NVTBIT(5, 0)		// Test Clock Select.

#define REG_AHBCLK2	(CLK_BA+0x34)	// R/W¡@AHB Clock Enable Control Register2
	#define CRC1_CKE				BIT19			// CRC1 Clock Enable Control
	#define ROTE_CKE				BIT18			// Rotate Engine Clock Enable Control
	#define EDMA26_CKE			BIT17			// EDMA#2 Controller Channel 6 Clock Enable Control
	#define EDMA25_CKE			BIT16			// EDMA#2 Controller Channel 5 Clock Enable Control
	#define EDMA24_CKE			BIT15			// EDMA#2 Controller Channel 4 Clock Enable Control
	#define EDMA23_CKE			BIT14			// EDMA#2 Controller Channel 3 Clock Enable Control
	#define EDMA22_CKE			BIT13			// EDMA#2 Controller Channel 2 Clock Enable Control
	#define EDMA21_CKE			BIT12			// EDMA#2 Controller Channel 1 Clock Enable Control
	#define EDMA20_CKE			BIT11			// EDMA#2 Controller Channel 0 Clock Enable Control
	#define VENC_CKE				BIT10			// H.264 encoder Clock Enable Control
	#define VDEC_CKE				BIT9				// H.264 decoder Clock Enable Control
	#define AAC_CKE				BIT8				// AAC Controller Clock enable control
	#define EMAC_CKE				BIT7				// EMAC Clock Enable Control
	#define CRC_CKE				BIT6				// CRC Clock Enable Control
	#define H20PHY_CKE			BIT5				// USB2.0 Host PHY Clock Enable Control
	#define OHCI_CKE				BIT4				// USB2.0 OHCI Clock Enable Control
	#define SEN1_CKE				BIT3				// EDMA Controller Channel 6 Clock Enable Control
	#define VIN1_CKE				BIT2				// EDMA Controller Channel 5 Clock Enable Control
	#define EDMA6_CKE				BIT1				// EDMA Controller Channel 6 Clock Enable Control
	#define EDMA5_CKE				BIT0				// EDMA Controller Channel 5 Clock Enable Control

#define REG_CLKDIV5	(CLK_BA+0x38)	// R/W¡@AHB Clock Enable Control Register2
	#define TOUCH_N1			NVTBIT(31, 27)		// TOUCH Engine Clock Divider Bits [4:0]
	#define TOUCH_S			NVTBIT(26, 25)		// TOUCH Engine Clock Source Selectione Control
	#define TOUCH_N0			NVTBIT(24, 22)		// TOUCH Engine Clock Divider If PLL
	#define SENSOR1_N1		NVTBIT(21, 18)		// Sensor Clock Divider Bits [4:0]
	#define SENSOR1_S			NVTBIT(17, 16)		// Sensor Clock Source Selectione Control
	#define SENSOR1_N0		NVTBIT(15, 13)		// Sensor Clock Divider If PLL
	#define PWM_N1			NVTBIT(12, 5)		// PWM Clock Divider Bits [4:0]
	#define PWM_S				NVTBIT(4, 3)		// PWM Clock Source Selectione Control
	#define PWM_N0			NVTBIT(2, 0)		// PWM Clock Divider If PLL

#define REG_CLKDIV6	(CLK_BA+0x3C)	// R/W¡@AHB Clock Enable Control Register2
	#define H20PHY_N1			NVTBIT(27, 24)		// USB2.0 Host PHY Clock Divider 1
	#define H20PHY_S			NVTBIT(20, 19)		// H20PHY Clock Source Divide Selection
	#define H20PHY_N0			NVTBIT(18, 16)		// USB2.0 Host PHY Clock Divider 0
	#define OHCI_N1			NVTBIT(11, 8)		// OHCI Clock Divider 1
	#define OHCI_S			NVTBIT(4, 3)		// OHCI Clock Source Selection
	#define OHCI_N0			NVTBIT(2, 0)		// OHCI Clock Divider 0

#define REG_CLKDIV7 (CLK_BA+0x40)				// R/W¡@Clock Divider Register7
	#define I2S_N1				NVTBIT(23, 16)		// I2S engine clock divide number 1
	#define I2S_S				NVTBIT(12, 11)		// I2S engine clock source select 00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define I2S_N0				NVTBIT(10, 8)		// I2S engine clock pre-divide number
	#define DRAM_N1			NVTBIT(7, 5)		// DRAM Clock Divider 1
	#define DRAM_S			NVTBIT(4, 3)		// DRAM Clock
	#define DRAM_N0			NVTBIT(2, 0)		// DRAM Clock Divider 0

#define REG_CLKDIV8 (CLK_BA+0x44)				// R/W¡@Clock Divider Register8
	#define SDIO_N1			NVTBIT(12, 5)		// SD engine clock divide number from SD engine clock source
	#define SDIO_S				NVTBIT(4, 3)		// SD engine clock source select  00 = XIN. 01 = X32K. 10 = APLL. 11 = UPLL
	#define SDIO_N0			NVTBIT(2, 0)		// SD engine clock pre-divide number

