k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
/*
	Rotation engine controller registers
*/
#define REG_SCCR	(ROT_BA+0x00)		// R/W¡@SRAM Controller Control Register
	#define ROTSW_RST				BIT0				// SRAM Controller software reset

#define REG_RCR	(ROT_BA+0x10)		// R/W¡@Control Register
	#define IMG_DFMT				NVTBIT(7, 6)		// Image Data Format
	#define LINE_BUF_SIZE			NVTBIT(5, 4)		// Line Buffer Size
	#define ROTE_DIR				BIT1				// Rotation Direction
	#define ROTE_EN				BIT0				// Rotation Enable

#define REG_RICR	(ROT_BA+0x14)		// R/W¡@Interrupt Control Register
	#define SRAM_OF_EN			BIT20				// SRAM read/write overflow Interrupt Enable
	#define TG_ABORT_EN			BIT18				// Target Abort Interrupt Enable
	#define ROTE_INT_EN			BIT16				// Rotation Finished Interrupt Enable
	#define SRAM_OF				BIT4				// SRAM read/write overflow
	#define TG_ABORT			        BIT2				// EAHB Master Receive Target Abort
	#define ROTE_FINISH			BIT0				// Rotation Finished

#define REG_RIS		(ROT_BA+0x18)		// R/W¡@Rotation Image Size
	#define ROT_HEIGHT				NVTBIT(27, 16)		// Height of rotation image size (must be even number)
	#define ROT_WIDTH				NVTBIT(11, 0)		// Width of rotation image size (must be even number)

#define REG_RSISA	(ROT_BA+0x1C)		// R/W¡@Source Image Starting Address
#define REG_RSILOFF	(ROT_BA+0x20)		// R/W¡@Source Image Line Offset
	#define RSI_LOFF				NVTBIT(11, 0)		// Rotation Source Image Line Offset (right-offset by byte-unit)
#define REG_RDISA	(ROT_BA+0x24)		// R/W¡@Destination Image Starting Address
#define REG_RDILOFF	(ROT_BA+0x2C)		// R/W¡@Destination Image Line Offset
	#define RDI_LOFF				NVTBIT(11, 0)		// Rotation Destination  Image Line Offset (right-offset by byte-unit)

/*
	SDRAM controller registers
*/
#define REG_SDOPM 	(SDRAM_BA + 0x00)	// R/W	SDRAM Controller Operation Mode Control Register
		#define AUTO_DQSPHASE	NVTBIT(30, 28)		// DQS Phase Detector Output Value
		#define RDDATASEL		BIT24			// Enable Hardware Auto Wait Cycle
		#define HW_RWC_EN	BIT22			// Enable Hardware Auto-Read Wait Cycle Setting
		#define PHASE_SHIFT_EN	BIT21			// Select Shift half-cycle data to be sampled data
		#define DQS_PHASE_RST	BIT20			// DQS_PHASE_RESET signal
		#define OEDELAY		BIT19			// Output Enable Delay Half MCLK
		#define LOWFREQ		BIT18			// Low Frequency Mode
		#define PREACTBNK     	BIT17			// Pre-Active Bank
		#define AUTOPDN       	BIT16			// Auto Power Down Mode
		#define SEL_SCLKI            BIT15
		#define RDBUFTH       	NVTBIT(10, 8)		// The AHB read SDRAM read buffer threshold control
		#define SD_TYPE       	NVTBIT(6, 5)		// SDRAM Type
		#define PCHMODE      	BIT4				// SDRAM Type
		#define OPMODE        	BIT3				// Open Page Mode
		#define MCLKMODE      	BIT2				// Auto Pre-Charge Mode
		#define DRAM_EN      	BIT1				// SDRAM Controller Enable

#define REG_SDCMD 	(SDRAM_BA + 0x04)	// R/W	SDRAM Command Register
		#define AUTOEXSELFREF	BIT5				// Auto Exit Self-Refresh
		#define SELF_REF       	BIT4				// Self-Refresh Command
		#define REF_CMD       	BIT3				// Auto Refresh Command
		#define PALL_CMD       	BIT2				// Pre-Charge All Bank Command
		#define CKE_H           	BIT1    			// CKE High
		#define INITSTATE		BIT0				// Initial State
#define REG_SDREF 	(SDRAM_BA + 0x08)	// R/W	SDRAM Controller Refresh Control Register
		#define REF_EN			BIT15			// Refresh Period Counter Enable
		#define REFRATE		NVTBIT(14, 0)		// Refresh Count Value
#define REG_SDSIZE0	(SDRAM_BA + 0x10)	// R/W	SDRAM 0 Size Register
#define REG_SDSIZE1	(SDRAM_BA + 0x14)	// R/W	SDRAM 0 Size Register
		#define BASADDR		NVTBIT(28, 21) 	// Base Address
		#define BUSWD			BIT3				// SDRAM Data Bus width
		#define DRAMSIZE		NVTBIT(2, 0)		// Size of SDRAM Device

#define REG_SDMR		(SDRAM_BA + 0x18)	// R/W	SDRAM Mode Register
		#define SDMR_CONFIGURE	NVTBIT(13, 7) // SDRAM Dependent Configuration
		#define LATENCY			NVTBIT(6, 4) 	// CAS Latency
		#define BRSTTYPE			BIT3			// Burst Type
		#define BRSTLENGTH		NVTBIT(2, 0) 	// Burst Length
#define REG_SDEMR	(SDRAM_BA + 0x1C)	// R/W	SDRAM Extended Mode Register
		#define SDEMR_CONFIGURE	NVTBIT(13, 2) 	// SDRAM Dependent Configuration
		#define DRVSTRENGTH		BIT1 			// Output Drive Strength
		#define DLLEN				BIT0			// DLL Enable
#define REG_SDEMR2	(SDRAM_BA + 0x20)	// R/W	SDRAM Extended Mode Register 2
		//#define SDEMR2_MR_DEF		NVTBIT(17, 15) 	// Mode Register Definition
		#define SDEMR2_CONFIGURE	NVTBIT(13, 0)		// SDRAM Dependent Configuration
#define REG_SDEMR3 (SDRAM_BA+ 0x24)	// R/W	SDRAM Extended Mode Register 3
		//#define SDEMR3_MR_DEF		NVTBIT(17, 15) 	// Mode Register Definition
		#define SDEMR3_CONFIGURE	NVTBIT(13, 0)	  	// SDRAM Dependent Configuration
#define REG_SDTIME		(SDRAM_BA + 0x28)	// R/W	SDRAM Timing Control Register
		#define TWTR				NVTBIT(30, 29) 	// Internal Write to Read Command Delay
		#define TRRD				NVTBIT(28, 27) 	// Active Bank a to Active Bank b Command Delay
		#define TRC				NVTBIT(26, 22) 	// Active to Active Command Delay
		#define TXSR				NVTBIT(21, 17) 	// Exit SELF REFRESH to ACTIVE Command Delay
		#define TRFC				NVTBIT(16, 12) 	// AUTO REFRESH Period
		#define TRAS				NVTBIT(11, 8) 		// ACTIVE to PRECHARGE Command Delay
		#define TRCD				NVTBIT(7, 5) 		// Active to READ or WRITE Delay
		#define TRP				NVTBIT(4, 2) 		// PRECHARGE Command Period
		#define TWR 				NVTBIT(1, 0) 		// WRITE Recovery Time

#if 0 /* FA92 removed */
#define REG_DQSODS	(SDRAM_BA + 0x30)	// R/W	DQS Output Delay Selection Register
		#define DQSINVEN			BIT13 			// DQS Invert Enable
		#define DQS1_ODS			NVTBIT(12, 8) 		// DQS1 Output Delay Selection
		#define DQS0_ODS			NVTBIT(4, 0) 		// DQS0 Output Delay Selection
#endif
#define REG_CKDQSDS	(SDRAM_BA + 0x34)	// R/W	Clock and DQS Delay Selection Register
		#define READ_WAIT_CYCLE	NVTBIT(25, 24) 	// DQS1 Input Delay Selection 1
		#define DATACLK_DELAYSEL	NVTBIT(20, 16) 	// DQS1 Input Delay Selection 0
		#define DS1_SKEW			NVTBIT(15, 12) 	// DQS0 Input Delay Selection 1
		#define DS0_SKEW			NVTBIT(11, 8) 		// DQS0 Input Delay Selection 0
		//#define DCLK_DS			NVTBIT(7, 4) 		// Data Clock Delay Selection
		//#define DCLKSRCSEL			BIT3 			// Data Clock Source Selection
		#define MCLK_ODS			NVTBIT(2, 0) 		// MCLK Output Delay Selection
#if 0 /* FA92 removed */
#define REG_TESTCR	(SDRAM_BA + 0x40)	// R/W	SDRAM test control register
		#define STATUS_CLR			BIT31 			// Test Status Clear
		#define TEST_EN			BIT30			// Connection Test Enable
		#define BIST_EN			BIT29 			// SDRAM BIST Enable
		#define MARCH_C			BIT28			// MARCH_C Algorithm Used
		#define MAX_ADDR			NVTBIT(26, 0) 		// Maximum Test Address
#define REG_TSTATUS	(SDRAM_BA + 0x44)	// R	SDRAM test status register
		#define TEST_BUSY			BIT31 			// Test BUSY
		#define CON_BUSY			BIT30			// Connection Test Busy
		#define BIST_BUSY			BIT29			// BIST Test Busy
		#define TEST_FAIL			BIT28 			// Test Failed
		#define CON_FAIL			BIT27			// Connection Test Failed
		#define BIST_FAIL			BIT26 			// BIST Test Failed
#define REG_TFDATA		(SDRAM_BA+ 0x48)	// R	SDRAM test fail data
#define REG_TGDATA		(SDRAM_BA + 0x4C)// R	SDRAM test Gold data
		#define TGDATA			NVTBIT(31, 0) 		// Test Gold data
#define REG_TGDATA		(SDRAM_BA + 0x4C)// R	SDRAM test Gold data
		#define TGDATA			NVTBIT(31, 0) 		// Test Gold data
#endif
#define REG_DLLMODE		(SDRAM_BA + 0x54)// R	SDRAM test Gold data
		#define DLL_EN				BIT3				// Enable DLL
		#define DLL_PARAM			NVTBIT(2, 0) 		// DLL DQS Delay Selection
#define REG_DBGREG		(SDRAM_BA + 0x70)// R	SDRAM test Gold data
		#define SRF_STATE			BIT28			// SDIC Currently Stays in Self-Refresh state
		#define FSM_CSTATE		NVTBIT(27, 0) 		// FSM Current State

/* Timer Registers */
//#define TMR_BA		w55fa92_VA_TIMER	/* Timer */
#define REG_TCSR0		(TMR_BA+0x00)  /* Timer Control and Status Register 0 */
	#define TCSR_DBGACK_EN		BIT31				// ICE debug mode acknowledge enable
	#define CEN					BIT30				// Counter Enable
	#define TCSR_IE				BIT29				// Interrupt Enable
	#define TCSR_MODE			NVTBIT(28,27)		// Timer Operating Mode
	#define CRST					BIT26				// Counter Reset
	#define CACT					BIT25				// Timer is in Active
	#define TDR_EN				BIT16				// Timer Data Register update enable
	#define TCSR_PRESCALE		NVTBIT(7,0)			// Prescale
#define REG_TCSR1		(TMR_BA+0x04)  /* Timer Control and Status Register 1 */
#define REG_TICR0		(TMR_BA+0x08)  /* Timer Initial Control Register 0 */
#define REG_TICR1		(TMR_BA+0x0C)  /* Timer Initial Control Register 1 */
#define REG_TDR0		(TMR_BA+0x10)  /* Timer Data Register 0 */
#define REG_TDR1		(TMR_BA+0x14)  /* Timer Data Register 1 */
#define REG_TISR		(TMR_BA+0x18)  /* Timer Interrupt Status Register */
	#define TIF1				BIT1				// Timer Interrupt Flag 1
	#define TIF0				BIT0				// Timer Interrupt Flag 0
#define REG_WTCR		(TMR_BA+0x1C)  /* Watchdog Timer Control Register */
	#define WTCLK				BIT10				// Watchdog Timer Clock
	#define WTCR_DBGACK_EN	BIT9					// ICE debug mode acknowledge enable
	#define WTTME				BIT8					// Watchdog Timer Test Mode Enable
	#define WTE					BIT7				// Watchdog Timer Test Mode Enable
	#define WTIE					BIT6					// Watchdog Timer Enable
	#define WTIS					NVTBIT(5,4)				// Watchdog Timer Interval Select
	#define WTIF					BIT3				// Watchdog Timer Interrupt Flag
	#define WTRF				BIT2				// Watchdog Timer Reset Flag
	#define WTRE				BIT1				// Watchdog Timer Reset Enable
	#define WTR					BIT0				// Watchdog Timer Reset

#define REG_TCSR2		(TMR2_BA+0x00)  /* Timer Control and Status Register 2 */
#define REG_TCSR3		(TMR2_BA+0x04)  /* Timer Control and Status Register 3 */
#define REG_TICR2		(TMR2_BA+0x08)  /* Timer Initial Control Register 2 */
#define REG_TICR3		(TMR2_BA+0x0C)  /* Timer Initial Control Register 3 */
#define REG_TDR2		(TMR2_BA+0x10)  /* Timer Data Register 2 */
#define REG_TDR3		(TMR2_BA+0x14)  /* Timer Data Register 3 */
#define REG_TISR2		(TMR2_BA+0x18)  /* Timer Interrupt Status Register */

/*  VPOST Control Registers */
#define REG_LCM_LCDCCtl  	 		(VPOST_BA+0x00)  	// R/W: LCD Controller Control Register
	#define LCDCCtl_FSADDR_SEL		BIT31
	#define LCDCCtl_HAW_656			BIT30				// CCIR656 mode select
	#define LCDCCtl_PRDB_SEL		NVTBIT(21,20)		// Parallel RGB data bus selection for High Resolution Mode
	#define LCDCCtl_YUV_CLIP_EN		BIT17				// YUV clipped enable bit, Y(0 ~ 240), UV (0 ~235)
	#define LCDCCtl_YUVBL			BIT16				// YUV big endian(0) or little endian(1)
	#define LCDCCtl_SC_EN			BIT5				// Scaling Enable bit ("REG_LCM_SCO_SIZE" set the output size)
	#define LCDCCtl_FBSMODE			BIT4				// Enable bit for frame buffer base address switched in Vsync period mode
	#define LCDCCtl_FBDS 			NVTBIT(3,1)			// Frame buffer data selection
	#define LCDCCtl_LCDRUN 			BIT0				// LCD Controller Run.

#define REG_LCM_LCDCPrm   		(VPOST_BA+0x04)		// R/W: LCD Controller Parameter Register
	#define LCDCPrm_Even_Field_AL	NVTBIT(31,28)
	#define LCDCPrm_Odd_Field_AL	NVTBIT(27,24)
	#define LCDCPrm_F1_EL			NVTBIT(23,15)
	#define LCDCPrm_LCDSynTv		BIT8			// LCD timming Synch with TV
	#define LCDCPrm_SRGB_EL_SEL		NVTBIT(7,6)		// serial RGB Through Mode even line selection
	#define LCDCPrm_SRGB_OL_SEL		NVTBIT(5,4)		// serial RGB Through Mode odd line selection
	#define LCDCPrm_LCDDataSel		NVTBIT(3,2)		// LCD data interface Select
	#define LCDCPrm_LCDTYPE	  		NVTBIT(1,0)		// LCD device Type Select.

