k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_TVOUT_FLT			(VPOST_BA+0x44)		// R/W: TV output filter register
	#define YLPF_SEL	 			BIT6				// Luma low-pass filter selection
															//   1 = 9-tap, 0 = disable
	#define UVLPF_SEL	 			BIT4				// Chroma low-pass filter selection
															//   1 = 9-tap, 0 = disable
	#define YUP_SEL		 			NVTBIT(3,2)			// Luma upsample filter selection
															//   01 = 2-tap, 00 = disable
															//   10 = 3-tap, 11 = 7-tap
	#define UVUP_SEL		 		NVTBIT(1,0)			// Luma upsample filter selection
															//   01 = 2-tap, 00 = disable
															//   10 = 3-tap, 11 = 7-tap

#define REG_TVOUT_ADJ			(VPOST_BA+0x48)		// R/W: TV output active adjust register
	#define VER_ACTADJ	 			NVTBIT(28,24)		// TV vertical output active position adjust
	#define HOR_ACTADJ	 			NVTBIT(21,16)		// TV horizontal output active position adjust


#define REG_LCM_COLORSET  		(VPOST_BA+0x4C)		// R/W: Backdraw Color Setting Register
	#define VD_SWAP_EN	 			BIT24				// LCD data bus swapped enable/disable
	#define COLORSET_Color_R		NVTBIT(23,16)		// Color R value
	#define COLORSET_Color_G		NVTBIT(15,8)		// Color G value
	#define COLORSET_Color_B		NVTBIT(7,0)			// Color B value

#define REG_LCM_FSADDR    		(VPOST_BA+0x50)		// R/W: Frame Buffer Start Address

#define REG_LCM_TVDisCtl  		(VPOST_BA+0x54)		// R/W: TV Display Start Control Register
	#define TVDisCtl_FFRHS			NVTBIT(31,24)
	#define TVDisCtl_LCDHB			NVTBIT(23,16)		// LCD H bland setting for Syn TV Display
	#define TVDisCtl_TVDVS			NVTBIT(15,8)		// TV Display Start Line Register
	#define TVDisCtl_TVDHS			NVTBIT(7,0)			// TV Display Start Pixel Register

#define REG_LCM_CBACtl  		(VPOST_BA+0x58)		// R/W: Color Burst Amplitude Control Register
	#define CBACtl_CBA_CB4			NVTBIT(29,24)
	#define CBACtl_CBA_CB3			NVTBIT(21,16)
	#define CBACtl_CBA_CB2			NVTBIT(13,8)
	#define CBACtl_CBA_CB1			NVTBIT(5,0)

#define REG_LCM_OSD_ADDR  		(VPOST_BA+0x5C)		// R/W: OSD Frame Buffer Start Address
#define REG_TV_FFFSET1	 	  	(VPOST_BA+0x60)		// FV flick free filter setting register 1

#define REG_LCM_TVContrast		(VPOST_BA+0x64)		// R/W: Tv contrast adjust setting register
	#define TVContrast_Cr_contrast	NVTBIT(23,16)		// Cr compoment contrast adjust
	#define TVContrast_Cb_contrast	NVTBIT(15,8)		// Cb compoment contrast adjust
	#define TVContrast_Y_contrast	NVTBIT(7,0)			// Y  compoment contrast adjust

#define REG_LCM_TVBright  		(VPOST_BA+0x68)		// R/W: Tv Bright adjust setting register
	#define TVBright_Cr_gain		NVTBIT(23,16)		// Cr compoment bright adjust
	#define TVBright_Cb_gain		NVTBIT(15,8)		// Cb compoment bright adjust
	#define TVBright_Y_bright		NVTBIT(7,0)			// Y  compoment bright adjust

#define REG_TV_FFFSET2	 	  	(VPOST_BA+0x6C)		// FV flick free filter setting register 2

#define REG_LCM_LINE_STRIPE		(VPOST_BA+0x70)		// R/W : Line Stripe Offset
	#define OSD_LSD					NVTBIT(31,16)		// OSD buffer line stripe offset register
	#define LINE_STRIPE_F1_LSL		NVTBIT(15,0)		// frame buffer line stripe offset register

#define REG_LCM_RGBin		  	(VPOST_BA+0x74)		// RGB888 data input for RGB2YCbCr equation

#define REG_LCM_YCbCrout  		(VPOST_BA+0x78)		// YCbCr data output for RGB2YCbCr equation

#define REG_LCM_YCbCrin	  		(VPOST_BA+0x7C)		// YCbCr data input for YCbCr2RGB equation
	#define YCbCrin_Yin				NVTBIT(23,16)		// Y byte data input
	#define YCbCrin_Cbin			NVTBIT(15, 8)		// Cb byte data input
	#define YCbCrin_Crin			NVTBIT( 7, 0)		// Cr byte data input

#define REG_LCM_RGBout	  		(VPOST_BA+0x80)		// RGB data output for YCbCr2RGB equation
	#define RGBout_Rout				NVTBIT(23,16)		// R byte data output
	#define RGBout_Gout				NVTBIT(15, 8)		// G byte data output
	#define RGBout_Bout				NVTBIT( 7, 0)		// B byte data output

#define REG_LCM_LBTestCtl		(VPOST_BA+0x88)		// R: Line Buffer Test Control
	#define LBTestCtl_FinishR		NVTBIT(18,16)		//
	#define LBTestCtl_BistFailR		NVTBIT(10, 8)		//
	#define LBTestCtl_BistModeR		NVTBIT( 2, 0)		//

#define REG_LCM_OSD_MASK		(VPOST_BA+0x90)		// R/W: OSD transparent mask control, REG_LCM_OSD_MASK[23:0]

#define REG_LCM_OSD_ALPHA		(VPOST_BA+0x94)		// R/W: OSD constant alpha blending
	#define OSD_ALPHA_EN			BIT31				// OSD alpha enable bit
	#define OSD_ALPHA				NVTBIT(7, 0)		// OSD alpha value

#define REG_LCM_VA_TEST			(VPOST_BA+0x98)		// R/W: Frame Buffer Check Sum
	#define VA_CHECK_START			BIT31				// checksum start
	#define VA_CHECKSUM				NVTBIT(15, 0)		// VA checksum

#define REG_LCM_KPI_HS_DLY		(VPOST_BA+0x9C)		// R/W: LCD share Hsync Bus to KPI Time Setting
	#define KPI_REF_SYNC			BIT31				// Set to 1 will use larger timing range to share LCD bus
	#define KPI_HFD					NVTBIT(26,16)		// Hsync Front Delay time for KPI
	#define KPI_HBD					NVTBIT(10, 0)		// Hsync Back Delay time for KPI

#define REG_LCM_FB_SIZE			(VPOST_BA+0xA0)		// R/W: Frame buffer size
	#define FB_X					NVTBIT(31,16)		// X-axis size
	#define FB_Y					NVTBIT(15, 0)		// Y-axis size

#define REG_LCM_SCO_SIZE		(VPOST_BA+0xA4)		// R/W: Scaling size
	#define SCOL_X					NVTBIT(31,16)		// X-axis scaling
	#define SCOL_Y					NVTBIT(15, 0)		// Y-axis scaling

/*
 VideoIn Control Registers
*/
/*
 VideoIn Control Registers
*/
#define REG_VPECTL  		(VIN_BA + 0x00)	// R/W: Video Pre-processor Control Register
			#define VPRST		BIT24					// Video Pre-processor Reset.
			#define UPDATE 		BIT20					// Video-In Update Register at New Frame
			#define CAPONE		BIT16					// Video-In One Shutter
			#define VPRBIST		BIT8					// Video-In One Shutter
			#define PKEN		BIT6					// Packet Output Enable
			#define PNEN		BIT5					// Planar Output Enable
			#define ADDRSW		BIT3					// Packet Buffer Address select
			#define FBMODE		BIT2					// Packet Frame Buffer Control by FSC
			#define VPEEN		BIT0					// Planar Output Enable

#define REG_VPEPAR		(VIN_BA + 0x04)	// R/W: Video Pre-processor Parameter Register
			#define MB_PLANAR		BIT31					// YUV output in macro block planar mode.
			#define VPEBFIN		BIT28					// BIST Finish [Read Only]
			#define BFAIL			NVTBIT(27, 24)		// BIST Fail Flag [Read Only]
			#define FLDID			BIT20				// Field ID [Read Only]
			#define FLD1EN		BIT17					// Field 1 Input Enable
			#define FLD0EN		BIT16					// Field 0 Input Enable
			#define FLDDETP		BIT15					// Field Detect Position
			#define FLDDETM 		BIT14				// Field Detect Mode (By HSYNC or input FIELD PIN)
			#define FLDSWAP		BIT13					// Swap Input Field
			#define SCEF		NVTBIT(12, 11)			// Special Color Effect.
			#define VSP			BIT10					// Sensor Vsync Polarity.
			#define HSP			BIT9					// Sensor Hsync Polarity
			#define PCLKP			BIT8				// Sensor Pixel Clock Polarity
			#define PNFMT		BIT7					// Planar Output Format
			#define RANGE		BIT6					// Scale Input YUV CCIR601 color range to full range
			#define OUTFMT 		NVTBIT(5, 4)			// Image Data Format Output to System Memory.
			#define PDORD		NVTBIT(3, 2)			// Sensor Output Type
			#define SNRTYPE 		BIT1				// device is CCIR601 or CCIR656
			#define INFMT 		BIT0					// Sensor Output Format


#define REG_VPEINT  		(VIN_BA + 0x08)	// R/W: Video Pre-processor Interrupt  Register
			#define MDINTEN		BIT20					// Motion Detection Interrupt Enable
			#define ADDRMEN  	BIT19					// Address Match Interrupt Enable.
			#define MEINTEN		BIT17					// System Memory Error Interrupt Enable.
			#define VINTEN		BIT16					// Video Frame End Interrupt Enable.
			#define MDINT		BIT4					// Motion Detection Output Finsish Interrupt
			#define ADDRMINT		BIT3				// Memory Address Match Interrupt Flag.
			#define MEINT		BIT1					// System Memory Error Interrupt. If read this bit shows 1, Memory Error occurs. Write 0 to clear it.
			#define VINT			BIT0				// Video Frame End Interrupt. If read this bit shows 1, received a frame complete. Write 0 to clear it.

#define REG_VPOSTERIZE		(VIN_BA + 0x0C)	// R/W: Video Post-processor Control  Register
			#define YCOM		NVTBIT(23, 16)			// Y Component Posterizing factor
			#define UCOM		NVTBIT(15, 8)			// U Component Posterizing factor
			#define VCOM		NVTBIT(7, 0)			// V Component Posterizing factor


