k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_SDARG 				(FMI_BA+0x024)   	/* SD command argument register */

#define REG_SDIER				(FMI_BA+0x028)   	/* SD interrupt enable register */
	#define	SDIER_CD2SRC			BIT31				// SD card detection source selection: SD-DAT3 or GPIO
	#define	SDIER_CDSRC				BIT30				// SD card detection source selection: SD-DAT3 or GPIO
	#define	SDIER_R1B_IEN			BIT24				// R1b interrupt enable
	#define	SDIER_WKUP_EN			BIT14				// SDIO wake-up signal geenrating enable
	#define	SDIER_DITO_IEN			BIT13				// SD data input timeout interrupt enable
	#define	SDIER_RITO_IEN			BIT12				// SD response input timeout interrupt enable
	#define SDIER_SDIO_IEN			BIT10				// SDIO Interrupt Status Enable (SDIO issue interrupt via DAT[1]
	#define SDIER_CD_IEN			BIT8				// CD# Interrupt Status Enable
	#define SDIER_CRC_IEN			BIT1				// CRC-7, CRC-16 and CRC status error interrupt enable
	#define SDIER_BLKD_IEN			BIT0				// Block transfer done interrupt interrupt enable

#define REG_SDISR				(FMI_BA+0x02C)   	/* SD interrupt status register */
	#define	SDISR_R1B_IF			BIT24				// R1b interrupt flag
	#define SDISR_SD_DATA1			BIT18			    // SD DAT1 pin status
	#define SDISR_CD_Card			BIT16			    // CD detection pin status
	#define	SDISR_DITO_IF			BIT13			    // SD data input timeout interrupt flag
	#define	SDISR_RITO_IF			BIT12			    // SD response input timeout interrupt flag
	#define	SDISR_SDIO_IF			BIT10			    // SDIO interrupt flag (SDIO issue interrupt via DAT[1]
	#define	SDISR_CD_IF				BIT8			    // CD# interrupt flag
	#define SDISR_SD_DATA0			BIT7			    // SD DATA0 pin status
	#define SDISR_CRC				NVTBIT(6,4)		    // CRC status
	#define SDISR_CRC_16			BIT3			    // CRC-16 Check Result Status
	#define SDISR_CRC_7				BIT2			    // CRC-7 Check Result Status
	#define	SDISR_CRC_IF			BIT1			    // CRC-7, CRC-16 and CRC status error interrupt status
	#define	SDISR_BLKD_IF			BIT0			    // Block transfer done interrupt interrupt status

#define REG_SDRSP0				(FMI_BA+0x030)   	/* SD receive response token register 0 */
#define REG_SDRSP1				(FMI_BA+0x034)   	/* SD receive response token register 1 */
#define REG_SDBLEN				(FMI_BA+0x038)   	/* SD block length register */
#define REG_SDTMOUT 			(FMI_BA+0x03C)   	/* SD block length register */

/* NAND-type Flash Registers */
// old nuc930
#define     REG_SM_ECC48_ST0		(FMI_BA+0x0D4)   /* ECC Register */
#define     REG_SM_ECC48_ST1		(FMI_BA+0x0D8)   /* ECC Register */
#define     REG_BCH_ECC_BIT_ADDR0	(FMI_BA+0x220)   /* NAND Flash BCH error bit address for error bit 0-7 Register */
#define     REG_BCH_ECC_BIT_ADDR1	(FMI_BA+0x224)   /* NAND Flash BCH error bit address for error bit 8-14 Register */

// new FA93
#define REG_SMCSR				(FMI_BA+0x0A0)   	/* NAND Flash Control and Status Register */
	#define SMCR_CS1				BIT26				// SM chip select
	#define SMCR_CS0				BIT25				// SM chip select
	#define SMCR_CS					BIT25				// SM chip select
	#define SMCR_ECC_EN				BIT23				// SM chip select
	#define SMCR_BCH_TSEL 			NVTBIT(22,18)		// BCH T4/8/12/15/24 selection
		#define BCH_T15 				BIT22			    // BCH T15 selected
		#define BCH_T12 				BIT21			    // BCH T12 selected
		#define BCH_T8	 				BIT20			    // BCH T8 selected
		#define BCH_T4	 				BIT19			    // BCH T4 selected
		#define BCH_T24	 				BIT18			    // BCH T24 selected

	#define SMCR_PSIZE 				NVTBIT(17,16)		// SM page size selection
		#define PSIZE_8K 			    BIT17+BIT16			// page size 8K selected
		#define PSIZE_4K 			    BIT17				// page size 4K selected
		#define PSIZE_2K 			    BIT16				// page size 2K selected
		#define PSIZE_512			    0					// page size 512 selected

	#define SMCR_SRAM_INIT			BIT9				// SM RA0_RA1 initial bit (to 0xFFFF_FFFF)
	#define SMCR_ECC_3B_PROTECT		BIT8				// ECC protect redundant 3 bytes
	#define SMCR_ECC_CHK			BIT7				// ECC parity check enable bit during read page
	#define SMCR_PROT_REGION_EN 	BIT5				// Protect Region enable
	#define SMCR_REDUN_AUTO_WEN 	BIT4				// Redundant auto write enable
	#define SMCR_REDUN_REN 			BIT3				// Redundant read enable
	#define SMCR_DWR_EN 			BIT2				// DMA write data enable
	#define SMCR_DRD_EN 			BIT1				// DMA read data enable
	#define SMCR_SM_SWRST 			BIT0				// SM software reset


#define REG_SMTCR				(FMI_BA+0x0A4)   	/* NAND Flash Timing Control Register */

#define REG_SMIER				(FMI_BA+0x0A8)   	/* NAND Flash Interrupt Control Register */
	#define	SMIER_RB1_IE			BIT11				// RB1 pin rising-edge detection interrupt enable
	#define	SMIER_RB0_IE			BIT10				// RB0 pin rising-edge detection interrupt enable
	#define	SMIER_RB_IE				BIT10				// RB0 pin rising-edge detection interrupt enable
	#define SMIER_PROT_REGION_WR_IE BIT3				// Protect Region write detect interrupt enable
	#define SMIER_ECC_FIELD_IE 		BIT2				// ECC field error check interrupt enable
	#define SMIER_DMA_IE			BIT0				// DMA RW data complete interrupr enable

#define REG_SMISR				(FMI_BA+0x0AC)   	/* NAND Flash Interrupt Status Register */
	#define	SMISR_RB1		 		BIT19				// RB1 pin status
	#define	SMISR_RB0 				BIT18				// RB0 pin status
	#define	SMISR_RB 				BIT18				// RB pin status
	#define	SMISR_RB1_IF		 	BIT11				// RB pin rising-edge detection interrupt flag
	#define	SMISR_RB0_IF	 		BIT10				// RB pin rising-edge detection interrupt flag
	#define SMISR_PROT_REGION_WR_IF BIT3				// Protect Region write detect interrupt flag
	#define SMISR_ECC_FIELD_IF 		BIT2				// ECC field error check interrupt flag
	#define SMISR_DMA_IF			BIT0				// DMA RW data complete interrupr flag


#define REG_SMCMD				(FMI_BA+0x0B0)   	/* NAND Flash Command Port Register */

#define REG_SMADDR				(FMI_BA+0x0B4)   	/* NAND Flash Address Port Register */
	#define	EOA_SM	 				BIT31				// end of SM address for last SM address

#define REG_SMDATA				(FMI_BA+0x0B8)   	/* NAND Flash Data Port Register */

#define REG_SMREAREA_CTL 		(FMI_BA+0x0BC)  	/* NAND Flash redundnat area control register */
	#define SMRE_MECC 				NVTBIT(31,16)		// Mask ECC parity code to NAND during Write Page Data to NAND by DMAC
	#define	SMRE_REA128_EXT			NVTBIT(8,0)			// Redundant area enabled byte number

