k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_SM_ECC_ST0			(FMI_BA+0x0D0)   	/* ECC Register */
	#define ECCST_F4_ECNT			NVTBIT(30,26)		// error count of ECC for field 4
	#define ECCST_F4_STAT 			NVTBIT(25,24)		// error status of ECC for field 4
	#define ECCST_F3_ECNT 	        NVTBIT(22,18)		// error count of ECC for field 3
	#define ECCST_F3_STAT 	        NVTBIT(17,16)		// error status of ECC for field 3
	#define ECCST_F2_ECNT 	        NVTBIT(14,10)		// error count of ECC for field 2
	#define ECCST_F2_STAT 	        NVTBIT(9,8)			// error status of ECC for field 2
	#define ECCST_F1_ECNT 	        NVTBIT(6,2)			// error count of ECC for field 1
	#define ECCST_F1_STAT 	        NVTBIT(1,0)			// error status of ECC for field 1

#define REG_SM_ECC_ST1		    (FMI_BA+0x0D4)   	/* ECC Register */
	#define ECCST_F8_ECNT			NVTBIT(30,26)		// error count of ECC for field 8
	#define ECCST_F8_STAT 			NVTBIT(25,24)		// error status of ECC for field 8
	#define ECCST_F7_ECNT 	        NVTBIT(22,18)		// error count of ECC for field 7
	#define ECCST_F7_STAT 	        NVTBIT(17,16)		// error status of ECC for field 7
	#define ECCST_F6_ECNT 	        NVTBIT(14,10)		// error count of ECC for field 6
	#define ECCST_F6_STAT 	        NVTBIT(9,8)			// error status of ECC for field 6
	#define ECCST_F5_ECNT 	        NVTBIT(6,2)			// error count of ECC for field 5
	#define ECCST_F5_STAT 	        NVTBIT(1,0)			// error status of ECC for field 5

#define REG_SM_ECC_ST2		    (FMI_BA+0x0D8)   	/* ECC Register */
	#define ECCST_F12_ECNT			NVTBIT(30,26)		// error count of ECC for field 12
	#define ECCST_F12_STAT 			NVTBIT(25,24)		// error status of ECC for field 12
	#define ECCST_F11_ECNT 	        NVTBIT(22,18)		// error count of ECC for field 11
	#define ECCST_F11_STAT 	        NVTBIT(17,16)		// error status of ECC for field 11
	#define ECCST_F10_ECNT 	        NVTBIT(14,10)		// error count of ECC for field 10
	#define ECCST_F10_STAT 	        NVTBIT(9,8)			// error status of ECC for field 10
	#define ECCST_F9_ECNT 	        NVTBIT(6,2)			// error count of ECC for field 9
	#define ECCST_F9_STAT 	        NVTBIT(1,0)			// error status of ECC for field 9

#define REG_SM_ECC_ST3		    (FMI_BA+0x0DC)   	/* ECC Register */
	#define ECCST_F16_ECNT			NVTBIT(30,26)		// error count of ECC for field 16
	#define ECCST_F16_STAT 			NVTBIT(25,24)		// error status of ECC for field 16
	#define ECCST_F15_ECNT 	        NVTBIT(22,18)		// error count of ECC for field 15
	#define ECCST_F15_STAT 	        NVTBIT(17,16)		// error status of ECC for field 15
	#define ECCST_F14_ECNT 	        NVTBIT(14,10)		// error count of ECC for field 14
	#define ECCST_F14_STAT 	        NVTBIT(9,8)			// error status of ECC for field 14
	#define ECCST_F13_ECNT 	        NVTBIT(6,2)			// error count of ECC for field 13
	#define ECCST_F13_STAT 	        NVTBIT(1,0)			// error status of ECC for field 13


#define REG_SM_PROT_ADDR0	    (FMI_BA+0x0E0)   	/* Smart-Media Protect Region End Address 0 Register */
#define REG_SM_PROT_ADDR1	    (FMI_BA+0x0E4)   	/* Smart-Media Protect Region End Address 1 Register */
	#define SM_PROT_ADDR1 	        NVTBIT(7,0)			// High address for Protect Region End Address

#define REG_BCH_ECC_ADDR0	    (FMI_BA+0x100)   	/* NAND Flash BCH error byte address for error bit 0-1 Register */
#define REG_BCH_ECC_ADDR1	    (FMI_BA+0x104)   	/* NAND Flash BCH error byte address for error bit 2-3 Register */
#define REG_BCH_ECC_ADDR2	    (FMI_BA+0x108)   	/* NAND Flash BCH error byte address for error bit 4-5 Register */
#define REG_BCH_ECC_ADDR3	    (FMI_BA+0x10C)   	/* NAND Flash BCH error byte address for error bit 6-7 Register */
#define REG_BCH_ECC_ADDR4	    (FMI_BA+0x110)   	/* NAND Flash BCH error byte address for error bit 8-9 Register */
#define REG_BCH_ECC_ADDR5	    (FMI_BA+0x114)   	/* NAND Flash BCH error byte address for error bit 10-11 Register */
#define REG_BCH_ECC_ADDR6	    (FMI_BA+0x118)   	/* NAND Flash BCH error byte address for error bit 12-13 Register */
#define REG_BCH_ECC_ADDR7	    (FMI_BA+0x11C)   	/* NAND Flash BCH error byte address for error bit 14-15 Register */
#define REG_BCH_ECC_ADDR8	    (FMI_BA+0x120)   	/* NAND Flash BCH error byte address for error bit 16-17 Register */
#define REG_BCH_ECC_ADDR9	    (FMI_BA+0x124)   	/* NAND Flash BCH error byte address for error bit 18-19 Register */
#define REG_BCH_ECC_ADDR10	    (FMI_BA+0x128)   	/* NAND Flash BCH error byte address for error bit 20-21 Register */
#define REG_BCH_ECC_ADDR11	    (FMI_BA+0x12C)   	/* NAND Flash BCH error byte address for error bit 22-23 Register */

#define REG_BCH_ECC_DATA0	    (FMI_BA+0x160)   	/* NAND Flash BCH error data for error bit 0-3 Register */
#define REG_BCH_ECC_DATA1	    (FMI_BA+0x164)   	/* NAND Flash BCH error data for error bit 4-7 Register */
#define REG_BCH_ECC_DATA2	    (FMI_BA+0x168)   	/* NAND Flash BCH error data for error bit 8-11 Register */
#define REG_BCH_ECC_DATA3	    (FMI_BA+0x16C)   	/* NAND Flash BCH error data for error bit 12-15 Register */
#define REG_BCH_ECC_DATA4	    (FMI_BA+0x170)   	/* NAND Flash BCH error data for error bit 16-19 Register */
#define REG_BCH_ECC_DATA5	    (FMI_BA+0x174)   	/* NAND Flash BCH error data for error bit 20-23 Register */

#define REG_SMRA_0				(FMI_BA+0x200)   /* NAND Flash Redundant Area Register */
#define REG_SMRA_1		        (FMI_BA+0x204)
#define REG_SMRA_2		        (FMI_BA+0x208)
#define REG_SMRA_3		        (FMI_BA+0x20C)
#define REG_SMRA_4		        (FMI_BA+0x210)
#define REG_SMRA_5		        (FMI_BA+0x214)
#define REG_SMRA_6		        (FMI_BA+0x218)
#define REG_SMRA_7		        (FMI_BA+0x21C)
#define REG_SMRA_8		        (FMI_BA+0x220)
#define REG_SMRA_9		        (FMI_BA+0x224)
#define REG_SMRA_10		        (FMI_BA+0x228)
#define REG_SMRA_11		        (FMI_BA+0x22C)
#define REG_SMRA_12		        (FMI_BA+0x230)
#define REG_SMRA_13		        (FMI_BA+0x234)
#define REG_SMRA_14		        (FMI_BA+0x238)
#define REG_SMRA_15		        (FMI_BA+0x23C)
#define REG_SMRA_16		        (FMI_BA+0x240)
#define REG_SMRA_17		        (FMI_BA+0x244)
#define REG_SMRA_18		        (FMI_BA+0x248)
#define REG_SMRA_19		        (FMI_BA+0x24C)
#define REG_SMRA_20		        (FMI_BA+0x250)
#define REG_SMRA_21		        (FMI_BA+0x254)
#define REG_SMRA_22		        (FMI_BA+0x258)
#define REG_SMRA_23		        (FMI_BA+0x25C)
#define REG_SMRA_24		        (FMI_BA+0x260)
#define REG_SMRA_25		        (FMI_BA+0x264)
#define REG_SMRA_26		        (FMI_BA+0x268)
#define REG_SMRA_27		        (FMI_BA+0x26C)
#define REG_SMRA_28		        (FMI_BA+0x270)
#define REG_SMRA_29		        (FMI_BA+0x274)
#define REG_SMRA_30		        (FMI_BA+0x278)
#define REG_SMRA_31		        (FMI_BA+0x27C)
#define REG_SMRA_32		        (FMI_BA+0x280)
#define REG_SMRA_33		        (FMI_BA+0x284)
#define REG_SMRA_34		        (FMI_BA+0x288)
#define REG_SMRA_35		        (FMI_BA+0x28C)
#define REG_SMRA_36		        (FMI_BA+0x290)
#define REG_SMRA_37		        (FMI_BA+0x294)
#define REG_SMRA_38		        (FMI_BA+0x298)
#define REG_SMRA_39		        (FMI_BA+0x29C)
#define REG_SMRA_40		        (FMI_BA+0x2A0)
#define REG_SMRA_41		        (FMI_BA+0x2A4)
#define REG_SMRA_42		        (FMI_BA+0x2A8)
#define REG_SMRA_43		        (FMI_BA+0x2AC)
#define REG_SMRA_44		        (FMI_BA+0x2B0)
#define REG_SMRA_45		        (FMI_BA+0x2B4)
#define REG_SMRA_46		        (FMI_BA+0x2B8)
#define REG_SMRA_47		        (FMI_BA+0x2BC)
#define REG_SMRA_48		        (FMI_BA+0x2C0)
#define REG_SMRA_49		        (FMI_BA+0x2C4)
#define REG_SMRA_50		        (FMI_BA+0x2C8)
#define REG_SMRA_51		        (FMI_BA+0x2CC)
#define REG_SMRA_52		        (FMI_BA+0x2D0)
#define REG_SMRA_53		        (FMI_BA+0x2D4)
#define REG_SMRA_54		        (FMI_BA+0x2D8)   /* NAND Flash Redundant Area Register */

