k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
/*
 SDIO Control Registers
*/

#define     REG_SDIOFB_0		(SDIODMAC_BA+0x000)  /* Shared Buffer (FIFO) */

#define	REG_SDIODMACCSR			(SDIODMAC_BA+0x400)  /* DMAC Control and Status Register */
	#define	FMI_BUSY			BIT9			// FMI DMA transfer is in progress
	#define SG_EN				BIT3			// DMAC Scatter-gather function enable
	#define DMAC_SWRST			BIT1			// DMAC software reset enable
	#define DMAC_EN				BIT0			// DMAC enable

#define     REG_SDIODMACSAR	    (SDIODMAC_BA+0x408)  /* DMAC Transfer Starting Address Register */
    #define PAD_ORDER           BIT0            // Physical Address Descriptor table fetching in order or out of order
#define     REG_SDIODMACBCR		(SDIODMAC_BA+0x40C)  /* DMAC Transfer Byte Count Register */
#define     REG_SDIODMACIER		(SDIODMAC_BA+0x410)  /* DMAC Interrupt Enable Register */
	#define	WEOT_IE				BIT1			// Wrong EOT encounterred interrupt enable
	#define TABORT_IE			BIT0			// DMA R/W target abort interrupt enable

#define     REG_SDIODMACISR		(SDIODMAC_BA+0x414)  /* DMAC Interrupt Status Register */
	#define	WEOT_IF				BIT1			// Wrong EOT encounterred interrupt flag
	#define TABORT_IF			BIT0			// DMA R/W target abort interrupt flag


/* Flash Memory Card Interface Registers */
#define REG_SDIOFMICR				(SDIOFMI_BA+0x000)   	/* FMI Control Register */
#define REG_SDIOFMIIER				(SDIOFMI_BA+0x004)   	/* FMI DMA Transfer Starting Address Register */
#define REG_SDIOFMIISR				(SDIOFMI_BA+0x008)   	/* FMI DMA Byte Count Register */
/* Secure Digit Registers */
#define REG_SDIOCR				(SDIOFMI_BA+0x020)   	/* SD Control Register */
#define REG_SDIOARG 			(SDIOFMI_BA+0x024)   	/* SD command argument register */
#define REG_SDIOIER				(SDIOFMI_BA+0x028)   	/* SD interrupt enable register */
	#define	SDIER_CD1SRC            BIT31               // SDIO1 card detection source selection: SD-DAT3 or GPIO
	#define SDIER_SDIO1_IEN         BIT11               // SDIO1 Interrupt Status Enable (SDIO issue interrupt via DAT[1]
	#define SDIER_CD1_IEN           BIT9                // SDIO1 card detect interrupt Enable
#define REG_SDIOISR				(SDIOFMI_BA+0x02C)   	/* SD interrupt status register */
	#define SDISR_CD1_Card          BIT17               // SDIO1 card detection pin status
	#define	SDISR_SDIO1_IF          BIT11               // SDIO1 interrupt flag (SDIO issue interrupt via DAT[1]
	#define	SDISR_CD1_IF            BIT9                // SDIO1 card detect interrupt flag
#define REG_SDIORSP0				(SDIOFMI_BA+0x030)   	/* SD receive response token register 0 */
#define REG_SDIORSP1				(SDIOFMI_BA+0x034)   	/* SD receive response token register 1 */
#define REG_SDIOBLEN				(SDIOFMI_BA+0x038)   	/* SD block length register */
#define REG_SDIOTMOUT 			(SDIOFMI_BA+0x03C)   	/* SD block length register */

/* SPU Control Registers */
#define REG_SPU_CTRL			(SPU_BA+0x00)		// SPU control and status register
	#define SPU_SWRST				BIT16				// SPU SW reset
	#define RampUpMod	 			NVTBIT(14,12)		// Ramp up mode select
	#define SPU_I2S_EN					BIT8				// I2S output enable/disable
	#define SPU_END_CTRL			BIT2				// SPU END function control
	#define SPU_END_FLAG			BIT1				// SPU END function flag
	#define SPU_EN					BIT0				// SPU enable/disable

#define REG_SPU_DAC_PAR			(SPU_BA+0x04)		// DAC parameter register
	#define PLLSELMOD				BIT31				// Select the SPU PLL Clock comes from
	#define DAC_RST					BIT30				// DAC Reset Signal
	#define DAC_ZERO_MOD			BIT27				// DAC zer cross mode select, 1: digital gain, 0: analog gain
	#define DAC_ZERO_EN				BIT26				// DAC zero cross detection enable
	#define ZERO_EN					BIT25				// Zero cross detection enable
	#define EQU_EN					BIT24				// Equalizer enable

#define REG_SPU_DAC_AG			(SPU_BA+0x08)		// DAC auto gain control
	#define SAMPLE_STEP	 			NVTBIT(31,24)
	#define GAIN_STEP				NVTBIT(23,16)
	#define SAVE_GAIN				NVTBIT(15,8)

#define REG_SPU_EQGain0			(SPU_BA+0x0C)		// Equalizer bands 08 - 01 gain control
	#define Gain08					NVTBIT(31,28)		// Gain08 control
	#define Gain07					NVTBIT(27,24)		// Gain07 control
	#define Gain06					NVTBIT(23,20)		// Gain06 control
	#define Gain05					NVTBIT(19,16)		// Gain05 control
	#define Gain04					NVTBIT(15,12)		// Gain04 control
	#define Gain03					NVTBIT(11,8)		// Gain03 control
	#define Gain02					NVTBIT(07,4)		// Gain02 control
	#define Gain01					NVTBIT(03,0)		// Gain01 control

#define REG_SPU_EQGain1			(SPU_BA+0x10)		// Equalizer bands 10 - 09 and DC gain control
	#define Gaindc					NVTBIT(19,16)		// DC control
	#define Gain10					NVTBIT(07,4)		// Gain10 control
	#define Gain09					NVTBIT(03,0)		// Gain09 control

#define REG_SPU_CH_EN			(SPU_BA+0x14)		// Channel enable register

#define REG_SPU_CH_IRQ			(SPU_BA+0x018)		// Channel iterrupt request flag register

#define REG_SPU_CH_PAUSE		(SPU_BA+0x1C)		// Channel PAUSE register

#define REG_SPU_CH_CTRL			(SPU_BA+0x20)		// Channel control register
	#define CH_NO					NVTBIT(28,24)		// Select chanel index number

	#define VIR_I2C_IRQ_EN			BIT17				// Virtual I2C interrupt enable
	#define VIR_I2C_IRQ_FG			BIT16				// Virtual I2C interrupt flag
	#define FN_IRQ_FG				BIT12				// Channel function done interrupt flag
	#define FN_IRQ_EN				BIT8				// Channel function done interrupt enable/disable
	#define UP_IRQ					BIT7				// Interrupt for DFA update in partial update function
	#define UP_DFA					BIT6				// DFA update in partial update function
	#define UP_PAN					BIT5				// PAN update in partial update function
	#define UP_VOL					BIT4				// Volume update in partial update function
	#define UP_PAUSE_ADDR			BIT3				// Pause Address update in partial update function	(only for mono/stereo PCM16 use)
	#define CH_FN					NVTBIT(1,0)			// Channel function register

#define REG_SPU_S_ADDR			(SPU_BA+0x24)		// Source start (base) address register

#define REG_SPU_M_ADDR			(SPU_BA+0x28)		// Threshold address register

#define REG_SPU_E_ADDR			(SPU_BA+0x2C)		// End start address register

#define REG_SPU_TONE_PULSE		(SPU_BA+0x28)		// Tone Pulse control register
	#define TONE_P1					NVTBIT(31,16)		// Tone Pulse 1
	#define TONE_P0					NVTBIT(15,0)		// Tone Pulse 0

#define REG_SPU_TONE_AMP		(SPU_BA+0x2C)		// Tone Amplitude control register
	#define TONE_AMP1				NVTBIT(31,16) 		// Tone Amplitude 1
	#define TONE_AMP0				NVTBIT(15,0)		// Tone Amplitude 0

#define REG_SPU_CH_PAR_1		(SPU_BA+0x30)		// Channel parameter 1 register
	#define CH_VOL					NVTBIT(30,24) 		// Channel volume register
	#define PAN_L					NVTBIT(20,16)		// Output right channel PAN
	#define PAN_R					NVTBIT(12,8)		// Output left channel PAN
	#define SRC_TYPE				NVTBIT(2,0)			// Channel sound type

#define REG_SPU_CH_PAR_2		(SPU_BA+0x34)		// Channel parameter 2 register
	#define DFA						NVTBIT(12,0)		// DFA

#define REG_SPU_CH_EVENT		(SPU_BA+0x38)		// DMA down counter register
	#define SUB_IDX					NVTBIT(29,24)		// Sub-index of user event
	#define EVENT_IDX				NVTBIT(23,16)		// Index of user event
	#define EV_USR_FG				BIT13				// User event interrupt flag
	#define EV_SLN_FG				BIT12				// Slient event interrupt flag
	#define EV_LP_FG				BIT11				// Loop Start event interrupt flag
	#define EV_PAUSE_FG				BIT11				// Pause Address interrupt flag
	#define EV_END_FG				BIT10				// End event interrupt flag
	#define END_FG					BIT9				// End address interrupt flag
	#define TH_FG					BIT8				// Threshold address interrupt flag

	#define AT_CLR_EN				BIT7				// Enable Bit for auto interrupt flag clear after read event register
	#define EV_USR_EN				BIT5				// Enable Bit for User event interrupt flag
	#define EV_SLN_EN				BIT4				// Enable Bit for Slient event interrupt flag
	#define EV_LP_EN				BIT3				// Enable Bit for Loop Start event interrupt flag
	#define EV_PAUSE_EN				BIT3				// Enable Bit for Pause Address event interrupt flag
	#define EV_END_EN				BIT2				// Enable Bit for End event interrupt flag
	#define END_EN					BIT1				// Enable Bit for End address
	#define TH_EN					BIT0				// Enable Bit for Threshold address

#define REG_SPU_CUR_ADDR		(SPU_BA+0x40)			// DMA down counter register

#define REG_SPU_LP_ADDR			(SPU_BA+0x44)			// DMA down counter register
#define REG_SPU_PA_ADDR			(SPU_BA+0x44)			// Pause Address for mono/stereo PCM16

#define REG_SPU_DAC_CTRL		(SPU_BA+0x50)			// Pause Address for mono/stereo PCM16
	#define V_I2C_BUSY				BIT31				// virtual I2C busy flag
	#define V_I2C_SCK_DIV				NVTBIT(30,24)		// virtual I2C clock divider, clock speed = SPU_CLK frequency/(SCK_DIV * 4)
	#define V_I2C_ID				NVTBIT(23,17)		// virtual I2C ID, default ID = 0x40
	#define V_I2C_RW				BIT16				// virtual I2C R/W signal
	#define V_I2C_ADDR				NVTBIT(15,8)		// virtual I2C address
	#define V_I2C_DATA				NVTBIT(7,0)			// virtual I2C data

/* I2S Control Registers */

#define REG_I2S_ACTL_CON		(I2S_BA+0x00)		// Audio Control Register
	#define	P_PAUSE_IRQ_EN			BIT22				// Pause Function Interrupt Request enable Bit
	#define	R_DMA_IRQ_EN			BIT21				// Recording DMA Interrupt Request enable Bit
	#define P_DMA_IRQ_EN			BIT20				// Playback DMA Interrupt Request enable Bit
	#define R_FIFO_FULL_IRQ_EN		BIT19				// Recording FIFO full Interrupt Request enable Bit
	#define R_FIFO_EMPTY_IRQ_EN		BIT18				// Recording FIFO empty Interrupt Request enable Bit
	#define P_FIFO_FULL_IRQ_EN		BIT17				// Playback FIFO full Interrupt Request enable Bit
	#define P_FIFO_EMPTY_IRQ_EN		BIT16				// Playback FIFO empty Interrupt Request enable Bit
	#define R_DMA_IRQ_SEL			NVTBIT(15,14)		// Recording DMA Interrupt Request selection Bits
	#define P_DMA_IRQ_SEL			NVTBIT(13,12)		// Playback DMA Interrupt Request selection Bits

