k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
	#define R_DMA_IRQ				BIT11				// Playback DMA Interrupt Request Bit
	#define P_DMA_IRQ				BIT10				// Recording DMA Interrupt Request Bit
	#define I2S_BITS_16_24			BIT9				// 16/24 bits selection
	#define FIFO_TH					BIT7				// FIFO Threshold Control Bit
	#define IRQ_DMA_CNTER_EN		BIT4				// IRQ_DMA counter function enable Bit
	#define IRQ_DMA_DATA_ZERO_EN	BIT3				// IRQ_DMA_DATA zero and sign detect enable Bit
	#define I2S_EN					BIT1				// I2S interface enable Bit

#define	REG_I2S_ACTL_RESET		(I2S_BA+0x04)		// Sub block reset control
	#define ACTL_RESET_				BIT16				// Audio Controller Reset Control Bit
	#define RECORD_SINGLE			NVTBIT(15,14)		// Record Single/Dual Channel Select Bits
	#define PLAY_STEREO				BIT12				// Playback Single/Dual Channel Select Bits
	#define I2S_RECORD				BIT6				// I2S Record Control Bit
	#define I2S_PLAY				BIT5				// I2S Playback Control Bit
	#define DMA_CNTER_EN			BIT4				// DMA counter function enable Bit
	#define DMA_DATA_ZERO_EN		BIT3				// DMA_DATA zero and sign detect enable Bit
	#define AC_RESET				BIT1				// AC link Sub Block RESET Control Bit
	#define I2S_RESET				BIT0				// I2S Sub Block RESET Control Bit

#define	REG_I2S_ACTL_RDSTB		(I2S_BA+0x08)		// DMA record destination base address
#define REG_I2S_ACTL_RDST_LENGTH (I2S_BA+0x0C)		// DMA record destination address length
#define REG_I2S_ACTL_RDSTC		(I2S_BA+0x10)		// DMA record destination current address
#define REG_I2S_ACTL_PDSTB		(I2S_BA+0x14)		// DMA play destination base address
#define REG_I2S_ACTL_PDST_LENGTH (I2S_BA+0x18)		// DMA play destination address length
#define REG_I2S_ACTL_PDSTC		(I2S_BA+0x1C)		// DMA play destination current address

#define REG_I2S_ACTL_RSR 		(I2S_BA+0x20)		// Audio controller FIFO and DMA status register for playback
	#define R_DMA_RIA_SN			NVTBIT(7,5)			// Recording DMA inidicative address selection number Bits
	#define R_FIFO_FULL				BIT2				// Playback FIFO Full Indicatior Bit
	#define R_FIFO_EMPTY			BIT1				// Playback FIFO Empty Indicatior Bit
	#define R_DMA_RIA_IRQ			BIT0				// Recording DMA inidicative address interrupt Request Bit

#define REG_I2S_ACTL_PSR		(I2S_BA+0x24)		// Audio controller FIFO and DMA status register for playback
	#define P_PAUSE_IRQ				BIT8				// Pause Function Interrupt Request Bit
	#define P_DMA_RIA_SN			NVTBIT(7,5)			// Playback DMA inidicative address selection number Bits
	#define DMA_CNTER_IRQ			BIT4				// DMA counter IRQ
	#define DMA_DATA_ZERO_IRQ		BIT3				// DMA_DATA zero IRQ
	#define P_FIFO_FULL				BIT2				// Playback FIFO Full Indicatior Bit
	#define P_FIFO_EMPTY			BIT1				// Playback FIFO Empty Indicatior Bit
	#define P_DMA_RIA_IRQ			BIT0				// Playback DMA inidicative address interrupt Request Bit

#define REG_I2S_ACTL_I2SCON		(I2S_BA+0x28)		// I2S controll register
	#define PRS						NVTBIT(19,16)		// I2S Frequency Pre-scaler Selection Bits
//	define	MCLK_SEL1				BIT9				// MCLK clock selection when MCLK_CON is active
//	#define MCLK_CON				BIT8				// MCLK clock selection
	#define BCLK_SEL				NVTBIT(7,6)			// I2S Serial Data Clock Frequency Selection Bit
	#define FS_SEL					BIT5				// I2S Sampling Frequency Selection Bit
	#define MCLK_SEL				BIT4				// I2S MCLK Output Selection Bit
	#define I2S_FORMAT				BIT3				// I2S Format Selection Bit

#define REG_I2S_ACTL_COUNTER	(I2S_BA+0x2C)		// DMA down counter register



/*
	USB 2.0 EHCI Host Control
*/

#define REG_EHCVNR	(UEHCI20_BA+0x000)	//EHCI Version Number Register
#define REG_EHCSPR	(UEHCI20_BA+0x004)	//EHCI Structural Parameters Register
#define REG_EHCCPR	(UEHCI20_BA+0x008)	//EHCI Capability Parameters Register

#define REG_UCMDR	(UEHCI20_BA+0x020)	//USB Command Register
#define REG_USTSR	(UEHCI20_BA+0x024)	//USB Status Register
#define REG_UIENR	(UEHCI20_BA+0x028)	//USB Interrupt Enable Register
#define REG_UFINDR	(UEHCI20_BA+0x02C)	//USB Frame Index Register
#define REG_UPFLBAR	(UEHCI20_BA+0x034)	//USB Periodic Frame List Base Address Register
#define REG_UCALAR	(UEHCI20_BA+0x038)	//USB Current Asynchronous List Address Register
#define REG_UASSTR	(UEHCI20_BA+0x03C)	//USB Asynchronous Schedule Sleep Timer Register

#define REG_UCFGR	(UEHCI20_BA+0x060)	//USB Configure Flag Register
#define REG_UPSCR0	(UEHCI20_BA+0x064)	//USB Port 0 Status and Control Register
#define REG_UPSCR1	(UEHCI20_BA+0x068)	//USB Port 0 Status and Control Register			/* NOT USE */
#define REG_UHCBIST	(UEHCI20_BA+0x0C0)	//USB Host Controller BIST Register
#define REG_USBPCR0	(UEHCI20_BA+0x0C4)	//USB PHY 0 Control Register
#define REG_USBPCR1	(UEHCI20_BA+0x0C8)	//USB PHY 0 Control Register						/* NOT USE */
#define REG_USBDBG	(UEHCI20_BA+0x0CC)	//USB Debug Register





#define REG_HcRev		(UOHCI20_BA+0x800)	//Host Controller Revision Register
#define REG_HcControl	(UOHCI20_BA+0x804)	//Host Controller Control Register
#define REG_HcComSts	(UOHCI20_BA+0x808)	//Host Controller Command Status Register
#define REG_HcIntSts	(UOHCI20_BA+0x80C)	//Host Controller Interrupt Status Register
#define REG_HcIntEn		(UOHCI20_BA+0x810)	//Host Controller Interrupt Enable Register
#define REG_HcIntDis	(UOHCI20_BA+0x814)	//Host Controller Interrupt Disable Register
#define REG_HcHCCA		(UOHCI20_BA+0x818)	//Host Controller Communication Area Register
#define REG_HcPerCED	(UOHCI20_BA+0x81C)	//Host Controller Period Current ED Register
#define REG_HcCtrHED	(UOHCI20_BA+0x820)	//Host Controller Control Head ED Register
#define REG_HcCtrCED	(UOHCI20_BA+0x824)	//Host Controller Control Current ED Register
#define REG_HcBlkHED	(UOHCI20_BA+0x828)	//Host Controller Bulk Head ED Register
#define REG_HcBlkCED	(UOHCI20_BA+0x82C)	//Host Controller Bulk Current ED Register
#define REG_HcDoneH		(UOHCI20_BA+0x830)	//Host Controller Done Head Register
#define REG_HcFmIntv	(UOHCI20_BA+0x834)	//Host Controller Frame Interval Register
#define REG_HcFmRem		(UOHCI20_BA+0x838)	//Host Controller Frame Remaining Register
#define REG_HcFNum		(UOHCI20_BA+0x83C)	//Host Controller Frame Number Register
#define REG_HcPerSt		(UOHCI20_BA+0x840)	//Host Controller Periodic Start Register
#define REG_HcLSTH		(UOHCI20_BA+0x844)	//Host Controller Low Speed Threshold Register
#define REG_HcRhDeA		(UOHCI20_BA+0x848)	//Host Controller Root Hub Descriptor A Register
#define REG_HcRhSts		(UOHCI20_BA+0x850)	//Host Controller Root Hub Status Register
#define REG_HcRhPrt1	(UOHCI20_BA+0x854)	//Host Controller Root Hub Port Status [1]
#define REG_HcRhPrt2	(UOHCI20_BA+0x858)	//Host Controller Root Hub Port Status [1]			/* NOT USE */
#define REG_OpModEn		(UOHCI20_BA+0xA04)	//USB Operational Mode Enable Register





