k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define JVSTRIDE (JPG_BA+0x9C)			// R/W: JPEG V Component Frame Buffer Stride Register
	#define V_STRIDE	NVTBIT(11,0)			// JPEG V Component Frame Buffer Stride

#define JIOADDR0 (JPG_BA+0xA0)			// R/W: JPEG Bit-stream Frame Buffer-0 Starting Address Register
	#define IO_IADDR0	NVTBIT(31,0)			// JPEG Bit-stream Frame Buffer-0 Starting Address

#define JIOADDR1 (JPG_BA+0xA4)			// R/W: JPEG Bit-stream Frame Buffer-1 Starting Address Register
	#define IO_IADDR1	NVTBIT(31,0)			// JPEG Bit-stream Frame Buffer-1 Starting Address

#define JPRI_SIZE (JPG_BA+0xA8)		// R  : JPEG Encode Primary Image Bit-stream Size Register
	#define PRI_SIZE	NVTBIT(23,0)			// JPEG Primary Image Encode Bit-stream Size

#define JTHB_SIZE (JPG_BA+0xAC)		// R  : JPEG Encode Thumbnail Image Bit-stream Size Register
	#define THB_SIZE	NVTBIT(15,0)			// JPEG Thumbnail Image Encode Bit-stream Size

#define JUPRAT (JPG_BA+0xB0)			// R/W: JPEG Encode Up-Scale Ratio Register
	#define S_HEIGHT	NVTBIT(29,16)			// JPEG Image Height Up-Scale Ratio
	#define S_WIDTH		NVTBIT(13,0)			// JPEG Image Width Up-Scale Ratio

#define JBSFIFO (JPG_BA+0xB4)			// R/W: JPEG Bit-stream FIFO Control Register
	#define BSFIFO_HT	NVTBIT(6,4)			// Bit-stream FIFO High-Threshold Control
	#define BSFIFO_LT	NVTBIT(2,0)			// Bit-stream FIFO Low-Threshold Control

#define JSRCH (JPG_BA+0xB8)			// R/W: JPEG Bit-stream FIFO Control Register
	#define JSRCH_JSRCH	NVTBIT(11,0)				// JPEG Encode Source Image Height

#define JQTAB0 (JPG_BA+0x100)		// R/W: JPEG Quantization-Table 0 Register

#define JQTAB1 (JPG_BA+0x140)		// R/W: JPEG Quantization-Table 1 Register

#define JQTAB2 (JPG_BA+0x180)		// R/W: JPEG Quantization-Table 2 Register


/* Advance Interrupt Controller (AIC) Registers */
//#define AIC_BA		w55fa92_VA_IRQ		/* Interrupt Controller */
#define REG_AIC_SCR1    (AIC_BA+0x000)
#define REG_AIC_IRSR    (AIC_BA+0x100)   /* Interrupt raw status register */
#define REG_AIC_IRSRH   	(AIC_BA+0x104)   /* Interrupt raw status register */
#define REG_AIC_IASR    	(AIC_BA+0x108)   /* Interrupt active status register */
#define REG_AIC_IASRH   (AIC_BA+0x10C)   /* Interrupt active status register */
#define REG_AIC_ISR     	(AIC_BA+0x110)   /* Interrupt status register */
#define REG_AIC_ISRH    	(AIC_BA+0x114)   /* Interrupt status register */
#define REG_AIC_IPER    	(AIC_BA+0x118)   /* Interrupt priority encoding register */
#define REG_AIC_ISNR   	(AIC_BA+0x120)   /* Interrupt source number register */
#define REG_AIC_OISR    	(AIC_BA+0x124)   /* Output interrupt status register */
#define REG_AIC_IMR     	(AIC_BA+0x128)   /* Interrupt mask register */
#define REG_AIC_IMRH     (AIC_BA+0x12C)   /* Interrupt mask register */
#define REG_AIC_MECR    (AIC_BA+0x130)   /* Mask enable command register */
#define REG_AIC_MECRH 	(AIC_BA+0x134)   /* Mask enable command register */
#define REG_AIC_MDCR    (AIC_BA+0x138)   /* Mask disable command register */
#define REG_AIC_MDCRH  (AIC_BA+0x13C)   /* Mask disable command register */
#define REG_AIC_SSCR    	(AIC_BA+0x140)	 /* Source set command register */
#define REG_AIC_SSCRH  (AIC_BA+0x144)	 /* Source set command register */
#define REG_AIC_SCCR    (AIC_BA+0x148)   /* Source clear command register */
#define REG_AIC_SCCRH   (AIC_BA+0x14C)   /* Source clear command register */
#define REG_AIC_EOSCR 	(AIC_BA+0x150)   /* End of service command register */
#define REG_AIC_TEST    (AIC_BA+0x160)   /* ICE/Debug mode register */

#define REG_UART_RBR		(UART_BA+0x00)  		/* Receive Buffer Register */
#define REG_UART_THR		(UART_BA+0x00)  		/* Transmit Holding Register */
#define REG_UART_IER		(UART_BA+0x04)  		/* Interrupt Enable Register */
	#define nDBGACK_EN		BIT31			// ICE debug mode acknowledge enable
	#define EDMA_RX_EN		BIT15			// RX EDMA Enable
	#define EDMA_TX_EN		BIT14			// TX EDMA Enable
	#define Auto_CTS_EN		BIT13			// CTS Auto Flow Control Enable
	#define Auto_RTS_EN		BIT12			// RTS Auto Flow Control Enable
	#define Time_out_EN		BIT11			// Time Out Counter Enable
	#define Wake_IEN			BIT6			// Wake up interrupt enable for INTR[wakeup]
	#define BUF_ERR_IEN		BIT5			// Buffer Error interrupt enable
	#define RTO_IEN			BIT4			// RX Time out Interrupt Enable
	#define MS_IEN				BIT3			// MODEM Status Interrupt (Irpt_MOS) Enable
	#define RLS_IEN			BIT2			// Receive Line Status Interrupt (Irpt_RLS) Enable
	#define THRE_IEN			BIT1			// Transmit Holding Register Empty Interrupt (Irpt_THRE) Enable
	#define RDA_IEN			BIT0			// Receive Data Available Interrupt (Irpt_RDA) Enable and


#define REG_UART_FCR		(UART_BA+0x08)  		/* FIFO Control Register */
	#define RTS_Tri_lev			NVTBIT(19,16)	// RTS Trigger Level
	#define RFITL				NVTBIT(7,4)	// RX FIFO Interrupt (Irpt_RDA) Trigger Level
	#define TX_RST				BIT2			// TX Software Reset
	#define RX_RST			BIT1			// RX Software Reset


#define REG_UART_LCR		(UART_BA+0x0C)  		/* Line Control Register */
	#define DLAB            		BIT7			// Divider Latch Access Bit
	#define BCB             			BIT6			// Break Control Bit
	#define SPE             			BIT5			// Stick Parity Enable.
	#define EPE             			BIT4			// Even Parity Enable
	#define PBE             			BIT3			// Parity Bit Enable
	#define NSB             			BIT2			// Number of "STOP bit"
	#define WLS             			NVTBIT(1,0)	// Word Length Select.

#define REG_UART_MCR		(UART_BA+0x10)  		/* Modem Control Register */
	#define RTS_st					BIT13
	#define Lev_RTS					BIT9
	#define LBME            		BIT4			// Loop-back Mode Enable
	#define CRTS             			BIT1			// Complement version of DTR# (Data-Terminal-Ready) signal

//#define     REG_UART_LSR	(UART_BA+0x14)  		/* Line Status Register */
#define REG_UART_MSR		(UART_BA+0x14)  		/* MODEM Status Register */
	#define Lev_CTS						BIT8
	#define DCD             			BIT7				// Complement version of Data Carrier Detect (nDCD#) input
	#define RI              			BIT6				// Complement version of ring indicator (RI#) input
	#define DSR             			BIT5				// Complement version of data set ready (DSR#) input
	#define CTS_st             			BIT4				// Complement version of clear to send (CTS#) input
	#define DDCD            		BIT3				// DCD# State Change
	#define TERI            			BIT2				// Tailing Edge of RI#
	#define DDSR            		BIT1				// DSR# State Change
	#define DCTS            		BIT0				// CTS# State Change

#define REG_UART_FSR		(UART_BA+0x18) 	 	/* FIFO Status Register */
	#define Tx_err_Flag      	  	BIT31			// Framing Error Indicator
	#define TE_Flag             		BIT28			// Parity Error Indicator
	#define Tx_Over_IF			BIT24			// RX overflow Error IF
	#define Tx_Full				BIT23			// Transmitter FIFO Full
	#define Tx_Empty			BIT22			// Transmitter FIFO Empty
	#define Tx_Pointer			NVTBIT(21,16)		// TX FIFO pointer
	#define Rx_Full				BIT15			// Receiver FIFO Full
	#define Rx_Empty			BIT14			// Receiver FIFO Empty
	#define Rx_Pointer			NVTBIT(13,8)		// RX FIFO pointer
	#define Rx_err_IF			BIT7			// RX Error flag
	#define BII         	    		BIT6			// Break Interrupt Indicator
	#define FEI            			BIT5			// Framing Error Indicator
	#define PEI            			BIT4			// Parity Error Indicator
	#define Rx_Over_IF			BIT0			// RX overflow Error IF
#define REG_UART_ISR		(UART_BA+0x1C)  		/* Interrupt Status Register */
	#define EDMA_RX_Flag		BIT31			// EDMA RX Mode Flag
	#define HW_Wake_INT		BIT30			// Wake up Interrupt pin status
	#define HW_Buf_Err_INT		BIT29			// Buffer Error Interrupt pin status
	#define HW_Tout_INT		BIT28			// Time out Interrupt pin status
	#define HW_Modem_INT		BIT27			// MODEM Status Interrupt pin status
	#define HW_RLS_INT		BIT26			// Receive Line Status Interrupt pin status
	#define Rx_ack_st			BIT25			// TX ack pin status
	#define Rx_req_St			BIT24			// TX req pin status
	#define EDMA_TX_Flag		BIT23			// EDMA TX Mode Flag
	#define HW_Wake_IF		BIT22			// Wake up Flag
	#define	HW_Buf_Err_IF		BIT21			// Buffer Error Flag
	#define HW_Tout_IF			BIT20			// Time out Flag
	#define HW_Modem_IF		BIT19			// MODEM Status Flag
	#define HW_RLS_IF			BIT18			// Receive Line Status Flag
	#define Tx_ack_st			BIT17			// TX ack pin status
	#define Tx_req_St			BIT16			// TX req pin status
	#define Soft_RX_Flag		BIT15			// Software RX Mode Flag
	#define Wake_INT			BIT14			// Wake up Interrupt pin status
	#define Buf_Err_INT			BIT13			// Buffer Error Interrupt pin status
	#define Tout_INT			BIT12			// Time out interrupt Interrupt pin status
	#define Modem_INT			BIT11			// MODEM Status Interrupt pin status
	#define RLS_INT			BIT10			// Receive Line Status Interrupt pin status
	#define THRE_INT			BIT9			// Transmit Holding Register Empty Interrupt pin status
	#define RDA_INT			BIT8			// Receive Data Available Interrupt pin status
	#define Soft_TX_Flag		BIT7			// Software TX Mode Flag
	#define Wake_IF			BIT6			// Wake up Flag
	#define Buf_Err_IF			BIT5			// Buffer Error Flag
	#define Tout_IF				BIT4			// Time out interrupt Flag
	#define Modem_IF			BIT3			// MODEM Status Flag
	#define RLS_IF				BIT2			// Receive Line Status Flag
	#define THRE_IF			BIT1			// Transmit Holding Register Empty Flag
	#define RDA_IF				BIT0			// Receive Data Available Flag

#define REG_UART_TOR		(UART_BA+0x20)  		/* Time Out Register */
	#define TOIC				NVTBIT(6,0)			//Time Out Interrupt Comparator
#define REG_UART_BAUD		(UART_BA+0x24)  		/* Baud Rate Divider Register */
	#define DIV_X_EN			BIT29			// Divisor X Enable
	#define DIV_X_ONE			BIT28			// Divisor X equal 1
	#define Divider_X          	 	NVTBIT(27,24)		// Disisor X
	#define BAUD_RATE_DIVISOR   NVTBIT(15,0)		// Baud Rate Divisor






/* GPIO Control Registers */
//#define GPIO_BA		w55fa92_VA_GPIO		/* GPIO Control */
#define REG_GPIOA_OMD   (GPIO_BA+0x0000)   // GPIO port A bit Output mode Enable
#define REG_GPIOA_PUEN  (GPIO_BA+0x0004)	 // GPIO port A Bit Pull-up Resistor Enable
#define REG_GPIOA_DOUT  (GPIO_BA+0x0008)   // GPIO port A data output value
#define REG_GPIOA_PIN   (GPIO_BA+0x000C)	 // GPIO port A Pin Value

