k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_GPIOB_OMD   (GPIO_BA+0x0010)   // GPIO port B bit Output mode Enable
#define REG_GPIOB_PUEN  (GPIO_BA+0x0014)	 // GPIO port B Bit Pull-up Resistor Enable
#define REG_GPIOB_DOUT  (GPIO_BA+0x0018)   // GPIO port B data output value
#define REG_GPIOB_PIN   (GPIO_BA+ 0x001C)	 // GPIO port B Pin Value

#define REG_GPIOC_OMD   (GPIO_BA+0x0020)  // GPIO port C bit Output mode Enable
#define REG_GPIOC_PUEN  (GPIO_BA+0x0024)	// GPIO port C Bit Pull-up Resistor Enable
#define REG_GPIOC_DOUT  (GPIO_BA+0x0028)  // GPIO port C data output value
#define REG_GPIOC_PIN   (GPIO_BA+0x002C)	// GPIO port C Pin Value

#define REG_GPIOD_OMD   (GPIO_BA+0x0030)  // GPIO port D bit Output mode Enable
#define REG_GPIOD_PUEN  (GPIO_BA+0x0034)	// GPIO port D Bit Pull-up Resistor Enable
#define REG_GPIOD_DOUT  (GPIO_BA+0x0038)  // GPIO port D data output value
#define REG_GPIOD_PIN   (GPIO_BA+0x003C)	// GPIO port D Pin Value

#define REG_GPIOE_OMD   (GPIO_BA+0x0040)  // GPIO port E bit Output mode Enable
#define REG_GPIOE_PUEN  (GPIO_BA+0x0044)	// GPIO port E Bit Pull-up Resistor Enable
#define REG_GPIOE_DOUT  (GPIO_BA+0x0048)  // GPIO port E data output value
#define REG_GPIOE_PIN   (GPIO_BA+ 0x004C)	// GPIO port E Pin Value

#define REG_GPIOG_OMD   (GPIO_BA+0x0050)  // GPIO port G bit Output mode Enable
#define REG_GPIOG_PUEN  (GPIO_BA+0x0054)	// GPIO port G Bit Pull-up Resistor Enable
#define REG_GPIOG_DOUT  (GPIO_BA+0x0058)  // GPIO port G data output value
#define REG_GPIOG_PIN   (GPIO_BA+ 0x005C)	// GPIO port G Pin Value

#define REG_GPIOH_OMD   (GPIO_BA+0x0060)  // GPIO port H bit Output mode Enable
#define REG_GPIOH_PUEN  (GPIO_BA+0x0064)	// GPIO port H Bit Pull-up Resistor Enable
#define REG_GPIOH_DOUT  (GPIO_BA+0x0068)  // GPIO port H data output value
#define REG_GPIOH_PIN   (GPIO_BA+ 0x006C)	// GPIO port H Pin Value

#define REG_DBNCECON   (GPIO_BA+0x0070)  // External Interrupt Debounce Control

#define REG_IRQSRCGPA  (GPIO_BA+0x0080)  // GPIO Port A IRQ Source Grouping
#define REG_IRQSRCGPB  (GPIO_BA+0x0084)  // GPIO Port B IRQ Source Grouping
#define REG_IRQSRCGPC  (GPIO_BA+0x0088)  // GPIO Port C IRQ Source Grouping
#define REG_IRQSRCGPD  (GPIO_BA+0x008C)  // GPIO Port D IRQ Source Grouping
#define REG_IRQSRCGPE  (GPIO_BA+0x0090)  // GPIO Port E IRQ Source Grouping
#define REG_IRQSRCGPG  (GPIO_BA+0x0094)  // GPIO Port G IRQ Source Grouping
#define REG_IRQSRCGPH  (GPIO_BA+0x0098)  // GPIO Port H IRQ Source Grouping

#define REG_IRQENGPA   (GPIO_BA+0x00A0)  // GPIO Port A Interrupt Enable
#define REG_IRQENGPB   (GPIO_BA+0x00A4)  // GPIO Port B Interrupt Enable
#define REG_IRQENGPC   (GPIO_BA+0x00A8)  // GPIO Port C Interrupt Enable
#define REG_IRQENGPD   (GPIO_BA+0x00AC)  // GPIO Port D Interrupt Enable
#define REG_IRQENGPE   (GPIO_BA+0x00B0)  // GPIO Port E Interrupt Enable
#define REG_IRQENGPG   (GPIO_BA+0x00B4)  // GPIO Port G Interrupt Enable
#define REG_IRQENGPH   (GPIO_BA+0x00B8)  // GPIO Port H Interrupt Enable

#define REG_IRQLHSEL   (GPIO_BA+0x00C0)  // Interrupt Latch Trigger Selection Register

#define REG_IRQLHGPA   (GPIO_BA+0x00D0)  // GPIO Port A Interrupt Latch Value
#define REG_IRQLHGPB   (GPIO_BA+0x00D4)  // GPIO Port B Interrupt Latch Value
#define REG_IRQLHGPC   (GPIO_BA+0x00D8)  // GPIO Port C Interrupt Latch Value
#define REG_IRQLHGPD   (GPIO_BA+0x00DC)  // GPIO Port D Interrupt Latch Value
#define REG_IRQLHGPE   (GPIO_BA+0x00E0)  // GPIO Port E Interrupt Latch Value
#define REG_IRQLHGPG   (GPIO_BA+0x00E4)  // GPIO Port G Interrupt Latch Value
#define REG_IRQLHGPH   (GPIO_BA+0x00E8)  // GPIO Port H Interrupt Latch Value

#define REG_IRQTGSRC0   (GPIO_BA+0x00F0) // IRQ0~3 Interrupt Trigger Source Indicator from GPIO Port A and GPIO Port B
#define REG_IRQTGSRC1   (GPIO_BA+0x00F4) // IRQ0~3 Interrupt Trigger Source Indicator from GPIO Port C and GPIO Port D
#define REG_IRQTGSRC2   (GPIO_BA+0x00F8) // IRQ0~3 Interrupt Trigger Source Indicator from GPIO Port E and GPIO Port G
#define REG_IRQTGSRC3   (GPIO_BA+0x00FC) // IRQ0~3 Interrupt Trigger Source Indicator from GPIO Port H


//#define PA_VA_USB_BASE	w55fa92_VA_USBD

#define IRQ_STAT_L			(USBD_BA+0x00)		/* interrupt status low register */
	#define USB_INT		BIT0
	#define CEP_INT		BIT1
	#define EPA_INT		BIT2
	#define EPB_INT		BIT3
	#define EPC_INT		BIT4
	#define EPD_INT		BIT5

#define IRQ_ENB_L		(USBD_BA+0x08)		/* interrupt enable low register */
	#define USB_IE		BIT0
	#define CEP_IE		BIT1
	#define EPA_IE		BIT2
	#define EPB_IE		BIT3
	#define EPC_IE		BIT4
	#define EPD_IE		BIT5

#define USB_IRQ_STAT		(USBD_BA+0x10)		/* usb interrupt status register */
	#define SOF_IS		BIT0
	#define RST_IS		BIT1
	#define RUM_IS		BIT2
	#define SUS_IS		BIT3
	#define HISPD_IS	BIT4
	#define DMACOM_IS	BIT5
	#define TCLKOK_IS	BIT6
	#define RUM_NOCLK_IS	BIT7
	#define VBUS_IS		BIT8

#define USB_IRQ_ENB		(USBD_BA+0x14)		/* usb interrupt enable register */
	#define SOF_IE		BIT0
	#define RST_IE		BIT1
	#define RUM_IE		BIT2
	#define SUS_IE		BIT3
	#define HISPD_IE	BIT4
	#define DMACOM_IE	BIT5
	#define TCLKOK_IE	BIT6
	#define RUM_NOCLK_IE	BIT7
	#define VBUS_IE		BIT8

#define OPER		(USBD_BA+0x18)		/* usb operation register */
	#define GEN_RUM		BIT0
	#define SET_HISPD	BIT1
	#define CUR_SPD		BIT2

#define FRAME_CNT		(USBD_BA+0x1c)		/* usb frame count register */
	#define MFRAM_CNT	NVTBIT(2,0)
	#define USB_FRAME_CNT	NVTBIT(13,3)

#define ADDR		(USBD_BA+0x20)		/* usb address register */
	#define USB_ADDR		NVTBIT(6,0)

#define USB_TEST		(USBD_BA+0x24)		/* usb test mode register */
	#define TESETMODE	NVTBIT(2,0)

#define CEP_DATA_BUF	(USBD_BA+0x28)		/* control-ep data buffer register */

#define CEP_CTRL_STAT	(USBD_BA+0x2c)		/* control-ep control and status register */
	#define NAK_CLEAR	BIT0
	#define STALL		BIT1
	#define CEP_ZEROLEN	BIT2
	#define FLUSH		BIT3

#define CEP_IRQ_ENB	(USBD_BA+0x30)		/* control-ep interrupt enable register */
	#define CEP_SETUP_TK_IE	BIT0
	#define CEP_SETUP_PK_IE	BIT1
	#define CEP_OUT_TK_IE	BIT2
	#define CEP_IN_TK_IE	BIT3
	#define CEP_PING_IE		BIT4
	#define CEP_DATA_TxED_IE	BIT5
	#define CEP_DATA_RxED_IE	BIT6
	#define CEP_NAK_IE		BIT7
	#define CEP_STALL_IE	BIT8
	#define CEP_ERR_IE		BIT9
	#define CEP_STACOM_IE	BIT10
	#define CEP_FULL_IE		BIT11
	#define CEP_EMPTY_IE	BIT12
	#define CEP_O_SHORT_IE	BIT13

