k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define CEP_IRQ_STAT	(USBD_BA+0x34)		/* control-ep interrupt status register */
	#define CEP_SETUP_TK_IS	BIT0
	#define CEP_SETUP_PK_IS	BIT1
	#define CEP_OUT_TK_IS	BIT2
	#define CEP_IN_TK_IS	BIT3
	#define CEP_PING_IS		BIT4
	#define CEP_DATA_TxED_IS	BIT5
	#define CEP_DATA_RxED_IS	BIT6
	#define CEP_NAK_IS		BIT7
	#define CEP_STALL_IS	BIT8
	#define CEP_ERR_IS		BIT9
	#define CEP_STACOM_IS	BIT10
	#define CEP_FULL_IS		BIT11
	#define CEP_EMPTY_IS	BIT12
	#define CEP_O_SHORT_IS	BIT13

#define IN_TRNSFR_CNT	(USBD_BA+0x38)		/* in-transfer data count register */
	#define IN_TRF_CNT	NVTBIT(7,0)

#define OUT_TRNSFR_CNT	(USBD_BA+0x3c)		/* out-transfer data count register */
	#define OUT_TRF_CNT	NVTBIT(15,0)

#define CEP_CNT		(USBD_BA+0x40)		/* control-ep data count register */

#define SETUP1_0		(USBD_BA+0x44)		/* setup byte1 & byte0 register */
	#define SETUP0		NVTBIT(7,0)
	#define SETUP1		NVTBIT(15,8)

#define SETUP3_2		(USBD_BA+0x48)		/* setup byte3 & byte2 register */
	#define SETUP2		NVTBIT(7,0)
	#define SETUP3		NVTBIT(15,8)

#define SETUP5_4		(USBD_BA+0x4c)		/* setup byte5 & byte4 register */
	#define SETUP4		NVTBIT(7,0)
	#define SETUP5		NVTBIT(15,8)

#define SETUP7_6		(USBD_BA+0x50)		/* setup byte7 & byte6 register */
	#define SETUP6		NVTBIT(7,0)
	#define SETUP7		NVTBIT(15,8)

#define CEP_START_ADDR	(USBD_BA+0x54)		/* control-ep ram start address register */
	#define USB_CEP_START_ADDR	NVTBIT(10,0)

#define CEP_END_ADDR	(USBD_BA+0x58)		/* control-ep ram end address register */
	#define USB_CEP_END_ADDR	NVTBIT(10,0)

#define DMA_CTRL_STS	(USBD_BA+0x5c)		/* dma control and status register */
	#define DMA_ADDR	NVTBIT(3,0)
	#define DMA_RD		BIT4
	#define DMA_EN		BIT5
	#define SCAT_GA_EN	BIT6
	#define RST_DMA		BIT7

#define DMA_CNT		(USBD_BA+0x60)		/* dma count register */
	#define USB_DMA_CNT	NVTBIT(19,0)

/* endpoint A/B/C/D/E/F data buffer register */
#define EPA_DATA_BUF	(USBD_BA+0x64)		/* endpoint A data buffer register */
#define EPB_DATA_BUF	(USBD_BA+0x8c)		/* endpoint B data buffer register */
#define EPC_DATA_BUF	(USBD_BA+0xb4)		/* endpoint C data buffer register */
#define EPD_DATA_BUF	(USBD_BA+0xdc)		/* endpoint D data buffer register */
#define EPE_DATA_BUF	(USBD_BA+0x104)	/* endpoint E data buffer register */
#define EPF_DATA_BUF	(USBD_BA+0x12c)	/* endpoint F data buffer register */

/* endpoint A/B/C/D/E/F interrupt status register */
#define EPA_IRQ_STAT	(USBD_BA+0x68)		/* endpoint A interrupt status register */
#define EPB_IRQ_STAT	(USBD_BA+0x90)		/* endpoint B interrupt status register */
#define EPC_IRQ_STAT	(USBD_BA+0xb8)		/* endpoint C interrupt status register */
#define EPD_IRQ_STAT	(USBD_BA+0xe0)		/* endpoint D interrupt status register */
#define EPE_IRQ_STAT	(USBD_BA+0x108)	/* endpoint E interrupt status register */
#define EPF_IRQ_STAT	(USBD_BA+0x130)	/* endpoint F interrupt status register */
	#define FULL_IS		BIT0
	#define EMPTY_IS	BIT1
	#define SHORT_PKT_IS	BIT2
	#define DATA_TxED_IS	BIT3
	#define DATA_RxED_IS	BIT4
	#define OUT_TK_IS	BIT5
	#define IN_TK_IS	BIT6
	#define PING_IS		BIT7
	#define NAK_IS		BIT8
	#define STALL_IS	BIT9
	#define NYET_IS		BIT10
	#define ERR_IS		BIT11
	#define O_SHORT_PKT_IS	BIT12

/* endpoint A/B/C/D/E/F interrupt enable register */
#define EPA_IRQ_ENB	(USBD_BA+0x6c)		/* endpoint A interrupt enable register */
#define EPB_IRQ_ENB	(USBD_BA+0x94)		/* endpoint B interrupt enable register */
#define EPC_IRQ_ENB	(USBD_BA+0xbc)		/* endpoint C interrupt enable register */
#define EPD_IRQ_ENB	(USBD_BA+0xe4)		/* endpoint D interrupt enable register */
#define EPE_IRQ_ENB	(USBD_BA+0x10c)	/* endpoint E interrupt enable register */
#define EPF_IRQ_ENB	(USBD_BA+0x134)	/* endpoint F interrupt enable register */
	#define FULL_IE		BIT0
	#define EMPTY_IE	BIT1
	#define SHORT_PKT_IE	BIT2
	#define DATA_TxED_IE	BIT3
	#define DATA_RxED_IE	BIT4
	#define OUT_TK_IE	BIT5
	#define IN_TK_IE	BIT6
	#define PING_IE		BIT7
	#define NAK_IE		BIT8
	#define STALL_IE	BIT9
	#define NYET_IE		BIT10
	#define ERR_IE		BIT11
	#define O_SHORT_PKT_IE	BIT12

/* data count available in endpoint A/B/C/D/E/F buffer */
#define EPA_DATA_CNT	(USBD_BA+0x70)		/* data count available in endpoint A buffer */
#define EPB_DATA_CNT	(USBD_BA+0x98)		/* data count available in endpoint B buffer */
#define EPC_DATA_CNT	(USBD_BA+0xc0)		/* data count available in endpoint C buffer */
#define EPD_DATA_CNT	(USBD_BA+0xe8)		/* data count available in endpoint D buffer */
#define EPE_DATA_CNT	(USBD_BA+0x110)	/* data count available in endpoint E buffer */
#define EPF_DATA_CNT	(USBD_BA+0x138)	/* data count available in endpoint F buffer */
	#define DMA_LOOP	NVTBIT(30,16)
	#define DATA_CNT	NVTBIT(15,0)

/* endpoint A/B/C/D/E/F response register set/clear */
#define EPA_RSP_SC		(USBD_BA+0x74)		/* endpoint A response register set/clear */
#define EPB_RSP_SC		(USBD_BA+0x9c)		/* endpoint B response register set/clear */
#define EPC_RSP_SC		(USBD_BA+0xc4)		/* endpoint C response register set/clear */
#define EPD_RSP_SC		(USBD_BA+0xec)		/* endpoint D response register set/clear */
#define EPE_RSP_SC		(USBD_BA+0x114)	/* endpoint E response register set/clear */
#define EPF_RSP_SC		(USBD_BA+0x13c)	/* endpoint F response register set/clear */
	#define BUF_FLUSH	BIT0
	#define MODE		NVTBIT(2,1)
	#define TOGGLE		BIT3
	#define HALT		BIT4
	#define ZEROLEN		BIT5
	#define PK_END		BIT6
	#define DIS_BUF		BIT7

/* endpoint A/B/C/D/E/F max packet size register */
#define EPA_MPS		(USBD_BA+0x78)		/* endpoint A max packet size register */
#define EPB_MPS		(USBD_BA+0xa0)		/* endpoint B max packet size register */
#define EPC_MPS		(USBD_BA+0xc8)		/* endpoint C max packet size register */
#define EPD_MPS		(USBD_BA+0xf0)		/* endpoint D max packet size register */
#define EPE_MPS		(USBD_BA+0x118)	/* endpoint E max packet size register */
#define EPF_MPS		(USBD_BA+0x140)	/* endpoint F max packet size register */
	#define EP_MPS		NVTBIT(10,0)

/* endpoint A/B/C/D/E/F transfer count register */
#define EPA_TRF_CNT	(USBD_BA+0x7c)		/* endpoint A transfer count register */
#define EPB_TRF_CNT	(USBD_BA+0xa4)		/* endpoint B transfer count register */
#define EPC_TRF_CNT	(USBD_BA+0xcc)		/* endpoint C transfer count register */
#define EPD_TRF_CNT	(USBD_BA+0xf4)		/* endpoint D transfer count register */
#define EPE_TRF_CNT	(USBD_BA+0x11c)	/* endpoint E transfer count register */
#define EPF_TRF_CNT	(USBD_BA+0x144)	/* endpoint F transfer count register */
	#define EP_TRF_CNT	NVTBIT(10,0)

