k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
/* endpoint A/B/C/D/E/F configuration register */
#define EPA_CFG		(USBD_BA+0x80)		/* endpoint A configuration register */
#define EPB_CFG		(USBD_BA+0xa8)		/* endpoint B configuration register */
#define EPC_CFG		(USBD_BA+0xd0)		/* endpoint C configuration register */
#define EPD_CFG		(USBD_BA+0xf8)		/* endpoint D configuration register */
#define EPE_CFG		(USBD_BA+0x120)	/* endpoint E configuration register */
#define EPF_CFG		(USBD_BA+0x148)	/* endpoint F configuration register */
	#define EP_VALID	BIT0
	#define EP_TYPE		NVTBIT(2,1)
	#define EP_DIR		BIT3
	#define EP_NUM		NVTBIT(7,4)
	#define EP_MULT		NVTBIT(9,8)

/* endpoint A/B/C/D/E/F ram start address register */
#define EPA_START_ADDR	(USBD_BA+0x84)		/* endpoint A ram start address register */
#define EPB_START_ADDR	(USBD_BA+0xac)		/* endpoint B ram start address register */
#define EPC_START_ADDR	(USBD_BA+0xd4)		/* endpoint C ram start address register */
#define EPD_START_ADDR	(USBD_BA+0xfc)		/* endpoint D ram start address register */
#define EPE_START_ADDR	(USBD_BA+0x124)	/* endpoint E ram start address register */
#define EPF_START_ADDR	(USBD_BA+0x14c)	/* endpoint F ram start address register */
	#define EP_START_ADDR	NVTBIT(11,0)

#define EPA_END_ADDR	(USBD_BA+0x88)		/* endpoint A ram end address register */
#define EPB_END_ADDR	(USBD_BA+0xb0)		/* endpoint B ram end address register */
#define EPC_END_ADDR	(USBD_BA+0xd8)		/* endpoint C ram end address register */
#define EPD_END_ADDR	(USBD_BA+0x100)	/* endpoint D ram end address register */
#define EPE_END_ADDR	(USBD_BA+0x128)	/* endpoint E ram end address register */
#define EPF_END_ADDR	(USBD_BA+0x150)	/* endpoint F ram end address register */
	#define EP_END_ADDR	NVTBIT(11,0)

#define USB_MEM_TEST	(USBD_BA+0x154)	/* endpoint F ram end address register */
	#define MODE_A		BIT0
	#define ERR_A		BIT1
	#define FINISH_A	BIT2
	#define FAIL_A		BIT3
	#define MODE_O		BIT4
	#define SHIFT_O		BIT5
	#define FINISH_O	BIT6
	#define FAIL_O		BIT7
	#define OUT_O		BIT8

#define HEAD_WORD0		(USBD_BA+0x158)	/* first head data */
#define HEAD_WORD1		(USBD_BA+0x15C)	/* second head data */
#define HEAD_WORD2		(USBD_BA+0x160)	/* third head data */

#define EPA_HEAD_CNT		(USBD_BA+0x164)	/* EPA head count */
#define EPB_HEAD_CNT		(USBD_BA+0x168)	/* EPB head count */
#define EPC_HEAD_CNT		(USBD_BA+0x16C)	/* EPC head count */
#define EPD_HEAD_CNT		(USBD_BA+0x170)	/* EPD head count */
#define EPE_HEAD_CNT		(USBD_BA+0x174)	/* EPE head count */
#define EPF_HEAD_CNT		(USBD_BA+0x178)	/* EPF head count */

#define AHB_DMA_ADDR	(USBD_BA+0x700)		/* AHB_DMA address register */

#define PHY_CTL		(USBD_BA+0x704)		/* AHB_DMA address register */
	#define bisten		BIT0
	#define bisterr		BIT1
	#define siddq		BIT2
	#define xo_on		BIT3
	#define clk_sel		NVTBIT(5,4)
	#define refclk		BIT6
	#define clk48		BIT7
	#define vbus_detect	BIT8
	#define Phy_suspend	BIT9
	#define Vbus_status	BIT31







//#define I2C_BASE	w55fa92_VA_I2C	/* I2CH Control */
#define REG_I2C_CSR 		(I2C_BA+0x0000)		// R/W: Control and Status  Register
	#define I2C_RXACK 		BIT11			// Received ACK from Slave
    	#define I2C_BUSY 		BIT10			// I2C bus busy
    	#define I2C_AL 			BIT9				// Arbitration lost
    	#define I2C_TIP 			BIT8				// Transfer in progress
    	#define TX_NUM 			NVTBIT(5,4)			// Transmit byte count
    	#define SGMST_EN 			BIT3				// Single master mode enable
    	#define CSR_IF 			BIT2				// Interrupt flag
    	#define CSR_IE 			BIT1				// Interrupt enable
    	#define I2C_EN 			BIT0				// I2C core enabl

#define REG_I2C_DIVIDER (I2C_BA+0x0004)	// R/W:Clock Prescale Register
       #define I2C_DIV 			NVTBIT(15,0)

#define REG_I2C_CMDR 	(I2C_BA+0x0008)			// R/W:Command Register
	#define START 			BIT4				// Generate start condition
	#define STOP 			BIT3				// Generate stop condition
	#define READ 			BIT2				// Read data from slave
    	#define WRITE 			BIT1				// Write data from slave
    	#define ACK 				BIT0					// Send ACK to slave

#define REG_I2C_SWR 	(I2C_BA+0x000C)			// R/W:Software Mode Register
	#define SER 				BIT5					// Serial interface SDO status
	#define SDR 				BIT4					// Serial interface SDA status
    	#define SCR 				BIT3					// Serial interface SCK status
    	#define SEW 				BIT2					// Serial interface SDO output control
    	#define SDW 				BIT1					// Serial interface SDW status control
    	#define SCW 				BIT0					// Serial interface SCW output control

#define REG_I2C_RxR 		(I2C_BA+0x0010)			// R:Data Receive Register
#define REG_I2C_TxR 		(I2C_BA+0x0014)			// R/W:Data Transmit Register

#define REG_KPICONF		(KPI_BA+0x0000)	// R/W	Keypad controller configuration Register
	#define KROW 			NVTBIT(31,28)		// Keypad Matrix ROW number
	#define KCOL 			NVTBIT(25,24)		// Keypad Matrix COL Number
	#define DB_EN			BIT21			// Scan In Signal De-bounce Enable
	#define DB_CLKSEL 		NVTBIT(19,16)		// Scan In De-bounce sampling cycle selection
	#define PRESCALE		NVTBIT(15,8)		// Row Scan Cycle Pre-scale Value
	#define INPU 			BIT6			// key Scan In Pull-UP Enable Register
	#define WAKEUP			BIT5			// Lower Power Wakeup Enable
	#define ODEN				BIT4		// Open Drain Enable
	#define INTEN			BIT3		// Key Interrupt Enable Control
	#define RKINTEN			BIT2			// Release Key Interrupt Enable Cintrol
	#define PKINTEN			BIT1			// Press Key Interrupt Enable Control
	#define ENKP				BIT0			// Keypad Scan Enable

#define REG_KPI3KCONF	(KPI_BA+0x0004)	// R/W	Keypad controller 3-keys configuration register
	#define EN3KYRST 		BIT24			// Enable Three-key Reset
	#define K32R 			NVTBIT(21,18)		// The #2 Key Row Address
	#define K32C				NVTBIT(17,16)		// The #2 Key Column Address
	#define K31R				NVTBIT(13,10)		// The #1 Key Row Address
	#define K31C 			NVTBIT(9,8)		// The #1 Key Column Address
	#define K30R				NVTBIT(5,2)		// The #0 Key Row Address
	#define K30C				NVTBIT(1,0)		//	The #0 Key Column Address

#define REG_KPISTATUS	(KPI_BA+0x0008)	// R/O	Key Pad Interface Status Register
	#define PKEY_INT			BIT4			// Press key interrupt
	#define RKEY_INT			BIT3			// Release key interrupt
	#define KEY_INT			BIT2			// Key Interrupt
	#define RST_3KEY		BIT1			// 3-Keys Reset Flag
	#define PDWAKE			BIT0			// Power Down Wakeup Flag

#define REG_KPIRSTC		(KPI_BA+0x000c)	// R/O	Keypad reset period controller register
	#define RSTC				NVTBIT(7,0)			// 3-key Reset Period Count

#define REG_KPIKEST0	(KPI_BA+0x0010)	// R/O	Keypad state register 0
#define REG_KPIKEST1	(KPI_BA+0x0014)	// R/O	Keypad state register 1
#define REG_KPIKPE0		(KPI_BA+0x0018)	// R/O	Lower 32 Press Key event indicator
#define REG_KPIKPE1		(KPI_BA+0x001C)	// R/O	Higher 32 Press Key event indicator
#define REG_KPIKRE0		(KPI_BA+0x0020)	// R/O	Lower 32 Realease Key event indicator
#define REG_KPIKRE1		(KPI_BA+0x0024)	// R/O	Higher 32 Realease Key event indicator
#define REG_KPIPRESCALDIV	(KPI_BA+0x0028)	// Prescale divider
	#define PRESCALDIV 		NVTBIT(7,0)
#define REG_KPILCM		(KPI_BA+0x002C)	// Keypad and LCM Bus Share Setting
	#define LCMMODE			BIT31		// LCM Mode Enable
	#define KPI_8BIT			BIT30		// KPI_8BIT
	#define HSDBROW			NVTBIT(11,8)		// Row scan time
	#define HSDBNUM			NVTBIT(7,0)		// Debounce time
#define REG_KPISUS		(KPI_BA+0x0030)	// Keypad Suspend Mode Setting
	#define SUSFORCE		BIT31		// Force KPI into suspend mode
	#define SUSCNUM			NVTBIT(19,0)		// suspend mode detection


