k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
//#define SPI_BASE_0	(w55fa92_VA_SPI0)
#define REG_SPI0_CNTRL		(SPI0_BA + 0x0000)
	#define SIO_DIR			BIT24			//Serial Input / Output Direction Control
	#define Tx_NUM			NVTBIT(23,21)		// Transmit/Receive Numbers.
	#define BYTE_ENDIN		BIT20			//BYTE ENDIN
	#define BYTE_SLEEP		BIT19			//BYTE SLEEP
	#define SLAVE			BIT18			// SLAVE Mode Indication
	#define IE				BIT17			// Interrupt Enable¡P
	#define IFG				BIT16			// Interrupt Flag¡P
	#define SLEEP			NVTBIT(15,12)		// Suspend Interval.
	#define CLKP				BIT11			// Clock Polarity¡P
	#define LSB				BIT10			// Send LSB First¡P
	#define BIT_MODE		NVTBIT(9,8)			// Bit Mode¡P
	#define Tx_BIT_LEN		NVTBIT(7,3)		// Transmit Bit Length.
	#define Tx_NEG			BIT2			// Transmit On Negative Edge¡P
	#define Rx_NEG			BIT1			// Receive On Negative Edge¡P
	#define GO_BUSY			BIT0			// Go and Busy Status¡P

#define REG_SPI0_DIVIDER	(SPI0_BA + 0x0004)
	#define SPI0_DIV			NVTBIT(15,0)		//Clock Divider Register

#define REG_SPI0_SSR		(SPI0_BA + 0x0008)
	#define LTRIG_FLAG		BIT5			// Level Trigger Flag
	#define SS_LTRIG			BIT4			// Slave Select Level Trigger¡P
	#define ASS				BIT3			// Automatic Slave Select¡P
	#define SS_LVL			BIT2			// Slave Select Active Level.
											// It defines the active level of device/slave select signal (mw_ss_o).
	#define SSR				NVTBIT(1,0)		// Slave Select register

#define REG_SPI0_JS			(SPI0_BA + 0x0010)
	#define READY			BIT8			// Slave is ready to transmit / recieve data
	#define JS_INT_FLAG		NVTBIT(7,5)		// Joystick Mode Interrupt Flag
	#define JS_RW			BIT4			// Read / Write Mode
	#define JS				BIT0			// Dongle Joystick mode

#define REG_SPI0_TURBO		(SPI0_BA + 0x0014)
	#define TURBO			BIT0			// SPI Turbo mode

#define REG_SPI0_EDMA		(SPI0_BA + 0x0018)
	#define EDMA_RW		BIT1			// EDMA Read or EDMA Write
	#define EDMA_GO			BIT0			// EDMA Start

#define REG_SPI0_RX0		(SPI0_BA + 0x0020)
#define REG_SPI0_RX1		(SPI0_BA + 0x0024)
#define REG_SPI0_RX2		(SPI0_BA + 0x0028)
#define REG_SPI0_RX3		(SPI0_BA + 0x002c)
#define REG_SPI0_RX4		(SPI0_BA + 0x0030)
#define REG_SPI0_RX5		(SPI0_BA + 0x0034)
#define REG_SPI0_RX6		(SPI0_BA + 0x0038)
#define REG_SPI0_RX7		(SPI0_BA + 0x003c)

#define REG_SPI0_TX0		(SPI0_BA + 0x0020)
#define REG_SPI0_TX1		(SPI0_BA + 0x0024)
#define REG_SPI0_TX2		(SPI0_BA + 0x0028)
#define REG_SPI0_TX3		(SPI0_BA + 0x002c)
#define REG_SPI0_TX4		(SPI0_BA + 0x0030)
#define REG_SPI0_TX5		(SPI0_BA + 0x0034)
#define REG_SPI0_TX6		(SPI0_BA + 0x0038)
#define REG_SPI0_TX7		(SPI0_BA + 0x003c)

//#define SPI_BASE_1	(w55fa92_VA_SPI1)
#define REG_SPI1_CNTRL		(SPI1_BA + 0x0000)
#define REG_SPI1_DIVIDER	(SPI1_BA + 0x0004)
#define REG_SPI1_SSR		(SPI1_BA + 0x0008)

#define REG_SPI1_JS			(SPI1_BA + 0x0010)
#define REG_SPI1_TURBO		(SPI1_BA + 0x0014)
#define REG_SPI1_EDMA		(SPI1_BA + 0x0018)

#define REG_SPI1_RX0		(SPI1_BA + 0x0020)
#define REG_SPI1_RX1		(SPI1_BA + 0x0024)
#define REG_SPI1_RX2		(SPI1_BA + 0x0028)
#define REG_SPI1_RX3		(SPI1_BA + 0x002c)
#define REG_SPI1_RX4		(SPI1_BA + 0x0030)
#define REG_SPI1_RX5		(SPI1_BA + 0x0034)
#define REG_SPI1_RX6		(SPI1_BA + 0x0038)
#define REG_SPI1_RX7		(SPI1_BA + 0x003c)

#define REG_SPI1_TX0		(SPI1_BA + 0x0020)
#define REG_SPI1_TX1		(SPI1_BA + 0x0024)
#define REG_SPI1_TX2		(SPI1_BA + 0x0028)
#define REG_SPI1_TX3		(SPI1_BA + 0x002c)
#define REG_SPI1_TX4		(SPI1_BA + 0x0030)
#define REG_SPI1_TX5		(SPI1_BA + 0x0034)
#define REG_SPI1_TX6		(SPI1_BA + 0x0038)
#define REG_SPI1_TX7		(SPI1_BA + 0x003c)

//#define PWM_BASE	(w55fa92_VA_PWM)

#define PPR         (PWM_BA+0x000)			// R/W: PWM Prescaler Register
	#define DZI1            NVTBIT(31,24)	 	// Dead zone interval register 1
	#define DZI0            NVTBIT(23,16)			// Dead zone interval register 0
	#define CP1             NVTBIT(15,8)			// Clock prescaler 1 for PWM Timer channel 2 & 3
	#define CP0             NVTBIT(7,0)			// Clock prescaler 0 for PWM Timer channel 0 & 1

#define PWM_CSR     (PWM_BA+0x004)		// R/W: PWM Clock Select Register
	#define CSR3            NVTBIT(14,12)			// Select clock input for channel 3
	#define CSR2            NVTBIT(10,8)			// Select clock input for channel 2
	#define CSR1            NVTBIT(6,4)			// Select clock input for channel 1
	#define CSR0            NVTBIT(2,0)			// Select clock input for channel 0

#define PCR         (PWM_BA+0x008)			// R/W: PWM Control Register
	#define CH3MOD          BIT27				// Channel 3 toggle/one shot mode
	#define CH3INV          BIT26				// Channel 3 inverter on/off
	#define CH3EN           BIT24				// Channel 3 enable/disable
	#define CH2MOD          BIT19				// Channel 2 toggle/one shot mode
	#define CH2INV          BIT18				// Channel 2 inverter on/off
	#define CH2EN           BIT16				// Channel 2 enable/disable
	#define CH1MOD          BIT11				// Channel 1 toggle/one shot mode
	#define CH1INV          BIT10				// Channel 1 inverter on/off
	#define CH1EN           BIT8				// Channel 1 enable/disable
	#define DZEN1           BIT5				// Dead-Zone generator 1 enable/disable
	#define DZEN0           BIT4				// Dead-Zone generator 0 enable/disable
	#define CH0MOD          BIT3				// Channel 0 toggle/one shot mode
	#define CH0INV          BIT2				// Channel 0 inverter on/off
	#define CH0EN           BIT0				// Channel 0 enable/disable

#define CNR0        (PWM_BA+0x00C)			// R/W: PWM Counter Register 0
#define CNR1        (PWM_BA+0x018)			// R/W: PWM Counter Register 1
#define CNR2        (PWM_BA+0x024)			// R/W: PWM Counter Register 2
#define CNR3        (PWM_BA+0x030)			// R/W: PWM Counter Register 3
	#define CNR             NVTBIT(15,0)			    // PWM counter/timer buff

#define CMR0        (PWM_BA+0x010)			// R/W: PWM Comparator Register 0
#define CMR1        (PWM_BA+0x01C)			// R/W: PWM Comparator Register 1
#define CMR2        (PWM_BA+0x028)			// R/W: PWM Comparator Register 2
#define CMR3        (PWM_BA+0x034)			// R/W: PWM Comparator Register 3
	#define CMR             NVTBIT(15,0)			    // PWM comparator register

#define PDR0        (PWM_BA+0x014)			// R  : PWM Data Register 0
#define PDR1        (PWM_BA+0x020)			// R  : PWM Data Register 1
#define PDR2        (PWM_BA+0x02C)			// R  : PWM Data Register 2
#define PDR3        (PWM_BA+0x038)			// R  : PWM Data Register 3
	#define PDR             NVTBIT(15,0)			// PWM data register

#define PIER        (PWM_BA+0x040)			// R/W: PWM Interrupt Enable Register
	#define PIER3           BIT3				// PWM timer channel 3 interrupt enable/disable
	#define PIER2           BIT2				// PWM timer channel 2 interrupt enable/disable
	#define PIER1           BIT1				// PWM timer channel 1 interrupt enable/disable
	#define PIER0           BIT0				// PWM timer channel 0 interrupt enable/disable

#define PIIR        (PWM_BA+0x044)			// R/C: PWM Interrupt Identification Register
	#define PIIR3           BIT3				// PWM timer channel 3 interrupt flag
	#define PIIR2           BIT2				// PWM timer channel 2 interrupt flag
	#define PIIR1           BIT1				// PWM timer channel 1 interrupt flag
	#define PIIR0           BIT0				// PWM timer channel 0 interrupt flag

