k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define CCR0        (PWM_BA+0x050)			//R/W: Capture Control Register
	#define CFLRD1          BIT23			//CFLR1 dirty bit
	#define CRLRD1          BIT22			//CRLR1 dirty bit
	#define CIIR1           BIT20			//Capture Interrupt Indication 1 Enable/Disable
	#define CAPCH1EN        BIT19			//Capture Channel 1 transition Enable/Disable
	#define FL_IE1          BIT18			//Channel1 Falling Interrupt Enable ON/OFF
	#define RL_IE1          BIT17			//Channel1 Rising Interrupt Enable ON/OFF
	#define INV1            BIT16			//Channel 1 Inverter ON/OFF
	#define CFLRD0          BIT7			//CFLR0 dirty bit
	#define CRLRD0          BIT6			//CRLR0 dirty bit
	#define CIIR0           BIT4			//Capture Interrupt Indication 0 Enable/Disable
	#define CAPCH0EN        BIT3			//Capture Channel 0 transition Enable/Disable
	#define FL_IE0          BIT2			//Channel0 Falling Interrupt Enable ON/OFF
	#define RL_IE0          BIT1			//Channel0 Rising Interrupt Enable ON/OFF
	#define INV0            BIT0			//Channel 0 Inverter ON/OFF


#define CCR1        (PWM_BA+0x054)			//R/W: Capture Control Register
	#define CFLRD3          BIT23			//CFLR3 dirty bit
	#define CRLRD3          BIT22			//CRLR3 dirty bit
	#define CIIR3           BIT20			//Capture Interrupt Indication 3 Enable/Disable
	#define CAPCH3EN        BIT19			//Capture Channel 3 transition Enable/Disable
	#define FL_IE3          BIT18			//Channel3 Falling Interrupt Enable ON/OFF
	#define RL_IE3          BIT17			//Channel3 Rising Interrupt Enable ON/OFF
	#define INV3            BIT16			//Channel 3 Inverter ON/OFF
	#define CFLRD2          BIT7			//CFLR2 dirty bit
	#define CRLRD2          BIT6			//CRLR2 dirty bit
	#define CIIR2           BIT4			//Capture Interrupt Indication 2 Enable/Disable
	#define CAPCH2EN        BIT3			//Capture Channel 2 transition Enable/Disable
	#define FL_IE2          BIT2			//Channel2 Falling Interrupt Enable ON/OFF
	#define RL_IE2          BIT1			//Channel2 Rising Interrupt Enable ON/OFF
	#define INV2            BIT0			//Channel 2 Inverter ON/OFF

#define CRLR0       (PWM_BA+0x058)		//R/W: Capture Rising Latch Register (channel 0)
#define CRLR1       (PWM_BA+0x060)		//R/W: Capture Rising Latch Register (channel 1)
#define CRLR2       (PWM_BA+0x068)		//R/W: Capture Rising Latch Register (channel 2)
#define CRLR3       (PWM_BA+0x070)		//R/W: Capture Rising Latch Register (channel 3)
	#define PWM_CRLR0       NVTBIT(15,0)		//Capture Rising Latch Register

#define CFLR0       (PWM_BA+0x05C)		//R/W: Capture Falling Latch Register (channel 0)
#define CFLR1       (PWM_BA+0x064)		//R/W: Capture Falling Latch Register (channel 1)
#define CFLR2       (PWM_BA+0x06C)		//R/W: Capture Falling Latch Register (channel 2)
#define CFLR3       (PWM_BA+0x074)		//R/W: Capture Falling Latch Register (channel 3)
	#define PWM_CFLR0       NVTBIT(15,0)		//Capture Falling Latch Register

#define CAPENR      (PWM_BA+0x078)		//R/W: Capture Input Enable Register
	#define PWM_CAPENR      NVTBIT(3,0)		//Capture Input Enable

#define POE         (PWM_BA+0x07C)			//R/W: PWM Output Enable Register
	#define PWM3            BIT3			//PWM 3 Output Enable
	#define PWM2            BIT2			//PWM 2 Output Enable
	#define PWM1            BIT1			//PWM 1 Output Enable
	#define PWM0            BIT0			//PWM 0 Output Enable


#define INIR    (RTC_BA+0x000)	// R/W: RTC Initiation Register
	#define INIR_INIR   NVTBIT(31,1)		// RTC Initiation
	#define Active      BIT0				// RTC Active Status.

#define AER     (RTC_BA+0x004)	// R/W: RTC Initiation Register
	#define ENF         BIT16			// RTC Initiation
	#define AER_AER     NVTBIT(15,0)	// RTC Active Status.

#define RTC_FCR (RTC_BA+0x008)	// R/W: RTC Frequency Compensation Register
	#define FC_EN		BIT31
	#define POWER_KEY_DURATION  NVTBIT(26,24)
	#define INTEGER     NVTBIT(23,8)		// Integer  Part
	#define FRACTION    NVTBIT(5,0)			// Fraction Part

#define TLR     (RTC_BA+0x00C)	// R/W: Time Loading Register
	#define TLR_10HR    NVTBIT(21,20)		// 10 Hour Time Digit
	#define TLR_1HR     NVTBIT(19,16)		// 1 Hour Time Digit
	#define TLR_10MIN   NVTBIT(14,12)		// 10 Min Time Digit
	#define TLR_1MIN    NVTBIT(11,8)		// 1 Min Time Digit
	#define TLR_10SEC   NVTBIT(6,4)			// 10 Sec Time Digit
	#define TLR_1SEC    NVTBIT(3,0)			// 1 Sec Time Digit

#define CLR     (RTC_BA+0x010)	// R/W: Calendar Loading Register
	#define CLR_10YEAR  NVTBIT(23,20)		// 10-Year Calendar Digit
	#define CLR_1YEAR   NVTBIT(19,16)		// 1-Year Calendar Digit
	#define CLR_10MON   BIT12				// 10-Month Calendar Digit
	#define CLR_1MON    NVTBIT(11,8)		// 1-Month Calendar Digit
	#define CLR_10DAY   NVTBIT(5,4)			// 10-Day Calendar Digit
	#define CLR_1DAY    NVTBIT(3,0)			// 1-Day Calendar Digit

#define TSSR    (RTC_BA+0x014)	// R/W  : Time Scale Selection Register
	#define TSSR_24_12  BIT0				//24-Hour / 12-Hour Mode Selection

#define DWR     (RTC_BA+0x018)	// R/W: Day of the Week Register
	#define RTC_DWR     NVTBIT(2,0)			//Day of the Week Register

#define TAR     (RTC_BA+0x01C)	// R/W: Time Alarm Register
	#define TAR_Mask_HR_Alarm	BIT23		// Mask alarm by hour
	#define TAR_10HR    NVTBIT(21,20)		// 10 Hour Time Digit
	#define TAR_1HR     NVTBIT(19,16)		// 1 Hour Time Digit
	#define TAR_Mask_Min_Alarm	BIT15		// Mask alarm by minute
	#define TAR_10MIN   NVTBIT(14,12)		// 10 Min Time Digit
	#define TAR_1MIN    NVTBIT(11,8)		// 1 Min Time Digit
	#define TAR_Mask_Sec_Alarm	BIT7		// Mask alarm by second
	#define TAR_10SEC   NVTBIT(6,4)			// 10 Sec Time Digit
	#define TAR_1SEC    NVTBIT(3,0)			// 1 Sec Time Digit

#define CAR     (RTC_BA+0x020)	// R/W: Calendar Alarm Register
	#define CAR_Mask_WD_Alarm	BIT31			// Mask alarm by week day
	#define CAR_Week_day		NVTBIT(30,28)	// Week day alarm bit
	#define CAR_Mask_Yr_Alarm	BIT24			// Mask alram by year
	#define CAR_10YEAR  NVTBIT(23,20)			// 10-Year Calendar Digit
	#define CAR_1YEAR   NVTBIT(19,16)			// 1-Year Calendar Digit
	#define CAR_Mon_Alarm		BIT15			// Mask alarm by month
	#define CAR_10MON   BIT12					// 10-Month Calendar Digit
	#define CAR_1MON    NVTBIT(11,8)			// 1-Month Calendar Digit
	#define CAR_Mask_Day_Alarm	BIT7			// Mask alarm by day
	#define CAR_10DAY   NVTBIT(5,4)				// 10-Day Calendar Digit
	#define CAR_1DAY    NVTBIT(3,0)				// 1-Day Calendar Digit

#define LIR     (RTC_BA+0x024)	// R: RTC Leap year Indication Register
	#define LIR_LIR     BIT0			// Leap Year Indication REGISTER

#define RIER    (RTC_BA+0x028)	// R/W: RTC Interrupt Enable Register
	#define RAIER        BIT3			// RTC Relative Alarm Interrupt Enable
	#define PSWIER        BIT2			// RTC Power Switch Interrupt Enable
	#define TIER        BIT1			// Time Tick Interrupt Enable
	#define AIER        BIT0			// Alarm Interrupt Enable


#define RIIR    (RTC_BA+0x02C)	// R/W: RTC Interrupt Enable Register
	#define RAI	        BIT3			// RTC Relative Alarm Interrupt Indication
	#define PSWI        BIT2			// RTC Power Switch Interrupt Indication
	#define TI          BIT1			// RTC Time Tick Interrupt Indication
	#define AI          BIT0			// RTC Alarm Interrupt Indication

