k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define TTR     (RTC_BA+0x030)	// R/W: RTC Time Tick Register
	#define TTR_TTR     NVTBIT(2,0)		// Time Tick Register

#define PWRON 	(RTC_BA+0x034)	// R/W: RTC Power Time On Register
	#define RELATIVE_TIME	NVTBIT(31,20)
	#define PCLR_TIME     	NVTBIT(19,16)
	#define SW_STATUS     	NVTBIT(15,8)
	#define PWR_KEY			BIT7
	#define EDGE_TRIG		BIT5
	#define REL_ALARM_EN	BIT4
	#define ALARM_EN  		BIT3
	#define HW_PCLR_EN		BIT2
	#define SW_PCLR     	BIT1
	#define RTC_PWRON   	BIT0

#define REG_RTC_SET (RTC_BA+0x038)
	#define RTC_WEAK		BIT0
	#define RTC_EN			BIT1
	#define RTC_AEN			BIT2
	#define XIN_XC			BIT3
	#define XOUT_XC			BIT4

#define REG_OSC_32K (RTC_BA+0x03C)
	#define OSC_32K_EN	BIT0

#define REG_1Hz_CNT (RTC_BA+0x040)

#define REG_FLAG	 (RTC_BA+0x044)
	#define RTC_REG_FLAG BIT0

#define PORCTRL		(RTC_BA+0x50)
	#define POR_Active			NVTBIT(14,0)
	#define POR_EN_Manual		BIT15
	#define POR_Sample_Cnt		NVTBIT(30,16)
	#define POR_Auto_CTRL_En	BIT31

#define RTC_DUMMY0	(RTC_BA+0x54)

#define RTC_DUMMY1	(RTC_BA+0x58)

//#define EDMA_BA	(w55fa92_VA_EDMA)

#define REG_VDMA_CSR  (EDMA_BA + 0x0000)		// VDMA Control and Status Register CH0
#define REG_PDMA_CSR1  (EDMA_BA + 0x0100)		// PDMA Control and Status Register CH1
#define REG_PDMA_CSR2  (EDMA_BA + 0x0200)		// PDMA Control and Status Register CH2
#define REG_PDMA_CSR3  (EDMA_BA + 0x0300)		// PDMA Control and Status Register CH3
#define REG_PDMA_CSR4  (EDMA_BA + 0x0400)		// PDMA Control and Status Register CH4
#define REG_VDMA_CSR5  (EDMA_BA + 0x0500)		// VDMA Control and Status Register CH5
#define REG_VDMA_CSR8  (EDMA_BA + 0x0800)		// VDMA Control and Status Register CH8
#define REG_PDMA_CSR9  (EDMA_BA + 0x0900)		// PDMA Control and Status Register CH9
#define REG_PDMA_CSR10  (EDMA_BA + 0x0A00)		// PDMA Control and Status Register CH10
#define REG_PDMA_CSR11  (EDMA_BA + 0x0B00)		// PDMA Control and Status Register CH11
#define REG_PDMA_CSR12  (EDMA_BA + 0x0C00)		// PDMA Control and Status Register CH12
	#define TRIG_EN	    BIT23		// Enalbe EDMA Data Read or Write Transfer
	#define APB_TWS       NVTBIT(20, 19)// Peripheral Transfer Width Select
	#define WAR_BCR_SEL   NVTBIT(15, 12)// Wrap Around Transfer Byte Count Interrupt Select
	#define EDMASG_EN         BIT9		// EDMA Scatter-Gather Function Enable
	#define EDMA_SW_RST     BIT8		// EDMA Rest
	#define DAD_SEL       NVTBIT(7, 6)	// Transfer Destination Address Direction Select
	#define SAD_SEL       NVTBIT(5, 4)	// Transfer Source Address Direction Select
	#define MODE_SEL      NVTBIT(3, 2)	// EDMA Mode Select
	#define SW_RST        BIT1		// Software Engine Reset
	#define EDMACEN       BIT0		// EDMA Channel Enable

#define REG_VDMA_SAR  (EDMA_BA + 0x0004)		// VDMA Transfer Source Address Register CH0
#define REG_PDMA_SAR1  (EDMA_BA + 0x0104)		// PDMA Transfer Source Address Register CH1
#define REG_PDMA_SAR2  (EDMA_BA + 0x0204)		// PDMA Transfer Source Address Register CH2
#define REG_PDMA_SAR3  (EDMA_BA + 0x0304)		// PDMA Transfer Source Address Register CH3
#define REG_PDMA_SAR4  (EDMA_BA + 0x0404)		// PDMA Transfer Source Address Register CH4
#define REG_VDMA_SAR5  (EDMA_BA + 0x0504)		// VDMA Transfer Source Address Register CH5
#define REG_VDMA_SAR8  (EDMA_BA + 0x0804)		// VDMA Transfer Source Address Register CH8
#define REG_PDMA_SAR9  (EDMA_BA + 0x0904)		// PDMA Transfer Source Address Register CH9
#define REG_PDMA_SAR10  (EDMA_BA + 0x0A04)		// PDMA Transfer Source Address Register CH10
#define REG_PDMA_SAR11  (EDMA_BA + 0x0B04)		// PDMA Transfer Source Address Register CH11
#define REG_PDMA_SAR12  (EDMA_BA + 0x0C04)		// PDMA Transfer Source Address Register CH12


#define REG_VDMA_DAR  (EDMA_BA + 0x0008)		// VDMA Transfer Destination Address Register CH0
#define REG_PDMA_DAR1  (EDMA_BA + 0x0108)		// PDMA Transfer Destination Address Register CH1
#define REG_PDMA_DAR2  (EDMA_BA + 0x0208)		// PDMA Transfer Destination Address Register CH2
#define REG_PDMA_DAR3  (EDMA_BA + 0x0308)		// PDMA Transfer Destination Address Register CH3
#define REG_PDMA_DAR4  (EDMA_BA + 0x0408)		// PDMA Transfer Destination Address Register CH4
#define REG_VDMA_DAR5  (EDMA_BA + 0x0508)		// VDMA Transfer Destination Address Register CH5
#define REG_VDMA_DAR8  (EDMA_BA + 0x0808)		// VDMA Transfer Destination Address Register CH8
#define REG_PDMA_DAR9  (EDMA_BA + 0x0908)		// PDMA Transfer Destination Address Register CH9
#define REG_PDMA_DAR10  (EDMA_BA + 0x0A08)		// PDMA Transfer Destination Address Register CH10
#define REG_PDMA_DAR11  (EDMA_BA + 0x0B08)		// PDMA Transfer Destination Address Register CH11
#define REG_PDMA_DAR12  (EDMA_BA + 0x0C08)		// PDMA Transfer Destination Address Register CH12


#define REG_VDMA_BCR  (EDMA_BA + 0x000C)		// VDMA Transfer Byte Count Register CH0
#define REG_PDMA_BCR1  (EDMA_BA + 0x010C)		// PDMA Transfer Byte Count Register CH1
#define REG_PDMA_BCR2  (EDMA_BA + 0x020C)		// PDMA Transfer Byte Count Register CH2
#define REG_PDMA_BCR3  (EDMA_BA + 0x030C)		// PDMA Transfer Byte Count Register CH3
#define REG_PDMA_BCR4  (EDMA_BA + 0x040C)		// PDMA Transfer Byte Count Register CH4
#define REG_VDMA_BCR5  (EDMA_BA + 0x050C)		// VDMA Transfer Byte Count Register CH5
#define REG_VDMA_BCR8  (EDMA_BA + 0x080C)		// VDMA Transfer Byte Count Register CH8
#define REG_PDMA_BCR9  (EDMA_BA + 0x090C)		// PDMA Transfer Byte Count Register CH9
#define REG_PDMA_BCR10  (EDMA_BA + 0x0A0C)		// PDMA Transfer Byte Count Register CH10
#define REG_PDMA_BCR11  (EDMA_BA + 0x0B0C)		// PDMA Transfer Byte Count Register CH11
#define REG_PDMA_BCR12  (EDMA_BA + 0x0C0C)		// PDMA Transfer Byte Count Register CH12
	#define WAR_BCR_IF    NVTBIT(23,  0)// PDMA Transfer Byte Count Reigster

#define REG_VDMA_SGAR  (EDMA_BA + 0x0010)		// VDMA Scatter-Gather Table Start Address Register
#define REG_PDMA_SGAR1  (EDMA_BA + 0x0110)		// PDMA Scatter-Gather Table Start Address Register	CH1
#define REG_PDMA_SGAR2  (EDMA_BA + 0x0210)		// PDMA Scatter-Gather Table Start Address Register	CH2
#define REG_PDMA_SGAR3  (EDMA_BA + 0x0310)		// PDMA Scatter-Gather Table Start Address Register	CH3
#define REG_PDMA_SGAR4  (EDMA_BA + 0x0410)		// PDMA Scatter-Gather Table Start Address Register	CH4
#define REG_VDMA_SGAR5  (EDMA_BA + 0x0510)		// VDMA Scatter-Gather Table Start Address Register	CH5
#define REG_VDMA_SGAR8  (EDMA_BA + 0x0810)		// VDMA Scatter-Gather Table Start Address Register	CH8
#define REG_PDMA_SGAR9  (EDMA_BA + 0x0910)		// PDMA Scatter-Gather Table Start Address Register	CH9
#define REG_PDMA_SGAR10  (EDMA_BA + 0x0A10)		// PDMA Scatter-Gather Table Start Address Register	CH10
#define REG_PDMA_SGAR11  (EDMA_BA + 0x0B10)		// PDMA Scatter-Gather Table Start Address Register	CH11
#define REG_PDMA_SGAR12  (EDMA_BA + 0x0C10)		// PDMA Scatter-Gather Table Start Address Register	CH12


