k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_VDMA_CSAR  (EDMA_BA + 0x0014)		// VDMA Current Source Address Register CH0
#define REG_PDMA_CSAR1  (EDMA_BA + 0x0114)		// PDMA Current Source Address Register CH1
#define REG_PDMA_CSAR2  (EDMA_BA + 0x0214)		// PDMA Current Source Address Register CH2
#define REG_PDMA_CSAR3  (EDMA_BA + 0x0314)		// PDMA Current Source Address Register CH3
#define REG_PDMA_CSAR4  (EDMA_BA + 0x0414)		// PDMA Current Source Address Register CH4
#define REG_VDMA_CSAR5  (EDMA_BA + 0x0514)		// VDMA Current Source Address Register CH5
#define REG_VDMA_CSAR8  (EDMA_BA + 0x0814)		// VDMA Current Source Address Register CH8
#define REG_PDMA_CSAR9  (EDMA_BA + 0x0914)		// PDMA Current Source Address Register CH9
#define REG_PDMA_CSAR10  (EDMA_BA + 0x0A14)		// PDMA Current Source Address Register CH10
#define REG_PDMA_CSAR11  (EDMA_BA + 0x0B14)		// PDMA Current Source Address Register CH11
#define REG_PDMA_CSAR12  (EDMA_BA + 0x0C14)		// PDMA Current Source Address Register CH12


#define REG_VDMA_CDAR  (EDMA_BA + 0x0018)		// VDMA Current Destination Address Register CH0
#define REG_PDMA_CDAR1  (EDMA_BA + 0x0118)		// PDMA Current Destination Address Register CH1
#define REG_PDMA_CDAR2  (EDMA_BA + 0x0218)		// PDMA Current Destination Address Register CH2
#define REG_PDMA_CDAR3  (EDMA_BA + 0x0318)		// PDMA Current Destination Address Register CH3
#define REG_PDMA_CDAR4  (EDMA_BA + 0x0418)		// PDMA Current Destination Address Register CH4
#define REG_VDMA_CDAR5  (EDMA_BA + 0x0518)		// VDMA Current Destination Address Register CH5
#define REG_VDMA_CDAR8  (EDMA_BA + 0x0818)		// VDMA Current Destination Address Register CH8
#define REG_PDMA_CDAR9  (EDMA_BA + 0x0918)		// PDMA Current Destination Address Register CH9
#define REG_PDMA_CDAR10  (EDMA_BA + 0x0A18)		// PDMA Current Destination Address Register CH10
#define REG_PDMA_CDAR11  (EDMA_BA + 0x0B18)		// PDMA Current Destination Address Register CH11
#define REG_PDMA_CDAR12  (EDMA_BA + 0x0C18)		// PDMA Current Destination Address Register CH12


#define REG_VDMA_CBCR  (EDMA_BA + 0x001C)		// VDMA Current Byte Counte Register CH0
#define REG_PDMA_CBCR1  (EDMA_BA + 0x011C)		// PDMA Current Byte Counte Register CH1
#define REG_PDMA_CBCR2  (EDMA_BA + 0x021C)		// PDMA Current Byte Counte Register CH2
#define REG_PDMA_CBCR3  (EDMA_BA + 0x031C)		// PDMA Current Byte Counte Register CH3
#define REG_PDMA_CBCR4  (EDMA_BA + 0x041C)		// PDMA Current Byte Counte Register CH4
#define REG_VDMA_CBCR5  (EDMA_BA + 0x051C)		// VDMA Current Byte Counte Register CH5
#define REG_VDMA_CBCR8  (EDMA_BA + 0x081C)		// VDMA Current Byte Counte Register CH8
#define REG_PDMA_CBCR9  (EDMA_BA + 0x091C)		// PDMA Current Byte Counte Register CH9
#define REG_PDMA_CBCR10  (EDMA_BA + 0x0A1C)		// PDMA Current Byte Counte Register CH10
#define REG_PDMA_CBCR11  (EDMA_BA + 0x0B1C)		// PDMA Current Byte Counte Register CH11
#define REG_PDMA_CBCR12  (EDMA_BA + 0x0C1C)		// PDMA Current Byte Counte Register CH12


#define REG_VDMA_IER  (EDMA_BA + 0x0020)		// VDMA Interrupt Enable Control Register CH0
#define REG_PDMA_IER1  (EDMA_BA + 0x0120)		// PDMA Interrupt Enable Control Register CH1
#define REG_PDMA_IER2  (EDMA_BA + 0x0220)		// PDMA Interrupt Enable Control Register CH2
#define REG_PDMA_IER3  (EDMA_BA + 0x0320)		// PDMA Interrupt Enable Control Register CH3
#define REG_PDMA_IER4  (EDMA_BA + 0x0420)		// PDMA Interrupt Enable Control Register CH4
#define REG_VDMA_IER5  (EDMA_BA + 0x0520)		// VDMA Interrupt Enable Control Register CH5
#define REG_VDMA_IER8  (EDMA_BA + 0x0820)		// VDMA Interrupt Enable Control Register CH8
#define REG_PDMA_IER9  (EDMA_BA + 0x0920)		// PDMA Interrupt Enable Control Register CH9
#define REG_PDMA_IER10  (EDMA_BA + 0x0A20)		// PDMA Interrupt Enable Control Register CH10
#define REG_PDMA_IER11  (EDMA_BA + 0x0B20)		// PDMA Interrupt Enable Control Register CH11
#define REG_PDMA_IER12  (EDMA_BA + 0x0C20)		// PDMA Interrupt Enable Control Register CH12
	#define SG_IEN	    BIT3		// PDMA Scatter-Gather Interrupt Enable
	#define WAR_IE	    BIT2		// PDMA Wrap Around Interrupt Enable
	#define BLKD_IE	    BIT1		// PDMA Block Transfer Done Interrupt Enable
	#define EDMATABORT_IE	   BIT0	// PDMA Read/Write Target Abort Interrupt Enable

#define REG_VDMA_ISR  (EDMA_BA + 0x0024)		// VDMA Interrupt Status Register CH0
#define REG_PDMA_ISR1  (EDMA_BA + 0x0124)		// PDMA Interrupt Status Register CH1
#define REG_PDMA_ISR2  (EDMA_BA + 0x0224)		// PDMA Interrupt Status Register CH2
#define REG_PDMA_ISR3  (EDMA_BA + 0x0324)		// PDMA Interrupt Status Register CH3
#define REG_PDMA_ISR4  (EDMA_BA + 0x0424)		// PDMA Interrupt Status Register CH4
#define REG_VDMA_ISR5  (EDMA_BA + 0x0524)		// VDMA Interrupt Status Register CH5
#define REG_VDMA_ISR8  (EDMA_BA + 0x0824)		// VDMA Interrupt Status Register CH8
#define REG_PDMA_ISR9  (EDMA_BA + 0x0924)		// PDMA Interrupt Status Register CH9
#define REG_PDMA_ISR10  (EDMA_BA + 0x0A24)		// PDMA Interrupt Status Register CH10
#define REG_PDMA_ISR11  (EDMA_BA + 0x0B24)		// PDMA Interrupt Status Register CH11
#define REG_PDMA_ISR12  (EDMA_BA + 0x0C24)		// PDMA Interrupt Status Register CH12
	#define INTR  	    BIT31		// Interrupt Pin Status
	#define INTR6 	    BIT30		// Interrupt Pin Status of Channel 6
	#define INTR5 	    BIT29		// Interrupt Pin Status of Channel 5
	#define INTR4 	    BIT28		// Interrupt Pin Status of Channel 4
	#define INTR3 	    BIT27		// Interrupt Pin Status of Channel 3
	#define INTR2 	    BIT26		// Interrupt Pin Status of Channel 2
	#define INTR1 	    BIT25		// Interrupt Pin Status of Channel 1
	#define INTR0 	    BIT24		// Interrupt Pin Status of Channel 0
	#define EDMABUSY	    BIT15		// EDMA Transfer is in Progress
	#define EDMAWAR_BCR_IF NVTBIT(11,  8)// Wrap Around Transfer Byte Count Interrupt Flag
	#define EDMASG_IF	      BIT3		// Scatter-Gather Interrupt Flag
	#define EDMABLKD_IF	  BIT1		// Block Transfer Done Interrupt Flag
	#define EDMATABORT_IF	  BIT0		// PDMA Read/Write Target Abort Interrupt Flag


#define REG_VDMA_CTCSR  (EDMA_BA + 0x0028)		// VDMA Color Transfer Control Register CH0
#define REG_VDMA_CTCSR5  (EDMA_BA + 0x0528)		// VDMA Color Transfer Control Register CH5
#define REG_VDMA_CTCSR8  (EDMA_BA + 0x0828)		// VDMA Color Transfer Control Register CH8
	#define SOUR_FORMAT NVTBIT(27, 24)   // Source Address Color Format
	#define DEST_FORMAT NVTBIT(19, 16)   // Destination Address Color Format
	#define CLAMPING_EN	  BIT7		// Clamping Enable
	#define COL_TRA_EN	  BIT1		// Color Transfer Enable
	#define STRIDE_EN 	  BIT0		// Stride Mode Enable

#define REG_VDMA_SASOCR  (EDMA_BA + 0x002C)	// VDMA Source Address Stride Offset Control Register CH0
#define REG_VDMA_SASOCR5  (EDMA_BA + 0x052C)	// VDMA Source Address Stride Offset Control Register CH5
#define REG_VDMA_SASOCR8  (EDMA_BA + 0x082C)	// VDMA Source Address Stride Offset Control Register CH8
	#define STBC          NVTBIT(31, 16)// PDMA Stride Transfer Byte Count
	#define SASTOBL       NVTBIT(15,  0)// PDMA Source Address Stride Offset Byte Length

#define REG_VDMA_DASOCR  (EDMA_BA + 0x0030)	// VDMA Destination Address Stride Offset Control Register CH0
#define REG_VDMA_DASOCR5  (EDMA_BA + 0x0530)	// VDMA Destination Address Stride Offset Control Register CH5
#define REG_VDMA_DASOCR8  (EDMA_BA + 0x0830)	// VDMA Destination Address Stride Offset Control Register CH8
	#define DASTOBL       NVTBIT(15,  0)// VDMA Destination Address Stride Offset Byte Length

#define REG_PDMA_POINT1  (EDMA_BA + 0x013C)	// PDMA Internal Buffer Pointer Register CH1
#define REG_PDMA_POINT2  (EDMA_BA + 0x023C)	// PDMA Internal Buffer Pointer Register CH2
#define REG_PDMA_POINT3  (EDMA_BA + 0x033C)	// PDMA Internal Buffer Pointer Register CH3
#define REG_PDMA_POINT4  (EDMA_BA + 0x043C)	// PDMA Internal Buffer Pointer Register CH4
#define REG_PDMA_POINT9  (EDMA_BA + 0x093C)	// PDMA Internal Buffer Pointer Register CH9
#define REG_PDMA_POINT10  (EDMA_BA + 0x0A3C)	// PDMA Internal Buffer Pointer Register CH10
#define REG_PDMA_POINT11  (EDMA_BA + 0x0B3C)	// PDMA Internal Buffer Pointer Register CH11
#define REG_PDMA_POINT12  (EDMA_BA + 0x0C3C)	// PDMA Internal Buffer Pointer Register CH12
	#define PDMA_POINT    NVTBIT(4,  0) // PDMA Internal Buffer Pointer Reigster

#define REG_EDMA_SBUF0_C0  (EDMA_BA + 0x0080)	// VDMA Shared Buffer FIFO 0 Reigster CH0
#define REG_EDMA_SBUF0_C1  (EDMA_BA + 0x0180)	// PDMA Shared Buffer FIFO 0 Reigster CH1
#define REG_EDMA_SBUF0_C2  (EDMA_BA + 0x0280)	// PDMA Shared Buffer FIFO 0 Reigster CH2
#define REG_EDMA_SBUF0_C3  (EDMA_BA + 0x0380)	// PDMA Shared Buffer FIFO 0 Reigster CH3
#define REG_EDMA_SBUF0_C4  (EDMA_BA + 0x0480)	// PDMA Shared Buffer FIFO 0 Reigster CH4
#define REG_EDMA_SBUF0_C5  (EDMA_BA + 0x0580)	// VDMA Shared Buffer FIFO 0 Reigster CH5

#define REG_EDMA_SBUF1_C0  (EDMA_BA + 0x0084)	// VDMA Shared Buffer FIFO 1 Reigster CH0
#define REG_EDMA_SBUF1_C1  (EDMA_BA + 0x0184)	// PDMA Shared Buffer FIFO 1 Reigster CH1
#define REG_EDMA_SBUF1_C2  (EDMA_BA + 0x0284)	// PDMA Shared Buffer FIFO 1 Reigster CH2
#define REG_EDMA_SBUF1_C3  (EDMA_BA + 0x0384)	// PDMA Shared Buffer FIFO 1 Reigster CH3
#define REG_EDMA_SBUF1_C4  (EDMA_BA + 0x0484)	// PDMA Shared Buffer FIFO 1 Reigster CH4
#define REG_EDMA_SBUF1_C5  (EDMA_BA + 0x0584)	// VDMA Shared Buffer FIFO 1 Reigster CH5

#define REG_EDMA_SBUF2_C0  (EDMA_BA + 0x0088)	// VDMA Shared Buffer FIFO 2 Reigster CH0
#define REG_EDMA_SBUF2_C1  (EDMA_BA + 0x0188)	// PDMA Shared Buffer FIFO 2 Reigster CH1
#define REG_EDMA_SBUF2_C2  (EDMA_BA + 0x0288)	// PDMA Shared Buffer FIFO 2 Reigster CH2
#define REG_EDMA_SBUF2_C3  (EDMA_BA + 0x0388)	// PDMA Shared Buffer FIFO 2 Reigster CH3
#define REG_EDMA_SBUF2_C4  (EDMA_BA + 0x0488)	// PDMA Shared Buffer FIFO 2 Reigster CH4
#define REG_EDMA_SBUF2_C5  (EDMA_BA + 0x0588)	// VDMA Shared Buffer FIFO 2 Reigster CH5

#define REG_EDMA_SBUF3_C0  (EDMA_BA + 0x008C)	// VDMA Shared Buffer FIFO 3 Reigster CH0
#define REG_EDMA_SBUF3_C1  (EDMA_BA + 0x018C)	// PDMA Shared Buffer FIFO 3 Reigster CH1
#define REG_EDMA_SBUF3_C2  (EDMA_BA + 0x028C)	// PDMA Shared Buffer FIFO 3 Reigster CH2
#define REG_EDMA_SBUF3_C3  (EDMA_BA + 0x038C)	// PDMA Shared Buffer FIFO 3 Reigster CH3
#define REG_EDMA_SBUF3_C4  (EDMA_BA + 0x048C)	// PDMA Shared Buffer FIFO 3 Reigster CH4
#define REG_EDMA_SBUF3_C5  (EDMA_BA + 0x058C)	// VDMA Shared Buffer FIFO 3 Reigster CH5

#define REG_EDMA_SBUF4_C0  (EDMA_BA + 0x0090)	// VDMA Shared Buffer FIFO 4 Reigster CH0
#define REG_EDMA_SBUF4_C2  (EDMA_BA + 0x0290)	// PDMA Shared Buffer FIFO 4 Reigster CH2
#define REG_EDMA_SBUF4_C3  (EDMA_BA + 0x0390)	// PDMA Shared Buffer FIFO 4 Reigster CH3
#define REG_EDMA_SBUF4_C5  (EDMA_BA + 0x0590)	// VDMA Shared Buffer FIFO 4 Reigster CH5

