k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_EDMA_SBUF5_C0  (EDMA_BA + 0x0094)	// VDMA Shared Buffer FIFO 5 Reigster CH0
#define REG_EDMA_SBUF5_C2  (EDMA_BA + 0x0294)	// PDMA Shared Buffer FIFO 5 Reigster CH2
#define REG_EDMA_SBUF5_C3  (EDMA_BA + 0x0394)	// PDMA Shared Buffer FIFO 5 Reigster CH3
#define REG_EDMA_SBUF5_C5  (EDMA_BA + 0x0594)	// VDMA Shared Buffer FIFO 5 Reigster CH5

#define REG_EDMA_SBUF6_C0  (EDMA_BA + 0x0098)	// VDMA Shared Buffer FIFO 6 Reigster CH0
#define REG_EDMA_SBUF6_C2  (EDMA_BA + 0x0298)	// PDMA Shared Buffer FIFO 6 Reigster CH2
#define REG_EDMA_SBUF6_C3  (EDMA_BA + 0x0398)	// PDMA Shared Buffer FIFO 6 Reigster CH3
#define REG_EDMA_SBUF6_C5  (EDMA_BA + 0x0598)	// VDMA Shared Buffer FIFO 6 Reigster CH5

#define REG_EDMA_SBUF7_C0  (EDMA_BA + 0x009C)	// VDMA Shared Buffer FIFO 7 Reigster CH0
#define REG_EDMA_SBUF7_C2  (EDMA_BA + 0x029C)	// PDMA Shared Buffer FIFO 7 Reigster CH2
#define REG_EDMA_SBUF7_C3  (EDMA_BA + 0x039C)	// PDMA Shared Buffer FIFO 7 Reigster CH3
#define REG_EDMA_SBUF7_C5  (EDMA_BA + 0x059C)	// VDMA Shared Buffer FIFO 7 Reigster CH5

#define REG_EDMA_SBUF8_C0  (EDMA_BA + 0x00A0)	// VDMA Shared Buffer FIFO 8 Reigster CH0
#define REG_EDMA_SBUF8_C5  (EDMA_BA + 0x05A0)	// VDMA Shared Buffer FIFO 8 Reigster CH5

#define REG_EDMA_SBUF9_C0  (EDMA_BA + 0x00A4)	// VDMA Shared Buffer FIFO 9 Reigster CH0
#define REG_EDMA_SBUF9_C5  (EDMA_BA + 0x05A4)	// VDMA Shared Buffer FIFO 9 Reigster CH5

#define REG_EDMA_SBUF10_C0  (EDMA_BA + 0x00A8)	// VDMA Shared Buffer FIFO 10 Reigster CH0
#define REG_EDMA_SBUF10_C5  (EDMA_BA + 0x05A8)	// VDMA Shared Buffer FIFO 10 Reigster CH5

#define REG_EDMA_SBUF11_C0  (EDMA_BA + 0x00AC)	// VDMA Shared Buffer FIFO 11 Reigster CH0
#define REG_EDMA_SBUF11_C5  (EDMA_BA + 0x05AC)	// VDMA Shared Buffer FIFO 11 Reigster CH5

#define REG_EDMA_SBUF12_C0  (EDMA_BA + 0x00B0)	// VDMA Shared Buffer FIFO 12 Reigster CH0
#define REG_EDMA_SBUF12_C5  (EDMA_BA + 0x05B0)	// VDMA Shared Buffer FIFO 12 Reigster CH5

#define REG_EDMA_SBUF13_C0  (EDMA_BA + 0x00B4)	// VDMA Shared Buffer FIFO 13 Reigster CH0
#define REG_EDMA_SBUF13_C5  (EDMA_BA + 0x05B4)	// VDMA Shared Buffer FIFO 13 Reigster CH5

#define REG_EDMA_SBUF14_C0  (EDMA_BA + 0x00B8)	// VDMA Shared Buffer FIFO 14 Reigster CH0
#define REG_EDMA_SBUF14_C5  (EDMA_BA + 0x05B8)	// VDMA Shared Buffer FIFO 14 Reigster CH5

#define REG_EDMA_SBUF15_C0  (EDMA_BA + 0x00BC)	// VDMA Shared Buffer FIFO 15 Reigster CH0
#define REG_EDMA_SBUF15_C5  (EDMA_BA + 0x05BC)	// VDMA Shared Buffer FIFO 15 Reigster CH5

//#define GE_BA	(w55fa92_GE)
#define REG_2D_GETRIG		(GE_BA+0x0000)	//R/W   GE Trigger Control
        #define CMD_QUEUE   BIT1                    // 2D Command Queue Enable
        #define GE_GO       BIT0                    // 2D Engine Trigger

#define REG_2D_GEXYSOA      (GE_BA+0x0004)  //R/W   GE Source Origin Address

#define REG_2D_TILEXY       (GE_BA+0x0008)  //R/W   GE TileBLT Width / Height
        #define TILE_Y      NVTBIT(15, 8)           // Tile Height
        #define TILE_X      NVTBIT(7, 0)            // Tile Width

#define REG_2D_GERRXY       (GE_BA+0x000C)  //R/W   GE Rotate Refernce Point
#define REG_2D_GEXYD2A      (GE_BA+0x000C)  //R/W   GE Secondary Destination Origin Address
#define REG_2D_SLLACQ       (GE_BA+0x000C)  //R/W   GE The Start Link List Address of Command Queue

#define REG_2D_GEINTS       (GE_BA+0x0010)  //R/W   GE Interrupt Status

#define REG_2D_GEPLS        (GE_BA+0x0014)  //R/W   GE Pattern Location Starting Address

#define REG_2D_GEBER        (GE_BA+0x0018)  //R/W   GE Bresenham Error Term Stepping Constant
#define REG_2D_VSF          (GE_BA+0x0018)  //R/W   GE Vertical Scaling Control
#define REG_2D_GEBIR        (GE_BA+0x001C)  //R/W   GE Bresenham Initial Error, Pixel Count Major M
#define REG_2D_HSF          (GE_BA+0x001C)  //R/W   GE Horizontal Scaling Control

#define REG_2D_GECMD        (GE_BA+0x0020)  //R/W   GE Command Control

#define REG_2D_GEBC         (GE_BA+0x0024)  //R/W   GE Background Color
#define REG_2D_GEFC         (GE_BA+0x0028)  //R/W   GE Foreground Color
#define REG_2D_GETC         (GE_BA+0x002C)  //R/W   GE Transparency Color
#define REG_2D_GETCM        (GE_BA+0x0030)  //R/W   GE Transparency Color Mask

#define REG_2D_GEXYDOA      (GE_BA+0x0034)  //R/W   GE Destination/Display Origin Address
#define REG_2D_GESDP        (GE_BA+0x0038)  //R/W   GE Source/Destination Pitch
#define REG_2D_GESSXYL      (GE_BA+0x003C)  //R/W   GE Source Start XY/Linear Address
#define REG_2D_GEDSXYL      (GE_BA+0x0040)  //R/W   GE Destination Start XY/Linear Address
#define REG_2D_GEDIXYL      (GE_BA+0x0044)  //R/W   GE Dimension XY/Linear
#define REG_2D_GECBTL       (GE_BA+0x0048)  //R/W   GE Clipping Window Top/Left Boundary
#define REG_2D_GECBBR       (GE_BA+0x004C)  //R/W   GE Clipping Window Bottom/Right Boundary

#define REG_2D_GEPTNA       (GE_BA+0x0050)  //R/W   GE Pattern A
#define REG_2D_GEPTNB       (GE_BA+0x0054)  //R/W   GE Pattern B

#define REG_2D_GEWPM        (GE_BA+0x0058)  //R/W   GE Write Plane Mask

#define REG_2D_GEMC         (GE_BA+0x005C)  //R/W   GE MISC Control

#define REG_2D_GEHBDW0      (GE_BA+0x0060)  //R/W   GE HostBLT Data Port 0~7
#define REG_2D_GEHBDW1      (GE_BA+0x0064)
#define REG_2D_GEHBDW2      (GE_BA+0x0068)
#define REG_2D_GEHBDW3      (GE_BA+0x006C)
#define REG_2D_GEHBDW4      (GE_BA+0x0070)
#define REG_2D_GEHBDW5      (GE_BA+0x0074)
#define REG_2D_GEHBDW6      (GE_BA+0x0078)
#define REG_2D_GEHBDW7      (GE_BA+0x007C)


//#define VPE_BA	(w55fa92_VPE)
#define REG_VPE_TG		(VPE_BA + 0x00)		//R/W	Video Process Engine (VPE) Trigger Control Register
		#define VPE_GO		BIT0					//Trigger Video Process Engine Operation

#define REG_VPE_PLYA_PK	(VPE_BA + 0x04)		//R/W	VPE Source Planar Y or Packet YUV Start Address
#define REG_VPE_PLUA	(VPE_BA + 0x08)		//R/W	VPE Source Planar U Start Address
#define REG_VPE_PLVA	(VPE_BA + 0x0C)		//R/W	VPE Source Planar V Start Address

#define REG_VPE_INTS	(VPE_BA + 0x10)		//R/W	VPE Interrupt Status Register
		#define TA_INTS		BIT5					//VPE DMA Target Abort or Data Abort Interrupt Status
		#define DE_INTS		BIT4					//Decoder Block Sequence Error Interrupt Status
		#define MB_INTS		BIT3					//Decoder MCU/Macro Block Detection Interrupt Status
		#define PG_MISS		BIT2					//VPE MMU Page Miss Interrupt Status
		#define PF_INTS		BIT1					//VPE MMU Page Fault Interrupt Status
		#define VP_INTS		BIT0					//VPE Completion Interrupt Status

#define REG_VPE_SLORO	(VPE_BA + 0x14)		//R/W	Source Packet / Planar Y Left Line Offset and Right Line Offset (pixel unit)
		#define SRCLLO		NVTBIT(28, 16)			//13-bit Source Packet/Planar Y Left Line Offset
		#define SRCRLO		NVTBIT(12, 0)			//13-bit Source Packet/Planar Y right Line Offset

#define REG_VPE_VYDSF	(VPE_BA + 0x18)		//R/W	Vertical Divider for DDA Scaling Up/Down
		#define VSF_N		NVTBIT(28, 16)			//13-bit Vertical N Scaling Factor
		#define VSF_M		NVTBIT(12, 0)			//13-bit Vertical M Scaling Factor
#define REG_VPE_HXDSF	(VPE_BA + 0x1C)		//R/W	Horizontal Divider for DDA Scaling Up/Down
		#define HSF_N		NVTBIT(28, 16)			//13-bit Horizontal N Scaling Factor
		#define HSF_M		NVTBIT(12, 0)			//13-bit Horizontal M Scaling Factor

