k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_VPE_CMD		(VPE_BA + 0x20)		//R/W	VPE Command Control Register
		#define CCIR601		BIT31					//Source YUV Level Range
		#define SORC		NVTBIT(30, 28)			//Source YUV/RGB Formats (Read Only)
		#define LEVEL		BIT27					//DEST packet YUV level adjustment to the CCIR601 range
		#define TRACE		BIT26					//Trace the Internal Hardware States (For debugging purpose)
		#define DEST		NVTBIT(25, 24)			//Destination YUV/RGB Formats
		#define BLOCK_SEQ	NVTBIT(23, 20)			//Block type if on the fly
		#define OPCMD		NVTBIT(19, 16)			//Operate Command of Rotate Direction or 3X3 Average Filter
		#define MTLB_SET	NVTBIT(15, 14)			//Micro TLB dump to VPE MMU CR's 80~FF. (For debugging purpose)
		#define Y_ROUND		BIT13					//Y-axis Round Control. (For debugging purpose)
		#define X_ROUND		BIT12					//X-axis Round Control. (For debugging purpose)
		#define SINGLE		BIT11					//VPE Write Buffer Mode
		#define CROP		BIT10					//VPE Cropping function for on the fly.
		#define BYPASS		BIT9					//3X3 Filter On=0/Off=1, 1=bypass
		#define TAP			BIT8					//3X3 Average Filter Tap Coefficients
		#define BILINEAR	BIT7					//VPE Bilinear Up/Down-Scaling Filter Function On/Off
		#define BUSRT		BIT6					//AHB Write Burst Length for Bilinear Filter to Fetch More Pixels
		#define HOST_SEL	NVTBIT(5, 4)			//Host Select (C&M Video Decoder, JPEG Decoder, or 2D)
		#define MB_EN		BIT3					//Macro Block Detection Interrupt Enable for video decoder
		#define PMS_EN		BIT2					//Enable VPE Scatter Gather DMA Operation
		#define PFT_EN		BIT1					//Interrupt enable for VPE Scatter Gather DMA operations.
		#define VPE_INT_EN	BIT0					//Interrupt enable for VPE operations.

#define REG_VPE_DEST_PK	(VPE_BA + 0x24)		//R/W	Data Format Conversion Packet Destination Start Address

#define REG_VPE_DLORO	(VPE_BA + 0x28)		//R/W 	Destination Packet Left Line Offset and Right Line Offset (pixel unit)
		#define DSTLLO		NVTBIT(28, 16)			//13-bit Source Packet Left Line Offset
		#define DSTRLO		NVTBIT(12, 0)			//13-bit Source Packet right Line Offset

#define REG_VPE_RESET	(VPE_BA + 0x34)		//R/W	VPE Reset Control Register
		#define RST_FIFO	BIT1					//RESET VPE FIFO Control
		#define RESET_VPE	BIT0					//RESET VPE Operation

#define REG_VMMU_CR		(VPE_BA + 0x80)		//R/W	 VPE MMU Control Register
		#define MAIN_TLB	BIT4					//VPE MMU Main TLB Service Channels
		#define MAIN_EN		BIT1					//Turn on/off main TLB SRAM Buffer
		#define MMU_EN		BIT0					//Enable or Disable VPE MMU Virtual Address Translation

#define REG_VMMU_TTB	(VPE_BA + 0x84)		//R/W	 VPE MMU Translation Table Base Register
		#define TTB_ADDR	NVTBIT(31, 0)			//32-bit Translation Table Base Address
#define REG_VMMU_PFTVA	(VPE_BA + 0x88)		//R/W	 VPE MMU Page Fault Virtual Address Register
		#define PFTVA		NVTBIT(31, 0)			//32-bit Page Fault Virtual Address
#define REG_VMMU_CMD	(VPE_BA + 0x8C)		//R/W	 VPE MMU Page Fault Interrupt Status Register
		#define MTLB_FAIL	BIT17					//Flush VPE MMU Main TLB Entries Pass/Fail Status (Read Only)
		#define MTLB_FINISH	BIT16					//Flush VPE MMU Main TLB Entries Finish/Busy Status (Read Only)
		#define VPE_FLUSH	BIT2					//Flush VPE MMU Main TLB Entries of Main TLB SRAM
		#define INVALID		BIT1					//Invalidate VPE MMU Micro TLB Entries
		#define RESUME		BIT0					//Resume VPE MMU Transaction

#define REG_VMMU_L1PT0	(VPE_BA + 0x90)		//R/W	 VPE MMU Level-One Page Table Entry 0 descriptor
		#define L1PT0			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 0
#define REG_VMMU_L1PT1	(VPE_BA + 0x94)		//R/W	 VPE MMU Level-One Page Table Entry 1 descriptor
		#define L1PT1			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 1
#define REG_VMMU_L1PT2	(VPE_BA + 0x98)		//R/W	 VPE MMU Level-One Page Table Entry 2 descriptor
		#define L1PT2			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 2
#define REG_VMMU_L1PT3	(VPE_BA + 0x9C)		//R/W	 VPE MMU Level-One Page Table Entry 3 descriptor
		#define L1PT3			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 3
#define REG_VMMU_L1PT4	(VPE_BA + 0xA0)		//R/W	 VPE MMU Level-One Page Table Entry 0 descriptor
		#define L1PT4			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 0
#define REG_VMMU_L1PT5	(VPE_BA + 0xA4)		//R/W	 VPE MMU Level-One Page Table Entry 1 descriptor
		#define L1PT5			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 1
#define REG_VMMU_L1PT6	(VPE_BA + 0xA8)		//R/W	 VPE MMU Level-One Page Table Entry 2 descriptor
		#define L1PT6			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 2
#define REG_VMMU_L1PT7	(VPE_BA + 0xAC)		//R/W	 VPE MMU Level-One Page Table Entry 3 descriptor
		#define L1PT7			NVTBIT(31, 0)		//32-bit Descriptor Information for Level-One Page Table Entry 3


#define REG_VMMU_CVA	(VPE_BA + 0xB0)		//R	 	VPE MMU Current Virtual Address Register
		#define CVA				NVTBIT(31, 0)		//32-bit Current Virtual Address
#define REG_VMMU_CVPN	(VPE_BA + 0xB4)		//R	 	VPE MMU Current Virtual Page Number Register
		#define CVPN			NVTBIT(31, 0)		//Current Virtual Page Number

#define REG_VMMU_CPA	(VPE_BA + 0xB8)		//R	 	VPE MMU Current Physical Address Register
		#define CPA				NVTBIT(31, 0)			//Current Physical Address
#define REG_VMMU_CPPN	(VPE_BA + 0xBC)		//R	 	VPE MMU Current Physical Page Number Register
		#define CPPN			NVTBIT(31, 0)		//Current Physical Page Number

// Define registers for BLT
#define REG_SET2DA    	(BLT_BA+0x0000)	// BitBlitting Accelerator Enable Set Up Register
	#define	FILL_OP		BIT11					// Fill operation to rectangle
	#define FILL_STYLE	NVTBIT(10,8)			// Bitmap Fill Style
	#define TRCOLOR_E	BIT7					// RGB565 Transparent Color Enable
	#define TRANS_FLAG	NVTBIT(6,4)				// Transform Flag
	#define S_ALPHA		BIT3					// Reveal Source Image Alpha during Transparency
	#define FILL_BLEND	BIT2					// Alpha blending for Fill operation
	#define L_ENDIAN	BIT1					// Palette Format Data Order
	#define BLIT_EN		BIT0					// Blit a bitmap to the frame buffer using the hardware accelerator
#define	REG_SFMT		(BLT_BA+0x0004)	// Pixel Format of Source Bitmap Register
	#define S_RGB_bpp8	BIT5					// Bitmap Pixel Format bpp8_clutRGB
	#define S_RGB_bpp4	BIT4					// Bitmap Pixel Format bpp4_clutRGB
	#define S_RGB_bpp2	BIT3					// Bitmap Pixel Format bpp2_clutRGB
	#define S_RGB_bpp1	BIT2					// Bitmap Pixel Format bpp1_clutRGB
	#define S_RGB565	BIT1					// Bitmap Pixel Format bpp16_RGB565
	#define S_ARGB8888	BIT0					// Bitmap Pixel Format bpp32_ARGB8888
#define REG_DFMT		(BLT_BA+0x0008)	// Pixel Format of Destination Bitmap Register
	#define D_RGB555	BIT2					// Display format RGB555 16 bit format
	#define D_RGB565	BIT1					// Display format RGB565 16 bit format
	#define D_ARGB8888	BIT0					// Display format ARGB8888 32 bit format
#define REG_BLTINTCR	(BLT_BA+0x000C)	// BLT Interrupt Control and Status Register

