k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
	#define BLT_PMS_INTS	BIT5					// BLT MMU Page Miss Interrupt Status
	#define BLT_PFT_INTS	BIT4					// BLT MMU Page Fault Interrupt Status
	#define BLT_TABORT		BIT3					// Target/Data Abort Error Status

	#define BLT_ERR			BIT2					// Blitting Error Status
	#define BLT_INTE		BIT1					// Blitting Complete Interrupt Enable
	#define BLT_INTS		BIT0					// Blitting Complete Interrupt Status
#define REG_MLTA		(BLT_BA+0x0010)	// Alpha Multiplier Register
	#define OFFSET_A	NVTBIT(31,16)			// Fixed point 8.8 A Color Offset Value
	#define MULTIPLIER_A	NVTBIT(15,0)		// Fixed point 8.8 A Color Multiplier Value
#define REG_MLTR		(BLT_BA+0x0014)	// Red Multiplier Register
	#define OFFSET_R	NVTBIT(31,16)			// Fixed point 8.8 R Color Offset Value
	#define MULTIPLIER_R	NVTBIT(15, 0)		// Fixed point 8.8 R Color Multiplier Value
#define REG_MLTG		(BLT_BA+0x0018)	// Green Multiplier Register
	#define OFFSET_G	NVTBIT(31,16)			// Fixed point 8.8 G Color Offset Value
	#define MULTIPLIER_G	NVTBIT(15,0)		// Fixed point 8.8 G Color Multiplier Value
#define REG_MLTB      	(BLT_BA+0x001C)	// Blue Multiplier Register
	#define OFFSET_B	NVTBIT(31,16)			// Fixed point 8.8 B Color Offset Value
	#define MULTIPLIER_B	NVTBIT(15, 0)		// Fixed point 8.8 B Color Multiplier Value
#define REG_SWIDTH		(BLT_BA+0x0020)	// Width of Source Register
	#define WIDTH_S		NVTBIT(15,0)			// The width of source Register
#define REG_SHEIGHT		(BLT_BA+0x0024)	// Height of Source Register
	#define HEIGHT_S	NVTBIT(15,0)			// The Height of source Register
#define REG_DWIDTH		(BLT_BA+0x0028)	// Width of Destination Register
	#define WIDTH_D		NVTBIT(15,0)			// The width of Destination Register
#define REG_DHEIGHT		(BLT_BA+0x002C)	// Height of Destination Register
	#define HEIGHT_D	NVTBIT(15,0)			// The Height of Destination Register
#define REG_ELEMENTA	(BLT_BA+0x0030)	// Transform Element A Register
#define REG_ELEMENTB	(BLT_BA+0x0034)	// Transform Element B Register
#define REG_ELEMENTC	(BLT_BA+0x0038)	// Transform Element C Register
#define REG_ELEMENTD	(BLT_BA+0x003C)	// Transform Element D Register
#define REG_SADDR		(BLT_BA+0x0040)	// Source Remap Start Address Register
#define REG_DADDR		(BLT_BA+0x0044)	// Frame Buffer Address Register
#define REG_SSTRIDE		(BLT_BA+0x0048)	// Source Stride Register
	#define STRIDE_S	NVTBIT(15,0)			// The Source Stride
#define REG_DSTRIDE		(BLT_BA+0x004C)	// Destination Stride Register
	#define STRIDE_D	NVTBIT(15,0)			// The Destination Stride
#define REG_OFFSETSX	(BLT_BA+0x0050)	// Offset of Source X Register
#define REG_OFFSETSY	(BLT_BA+0x0054)	// Offset of Source Y Register
#define REG_TRCOLOR		(BLT_BA+0x0058)	// RGB565 Transparent Color Register
	#define TR_RGB565	NVTBIT(15,0)			// RGB565 Transparent Color
#define REG_FILLARGB	(BLT_BA+0x0060)	// ARGB Color Values for Fill Operation Register
#define REG_PALETTE		(BLT_BA+0x0400)	// Color Palette Register

// Define registers for BLT MMU
#define	REG_BMMU_CR		(BLT_BA+0x080)		// BLT MMU Control Register
	#define BLT_MMU_RST	BIT16				//
	#define BLT_PMS_EN	BIT9				// BLT MMU Page Miss Interrupt Enable
	#define BLT_PFT_EN	BIT8				// BLT MMU Page Fault Interrupt Enable
	#define MAIN_TLB	BIT4				// BLT MMU Main TLB Service Channels
	#define MAIN_EN		BIT1				// Turn On/Off BLT MMU Main TLB (SRAM Buffers)
	#define MMU_EN		BIT0				// Enable or Disable BLT MMU Virtual Address Translation
#define	REG_BMMU_TTB	(BLT_BA+0x084)		// BLT MMU Translation Table Base Register
#define	REG_BMMU_PFTVA	(BLT_BA+0x088)		// BLT MMU Page Fault Virtual Address Reg.
#define	REG_BMMU_CMD	(BLT_BA+0x08C)		// BLT MMU Resume and Invalidate Command
	#define MTLB_FAIL	BIT17					// Flush BLT MMU Main TLB Entries Pass/Fail Status
	#define MTLB_FINISH	BIT16					// Flush BLT MMU Main TLB Entries Finish/Busy Status
	#define FLUSH_MAIN_TLB		BIT2			// Flush BLT MMU Main TLB Entries of Main TLB SRAM
	#define	INVALID_MICRO_TLB	BIT1			// Invalidate BLT MMU Micro TLB Entries
	#define RESUME_BLT_MMU		BIT0			// Resume BLT MMU Transaction
#define	REG_BMMU_L1PT0	(BLT_BA+0x090)		// TLB Level-One Page Table Entry 0 Descriptor
#define	REG_BMMU_L1PT1	(BLT_BA+0x094)		// TLB Level-One Page Table Entry 1 Descriptor
#define	REG_BMMU_L1PT2	(BLT_BA+0x098)		// TLB Level-One Page Table Entry 2 Descriptor
#define	REG_BMMU_L1PT3	(BLT_BA+0x09C)		// TLB Level-One Page Table Entry 3 Descriptor
#define	REG_BMMU_L1PT4	(BLT_BA+0x0A0)		// TLB Level-One Page Table Entry 4 Descriptor
#define	REG_BMMU_L1PT5	(BLT_BA+0x0A4)		// TLB Level-One Page Table Entry 5 Descriptor
#define	REG_BMMU_L1PT6	(BLT_BA+0x0A8)		// TLB Level-One Page Table Entry 6 Descriptor
#define	REG_BMMU_L1PT7	(BLT_BA+0x0AC)		// TLB Level-One Page Table Entry 7 Descriptor
#define	REG_BMMU_CVA	(BLT_BA+0x0B0)		// MMU Current Virtual Address Register
#define	REG_BMMU_CVPN	(BLT_BA+0x0B4)		// MMU Current Virtual Page Number Register
#define	REG_BMMU_CPA	(BLT_BA+0x0B8)		// MMU Current Physical Address Register
#define	REG_BMMU_CPPN	(BLT_BA+0x0BC)		// MMU Current Physical Page Number register


//#define AR_BA	(w55fa92_AR)
#define REG_AR_CON		(AR_BA+0x0000)	// R/W	Audio Record control register
		#define AR_RST			BIT31
		#define TCONFIG			BIT30			// R/W	Sigma-Delta ADC Test Mode Enable
		#define TSLAVE				BIT29			// R/W	Sigma-Delta ADC Test Mode I2S Interface
		#define TPLLBY				BIT28			// R/W	Sigma-Delta ADC Test Mode PLL Bypass
		#define AR_EDMA			BIT4				// R/W	EDMA Mode Enable
		#define INT_MOD 			NVTBIT(3,2)		// R/W	ADC block enable bit (24 bits ADC)
		#define AR_INT_EN			BIT1				// R/W	Interrupt Mask
		#define AR_INT				BIT0				// R/W	Interrupt Status

#define REG_AR_AGC1		(AR_BA+0x004)	// R/W: 	Audio Record AGC control register
		#define AGC_EN			BIT31			// Auto gain control enable bit
		#define GSTEP				BIT28			// Gain Change Step
		#define OTL				NVTBIT(27, 24)		// Output Target Level
		#define MAXGAIN			NVTBIT(23, 20)		// AGC MAXGAIN Control Register
		#define MINGAIN			NVTBIT(19, 16)		// AGC MINGAIN Control Register
		#define RECOVERY			NVTBIT(11, 0)		// Recovery time

#define REG_AR_AGC2		(AR_BA+0x008)	// R/W: 	Audio Record AGC control register
		#define ATTACK			NVTBIT(27, 16)		// Attack time
		#define HOLD				NVTBIT(11, 0)		// Hold time

