k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_AR_NG			(AR_BA+0x00C)	// R/W: 	Audio Record AGC control register
		#define NG_EN				BIT31			// Noise Gate Enable
		#define DLYTIME			NVTBIT(27, 24)		// Delay Time
		#define IN_NG_TIME			NVTBIT(23, 20)		// Enter NG Function Time
		#define OUT_NG_TIME		NVTBIT(19, 16)		// AGC MAXGAIN Control Register
		#define NG_GAIN			NVTBIT(11, 8)		// AGC MINGAIN Control Register
		#define NG_LEVEL			NVTBIT(4, 0)		// Attack time

#define REG_AUD_DATA1 		(AR_BA+0x0010)	// R/W: Audio data register 1
#define REG_AUD_DATA2		(AR_BA+0x0014)	// R/W: Audio data register 2
#define REG_AUD_DATA3		(AR_BA+0x0018)	// R/W: Audio data register 3
#define REG_AUD_DATA4		(AR_BA+0x001C)	// R/W: Audio data register 4
#define REG_AUD_DATA5 		(AR_BA+0x0020)	// R/W: Audio data register 5
#define REG_AUD_DATA6		(AR_BA+0x0024)	// R/W: Audio data register 6
#define REG_AUD_DATA7		(AR_BA+0x0028)	// R/W: Audio data register 7
#define REG_AUD_DATA8		(AR_BA+0x002C)	// R/W: Audio data register 8
		#define AUDIO_DATA1		NVTBIT(31, 16)		// Converted audio dat 1 in bufferx
		#define AUDIO_DATA0		NVTBIT(15, 0)		// Converted audio dat 0 in bufferx

#define REG_SDADC_CTL		(AR_BA+0x0030)	// R/W: Sigma-Delta ADC control register
		#define AR_BUSY			BIT31			// I2C Command State
		#define SCK_DIV			NVTBIT(30, 24)		// SCK Timing Divider
		#define AR_DEVICE_ID		NVTBIT(23, 17)		// SCK Timing Divider
		#define AR_RW				BIT16			// Command is Read from ADC or Write to ADC
		#define AR_ADDR			NVTBIT(15, 8)		// Sigma-Delta ADC I2C Address Information
		#define AR_DATA			NVTBIT(7, 0)		// Sigma-Delta ADC I2C Data Information

#define REG_SDADC_AGBIT		(AR_BA+0x0034)	// R/W: Sigma-Delta Auto Gain Temp Bits register
		#define AGBIT_L			NVTBIT(7, 4)		// Sigma-Delta ADC Auto Gain Temp Bits for Left Channel
		#define AGBIT_R			NVTBIT(3, 0)		// Sigma-Delta ADC Auto Gain Temp Bits for Right Channel

#define REG_AR_DIGIM			(AR_BA+0x0038)
		#define SMPL_MODE			NVTBIT(9, 8)		// Audio Sample Mode
		#define DIGIM_EN			BIT7				// Digital Microphone Gain Control Enable
		#define DIGIM_LV			NVTBIT(3, 0)		// Digital Microphone Gain Level

#define REG_SDADC_INFAGC		(AR_BA+0x040)
		#define INF_GAIN			NVTBIT(31, 24)		// Information About AGC Gain
		#define INF_PWR			NVTBIT(15, 0)	 	// Information About AGC Average Power


#define REG_TP_CTL1		(TP_BA+0x00)		// Touch Panel control register 1
		#define XP_EN				BIT23			// Analog Power Switch in XP
		#define XM_EN				BIT22			// Analog Power Switch in XM
		#define YP_EN				BIT21			// Analog Power Switch in YP
		#define YM_EN				BIT20			// Analog Power Switch in YM
		#define PLLUP				BIT19			// Pulls Up the XP to Analog Power Supply.
		#define IN_SEL				NVTBIT(18, 16)		// Analog Input Selection Signals
		#define PD_Power 			BIT15			// Down the Keypad Detection
		#define PD_BUF			BIT14 			// Power Down the Internal Reference Buffer
		#define ADC_SLEEP			BIT13			// Power Down Signal
		#define LOW_SPEED			BIT12			// Low Speed Mode
		#define REF_SEL			NVTBIT(11, 10)		// Analog Reference Pair Selection Signals
		#define SLOW_CMP			BIT9				// Slow Down Comparator Enable
		#define TSMODE			BIT7				// Touch Panel Mod
		#define SW_GET			BIT4				// Software Trigger to Get the Data
		#define GET_PRESSURE		BIT3				// Get the Pressure Information
		#define GET_XY			BIT2				// Get the X and Y Average Information
		#define GET_Y				BIT1				// Get the Y Information
		#define GET_X				BIT0				// Get the X Information

#define REG_TP_CTL2		(TP_BA+0x04)		// Touch Panel control register 2
		#define SPL_CHK_TIME		NVTBIT(7, 0)		// Sample & Check Time
#define REG_TP_INTST		(TP_BA+0x08)		// Touch Panel interrupt register
		#define INT_NOR_MASK		BIT6				// Interrupt Mask
		#define INT_TC_MASK		BIT5				// Pen Down Interrupt Mask
		#define INT_KEY_MASK		BIT4				// Key Pad Interrupt Mask
		#define INT_NOR			BIT2				// Normal Interrupt State
		#define INT_TC				BIT1				// Pen Down Interrupt State
		#define INT_KEY			BIT0				// Key Pad Interrupt State
#define REG_XY_DATA				(TP_BA+0x0C)		// X and Y DATA register
		#define PENX				BIT31			// Pen Down Valid/Invalid for X_DATA
		#define X_DATA			NVTBIT(27, 16)		// X Location Register
		#define PENY				BIT15			// Pen Down Valid/Invalid for Y_DATA
		#define Y_DATA			NVTBIT(11, 0)		// Y Location Register
#define REG_Z_DATA		(TP_BA+0x10)		// Z1 and Z2 DATA register
		#define PENZ1				BIT31			// Pen Down Valid/Invalid for Z1_DATA
		#define Z1_DATA			NVTBIT(27, 16)		// Z1 Location Register
		#define PENZ2				BIT15			// Pen Down Valid/Invalid for Z2_DATA
		#define Z2_DATA			NVTBIT(11, 0)		// Z2 Location Register
#define REG_NORM_DATA		(TP_BA+0x14)		// Normal Process DATA register (AIN2 and AI3)
		#define NORM_DATA			NVTBIT(11, 0)		// Normal Process Data Register


/*-----------------------------------------------------------------------------
 * Define Registers for AES
 *---------------------------------------------------------------------------*/
#define REG_AESKW0R     (AES_BA+0x000)      // AES Key Word 0 Register
    #define AESKW0          NVTBIT(31, 0)       // bit 31~0 of security key for AES
#define REG_AESKW1R     (AES_BA+0x004)      // AES Key Word 1 Register
    #define AESKW1          NVTBIT(31, 0)       // bit 63~32 of security key for AES
#define REG_AESKW2R     (AES_BA+0x008)      // AES Key Word 2 Register
    #define AESKW2          NVTBIT(31, 0)       // bit 95~64 of security key for AES
#define REG_AESKW3R     (AES_BA+0x00C)      // AES Key Word 3 Register
    #define AESKW3          NVTBIT(31, 0)       // bit 127~96 of security key for AES
#define REG_AESKW4R     (AES_BA+0x010)      // AES Key Word 4 Register
    #define AESKW4          NVTBIT(31, 0)       // bit 159~128 of security key for AES
#define REG_AESKW5R     (AES_BA+0x014)      // AES Key Word 5 Register
    #define AESKW5          NVTBIT(31, 0)       // bit 191~160 of security key for AES
#define REG_AESKW6R     (AES_BA+0x018)      // AES Key Word 6 Register
    #define AESKW6          NVTBIT(31, 0)       // bit 223~192 of security key for AES
#define REG_AESKW7R     (AES_BA+0x01C)      // AES Key Word 7 Register
    #define AESKW7          NVTBIT(31, 0)       // bit 255~224 of security key for AES

#define REG_AESIV0R     (AES_BA+0x020)      // AES Initial Vector Word 0 Register
    #define AESIV0          NVTBIT(31, 0)       // bit 31~0 of Initial Vector for AES CBC mode
#define REG_AESIV1R     (AES_BA+0x024)      // AES Initial Vector Word 1 Register
    #define AESIV1          NVTBIT(31, 0)       // bit 63~32 of Initial Vector for AES CBC mode
#define REG_AESIV2R     (AES_BA+0x028)      // AES Initial Vector Word 2 Register
    #define AESIV2          NVTBIT(31, 0)       // bit 95~64 of Initial Vector for AES CBC mode
#define REG_AESIV3R     (AES_BA+0x02C)      // AES Initial Vector Word 3 Register
    #define AESIV3          NVTBIT(31, 0)       // bit 127~96 of Initial Vector for AES CBC mode

#define REG_AESCR       (AES_BA+0x030)      // AES Control Register
    #define TRANS           BIT5                // Data format transform for AES
    #define KSIZE           NVTBIT(3, 2)        // define the different key sizes for AES
        #define KSIZE_128       0                   // define the key sizes for 128 bits
        #define KSIZE_192       BIT2                // define the key sizes for 192 bits
        #define KSIZE_256       BIT3                // define the key sizes for 256 bits
    #define ENCRPT          BIT1                // define the encryption or decryption for AES
    #define AESON           BIT0                // enable the AES operation

#define REG_AESSAR      (AES_BA+0x034)      // AES Source Address Register
    #define AESSA           NVTBIT(31,0)        // AES Source Address
#define REG_AESDAR      (AES_BA+0x038)      // AES Destination Address Register
    #define AESDA           NVTBIT(31,0)        // AES Destination Address
#define REG_AESBCR      (AES_BA+0x03C)      // AES Byte Count Register
    #define BCNT            NVTBIT(15,0)        // the byte count of plain text that need to do AES

#define REG_AESISR      (AES_BA+0x040)      // AES Interrupt Status Register
    #define AESOK           BIT1                // AES Operation OK Interrupt status
    #define BERR            BIT0                // Bus Error Interrupt status
#define REG_AESIER      (AES_BA+0x044)      // AES Interrupt Enable Register
    #define ENAESOK         BIT1                // Enable AES Operation OK Interrupt
    #define ENBERR          BIT0                // Enable Bus Error Interrupt

