k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_ACSAR       (AES_BA+0x048)      // AES Current Source Address Register
    #define CAESA           NVTBIT(31,0)        // Current AES Source Address
#define REG_ACDAR       (AES_BA+0x04C)      // AES Current Destination Address Register
    #define CAESDA          NVTBIT(31,0)        // Current AES Destination Address
#define REG_ACBCR       (AES_BA+0x050)      // AES Current Byte Count Register
    #define CBCNT           NVTBIT(15,0)        // Current Byte Count that AES hasn't read yet

/****************************************************************************************************
 *
 * MAC Registers
 *
 ****************************************************************************************************/

#define REG_CAMCMR       (EMAC_BA+0x00)   /* CAM Command Register */
#define REG_CAMEN        (EMAC_BA+0x04)   /* CAM Enable Register */
#define REG_CAM0M_Base   (EMAC_BA+0x08)
#define REG_CAM0L_Base   (EMAC_BA+0x0c)
#define REG_CAMxM_Reg(x) (REG_CAM0M_Base+x*0x8)   /*  */
#define REG_CAMxL_Reg(x) (REG_CAM0L_Base+x*0x8)   /*  */

#define REG_TXDLSA       (EMAC_BA+0x88)   /* Transmit Descriptor Link List Start Address Register */
#define REG_RXDLSA       (EMAC_BA+0x8C)   /* Receive Descriptor Link List Start Address Register */
#define REG_MCMDR        (EMAC_BA+0x90)   /* MAC Command Register */
#define REG_MIID         (EMAC_BA+0x94)   /* MII Management Data Register */
#define REG_MIIDA        (EMAC_BA+0x98)   /* MII Management Control and Address Register */
#define REG_FFTCR		 (EMAC_BA+0x9C)   /* FIFO Threshold Control Register */
#define REG_TSDR         (EMAC_BA+0xa0)   /* Transmit Start Demand Register */
#define REG_RSDR         (EMAC_BA+0xa4)   /* Receive Start Demand Register */
#define REG_DMARFC	   	 (EMAC_BA+0xa8)   /* Maximum Receive Frame Control Register */
#define REG_MIEN         (EMAC_BA+0xac)   /* MAC Interrupt Enable Register */
          /* Status Registers */
#define REG_MISTA        (EMAC_BA+0xb0)   /* MAC Interrupt Status Register */
#define REG_MGSTA        (EMAC_BA+0xb4)   /* MAC General Status Register */
#define REG_MPCNT		 (EMAC_BA+0xb8)   /* Missed Packet Count Register */
#define REG_MRPC         (EMAC_BA+0xbc)   /* MAC Receive Pause Count Register */
#define REG_MRPCC        (EMAC_BA+0xc0)   /* MAC Receive Pause Current Count Register */
#define REG_MREPC        (EMAC_BA+0xc4)   /* MAC Remote Pause Count Register */
#define REG_DMARFS       (EMAC_BA+0xc8)   /* DMA Receive Frame Status Register */
#define REG_CTXDSA       (EMAC_BA+0xcc)   /* Current Transmit Descriptor Start Address Register */
#define REG_CTXBSA       (EMAC_BA+0xd0)   /* Current Transmit Buffer Start Address Register */
#define REG_CRXDSA       (EMAC_BA+0xd4)   /* Current Receive Descriptor Start Address Register */
#define REG_CRXBSA       (EMAC_BA+0xd8)   /* Current Receive Buffer Start Address Register */
          /* Diagnostic Registers */
#define REG_RXFSM        (EMAC_BA+0x200)   /* Receive Finite State Machine Register */
#define REG_TXFSM        (EMAC_BA+0x204)   /* Transmit Finite State Machine Register */
#define REG_FSM0         (EMAC_BA+0x208)   /* Finite State Machine Register 0 */
#define REG_FSM1         (EMAC_BA+0x20c)   /* Finite State Machine Register 1 */
#define REG_DCR          (EMAC_BA+0x210)   /* Debug Configuration Register */
#define REG_DMMIR		 (EMAC_BA+0x214)   /* Debug Mode MAC Information Register */
#define REG_BISTR        (EMAC_BA+0x300)   /* BIST Mode Register */

//#define CRC_BA	(w55fa92_CRC)
#define REG_CRC_CTL		(CRC_BA + 0x00)		// R/W:	CRC Control Register
	#define CRC_MODE		NVTBIT(31, 30)		// CRC Polynomial Mode
	#define CPU_WDLEN		NVTBIT(29, 28)		// CPU Write Data Length
	#define CHECKSUM_COM		BIT27			// Checksum Complement
	#define WDATA_COM		BIT26			// Write Data Complement
	#define CHECKSUM_RVS		BIT25			// Checksum Reverse
	#define WDATA_RVS			BIT24			// Write Data Order Reverse
	#define CRC_SW_RST		BIT1			// CRC Engine Reset
	#define CRCCEN			BIT0			// CRC Channel Enable

#define REG_CRC_WDATA		(CRC_BA + 0x04)		// R/W: CRC Write Data Register
#define REG_CRC_SEED		(CRC_BA + 0x08)		// R/W: CRC Seed Register
#define REG_CRC_CHECKSUM	(CRC_BA + 0x0C)		// R: CRC Check Sum Register
#define REG_DMA_WDATA		(CRC_BA + 0x100)	// R/W: CRC DMA WDATA Register

//#define RF_BA		(w55fa92_RF)
#define REG_RFCODEC_CTL		(RF_BA + 0x00)		// R/W: RF Codec control register
	#define DAT_LEN_BYTE		NVTBIT(31, 16)		// Data Byte Length
	#define RF_SOFT_RST		BIT15			// Soft Reset
	#define PNCTR_MOD		NVTBIT(6, 4)		// Puncture Mode
	#define RF_INT_EN		BIT3			// Interrupt Enable
	#define RF_INT			BIT2			// Interrupt
	#define RF_MODE			BIT1			// RF Codec Mode
	#define RF_START		BIT0			// Start Encode or Decode Function
#define REG_RFCODEC_DAT		(RF_BA + 0x04)		// R/W: Convolution or Viterbi data register
#define REG_RFCODEC_INTRLV	(RF_BA + 0x08)		// R/W: Interleave buffer

//#define RSC_BA	(w55fa92_RSC)
#define REG_RSC_CNTRL		(RSC_BA + 0x00)		// R/W:	Control and Status Register
	#define RD_BUF_FULL		BIT13			// RSCODEC Read Buffer Full Flag
	#define RD_BUF_EMPTY		BIT12			// RSCODEC Read Buffer Full Flag
	#define WR_BUF_FULL		BIT11			// RSCODEC Write Buffer Full Flag
	#define WR_BUF_EMPTY		BIT10			// RSCODEC Write Buffer Full Flag
	#define RS_IE			BIT9			// Interrupt Enable
	#define RS_IF			BIT8			// Interrupt Flag
	#define CI_CLR			BIT5			// Convolutional Interleaver / De-interleaver Clear FIFO
	#define CI_INIT			BIT4			// Convolutional Interleaver / De-interleaver Initial
	#define CI_EN			BIT3			// Convolutional Interleaver / De-interleaver Enable
	#define RS_EN			BIT2			// Reed-Solomon Core Enable
	#define DEC_MODE		BIT1			// RSCODEC Encode / Decode Mode Select

#define REG_RSC_EDMA		(RSC_BA + 0x04)		// R/W: EDMA Control Register
	#define EDMA_GO			BIT0			// EDMA start
#define REG_RSC_RBUF		(RSC_BA + 0x08)		// R: RSCODEC Read Buffer Register
#define REG_RSC_WBUF		(RSC_BA + 0x0C)		// R/W: RSCODEC Write Buffer Register
#define REG_RSC_STATUS		(RSC_BA + 0x10)		// R: Reed-Solomon decoder status register
#define REG_RSC_ERRNUM0		(RSC_BA + 0x14)		// R: Reed-Solomon decoder error number register 0
#define REG_RSC_ERRNUM1		(RSC_BA + 0x18)		// R: Reed-Solomon decoder error number register 1
#define REG_RSC_ERRNUM2		(RSC_BA + 0x1C)		// R: Reed-Solomon decoder error number register 2
#define REG_RSC_ERRNUM3		(RSC_BA + 0x20)		// R: Reed-Solomon decoder error number register 3


// AAC MDCT defnition
#define REG_MDCTPAR		(MDCT_BA+0x00)
	#define WIN_MODE		NVTBIT(18,16)		// 2 for window 2048, 5 for window 256
	#define DECODEREN		BIT0				// 0 for MDCT encoder mode, 1 for MDCT decoder mode
	#define WIN_2048		0x20000
	#define WIN_256			0x50000

