k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_MDCTCTL		(MDCT_BA+0x04)
	#define MDCTEN			BIT0 				// 0 for MDCT idle, 1 for MDCT enable

#define REG_MDCTSTATE	(MDCT_BA+0x08)
	#define REORDER_BUSY	BIT3
	#define POST_BUSY		BIT2
	#define FFT_BUSY		BIT1
	#define PRE_BUSY		BIT0

#define REG_MDCTINT		(MDCT_BA+0x0C)
	#define DMAOUT_INT_ENABLE	BIT18   //((~BIT18) & 0xF0000)
	#define DMAIN_INT_ENABLE	BIT17   //((~BIT17) & 0xF0000)
	#define MDCT_INT_ENABLE		BIT16   //((~BIT16) & 0xF0000)
	#define DMAOUT_INT			BIT2
	#define DMAIN_INT			BIT1
	#define MDCT_INT			BIT0

#define REG_DMA_RADDR	(MDCT_BA+0x10)

#define REG_DMA_WADDR 	(MDCT_BA+0x14)

#define REG_DMA_DIRECTION	(MDCT_BA+0x18)
	#define DMA_DIRECTION	BIT0				// 0 for read data in, 1 for write data out

#define REG_DMA_STATE	(MDCT_BA+0x1C)
	#define DMA_STATE		BIT0				// 0 for DMA idle, 1 for DMA enable

#define REG_DMA_LENGTH	(MDCT_BA+0x20)
	#define DMA_LEN			NVTBIT(11,0)


/* H.264 Encoder Register */
#define REG_264_PARM0				(H264E_BA+0x000)   	/* SPS/PPS parameters */
	#define PIC_MB_COUNT			NVTBIT(28, 16)		// number of MB in each encoded picture
	#define PIC_HEIGHT			    NVTBIT(14, 8)		// height of each encoded picture in unit of MB
	#define PIC_WIDTH			    NVTBIT( 6, 0)		// width of each encoded picture in unit of MB

#define REG_264_PARM1				(H264E_BA+0x004)   	/* SPS/PPS parameters */
    #define P1_IMODE		             BIT24				// Intra I 4x4 number of mode
    #define P1_TD		                BIT23				// Coefficient threshold disable
	#define P1_CCT			            NVTBIT(22,20)		// Chroma coefficients threshold
	#define P1_LCT			            NVTBIT(18,16)		// Luma coefficients threshold
	#define P1_BETA_OFFSET	            NVTBIT(15,12)		// Beta offset
	#define P1_ALPHA_OFFSET            NVTBIT(11, 8)		// Alpha offset
	#define P1_CHROMA_QP_OFFSET        NVTBIT( 4, 0)		// Chroma QP offset

#define REG_264_PARM2				(H264E_BA+0x008)   	/* Watermark pattern */
#define REG_264_PARM3				(H264E_BA+0x00C)   	/* Reserved */
#define REG_264_PARM4				(H264E_BA+0x010)   	/* Qp, ILF disabled */
	#define P4_MB_DELTAQP              NVTBIT(19,12)		// mb_delta QP (reserved)
	#define P4_ENCODE_QP               NVTBIT( 9, 4)		// initial value of QPy
	#define P4_ID                      NVTBIT( 3, 2)		// Disable the deblocking operations
	#define P4_PIC_FCNT_MAX            NVTBIT( 1, 0)		// pic_fcnt_max(reserved)

#define REG_264_PARM5				(H264E_BA+0x014)   	/* Reserved */
#define REG_264_PARM6				(H264E_BA+0x018)   	/* Reserved */
    #define P6_CC_ADDRESS_MODE         BIT0				// CbCr data of the current frame in the address mode
#define REG_264_PARM7				(H264E_BA+0x01C)   	/* External packing code */

#define REG_264_CMD0				(H264E_BA+0x020)   	/* Encoder commands */
    #define C0_RESET                   BIT31				// Software resets for the entire encoder
	#define C0_WK_STATUS               NVTBIT( 5, 4)		// Watermark status
    #define C0_LODA_DMA_CHAIN          BIT3				// Load DMA command chain
    #define C0_ENCODE_SLICE_TYPE       BIT1				// Slice type
    #define C0_ENCODE               BIT0				// Command to encode one picture

#define REG_264_CMD1				(H264E_BA+0x024)   	/* External packing commands */
    #define C1_CLEAR_BITSTREAM_LEN                       BIT11				// Clear the counter of the bitstream length
    #define C1_CLOSE_BITSTREAM                       BIT10				// Close bitstream
    #define C1_ADD_RBSP_TRAILING                       BIT9				// Add the RBSP trailing bits
    #define C1_PREVENT_0x3                       BIT8				// Avoid adding 0x03
    #define C1_EXP_GOLOMB_CODE                       BIT7				// Exp-Goloma coded syntax
    #define C1_EXT_PK_GO                       BIT6				// External packing go
	#define C1_EXT_PK_LEN              NVTBIT( 5, 0)		// External packing length

//#define REG_264_CMD2				(H264E_BA+0x028)   	/* Reserved */
//#define REG_264_CMD3				(H264E_BA+0x02C)   	/* Reserved */
//#define REG_264_CMD4				(H264E_BA+0x030)   	/* Reserved */
//#define REG_264_CMD5				(H264E_BA+0x034)   	/* Reserved */
//#define REG_264_CMD6				(H264E_BA+0x038)   	/* Reserved */
//#define REG_264_CMD7				(H264E_BA+0x03C)   	/* Reserved */

#define REG_264_STS0				(H264E_BA+0x040)   	/* Encoder status (read only)*/
	#define S0_MB_CNT                  NVTBIT(28,16)		// Current MB count
    #define S0_VLC_DONE                       BIT1				// VLC done
    #define S0_FRAME_DONE                      BIT0				// Frame done

#define REG_264_STS1				(H264E_BA+0x044)   	/* Bitstream length */
#define REG_264_STS2				(H264E_BA+0x048)   	/* Interrupt */
    #define S2_FD_INT_MASK                       BIT16				// Interrupt mask
    #define S2_FD_INT_STS                       BIT0				// Interrupt status for the frame done

#define REG_264_STS3				(H264E_BA+0x04C)   	/* Frame cost */

#define REG_264_DMATH				(H264E_BA+0x094)   	/* DMA FIFO threshold */
    #define DMATH_HALF_FULL                       BIT1				// Issue an AHB command while the FIFO status is more than half-full
    #define DMATH_HALF_EMPTY                       BIT0				// Issue an AHB command while the FIFO status is more than half-empty

#define REG_264_DMAA0				(H264E_BA+0x098)   	/* DMA command loader source address */
	#define DMA_A0_SMBA_                    NVTBIT(31, 2)		// System memory base address

#define REG_264_DMAC0				(H264E_BA+0x09C)   	/* DMA command loader control */
    #define DMA_C0_DIR                       BIT15				// Transfer direction
	#define DMA_C0_LEN                  NVTBIT(11, 0)		// Transfer length

#define REG_264_DMAA1				(H264E_BA+0x0A8)   	/* DMA bitstream target address */
	#define DMM_A1_SMBA                    NVTBIT(31, 2)		// System memory base address (Word)
	#define DMM_A1_INC                     NVTBIT( 1, 0)		// System memory address increment

#define REG_264_DMAC1				(H264E_BA+0x0AC)   	/* DMA bitstream buffer control */
	#define DMA_C1_SLOT_COUNTER            NVTBIT(24,16)		// Slot counter
    #define DMA_C1_D                       BIT15				// Transfer direction
	#define DMA_C1_TYPE                    NVTBIT(13,12)		// Transfer type
	#define DMA_C1_LENGTH                  NVTBIT(11, 0)		// Transfer length

#define REG_264_DMAW1				(H264E_BA+0x0B0)   	/* DMA bitstream buffer control */
	#define DMA_W1_HALF_SLOT_AMOUNT        NVTBIT(31,24)		// Half of slot amount

