k1132/my_test/Nuc970_Driver/Src/w55fa92_reg.h
#define REG_264_DMAB1				(H264E_BA+0x0B4)   	/* DMA bitstream buffer control */
	#define DMA_B1_CBBA                    NVTBIT(31, 2)		// Circular buffer base address (word)


/* H.264 Decoder Register */
#define REG_264_INTS				(H264D_BA+0x014)   	/* Interrupt Status */
    #define MASK_INT_BSM_BUF_EMPTY  BIT21				// Mask the BSM buffer empty interrupt
    #define MASK_INT_MV_OVER_RANGE  BIT20				// Mask MV over the range interrupt
    #define MASK_INT_END_FRAME      BIT19				// Mask end of the frame interrupt
    #define MASK_INT_END_SLICE      BIT18				// Mask end of the slice interrupt
    #define MASK_BUS_ERROR_INT      BIT17				// Mask the bus error interrupt
    #define MASK_TRANS_DONE_INT     BIT16				// Mask the transfer done interrupt
    #define INT_BSM_BUF_EMPTY       BIT5				// BSM buffer empty interrupt flag
    #define INT_MV_OVER_RANGE       BIT4				// MV over range interrupt flag
    #define INT_END_FRAME           BIT3				// Frame-end inerrupt flag
    #define INT_END_SLICE           BIT2				// Slice-end interrupt flag
    #define INT_BUS_ERROR           BIT1				// Bus error interrupt flag
    #define INT_TRANS_DONE          BIT0				// DMA transfer done interrupt flag

#define REG_264_FRAMESIZE			(H264D_BA+0x018)   	/* Frame Size */
	#define FRAMESIZE               NVTBIT(14, 0)		// Frame Size

#define REG_264_BSM_BASE			(H264D_BA+0x01C)   	/* Bitstream memory base address */
#define REG_264_RECON_BASE			(H264D_BA+0x020)   	/* Reconstruction frame base address */
#define REG_264_INTRA_BASE			(H264D_BA+0x024)   	/* Intra data base address */
#define REG_264_MBINFO_BASE			(H264D_BA+0x028)   	/* Macro block information base address */
#define REG_264_SOFT_RST			(H264D_BA+0x02C)   	/* Software reset */
    #define DISABLE_MULTI_SLICE     BIT2				// Disable the multi-slice function
    #define BSM_EMPTY               BIT1				// When Bisteam is empty, the system host should set this bit to '1'.
    #define SRESET                  BIT0				// Software reset

#define REG_264_DISP_Y_BASE			(H264D_BA+0x030)   	/* Display frame base address */
#define REG_264_OFFSET_REG0			(H264D_BA+0x034)   	/* Address offset register 0 */
	#define MBINFO_OFFSET           NVTBIT(23,16)		// Macro block information offset address (unit : 8 words)
	#define INTRA_OFFSET            NVTBIT( 7, 0)		// Intra data offset address (unit : 8 words)

#define REG_264_OFFSET_REG1			(H264D_BA+0x038)   	/* Address offset register 1 */
	#define ILFTOP_UV_LINEOFFS_BIT  NVTBIT(27,16)		// UV line offset
	#define ILFTOP_Y_LINEOFFS_BIT   NVTBIT(12, 0)		// Y line offset

#define REG_264_RECON_LINEOFFS		(H264D_BA+0x03C)   	/* Reconstruction frame address offset */
	#define RECON_LINEOFFS          NVTBIT(10, 0)		// System memory data line offset

#define REG_264_DP_LINEOFFS			(H264D_BA+0x040)   	/* Display frame address offset */
    #define DP_Y_LINEOFFS_BIT9      BIT24				// bit[9] of the DP_Y_LINEOFFS
	#define DP_C_LINEOFFS           NVTBIT(23,16)		// Chroma Line offset
	#define DP_Y_LINEOFFS           NVTBIT( 8, 0)		// Luma Line offset

#define REG_264_BSM_COUNT			(H264D_BA+0x044)   	/* Bitstream counter */
	#define BSM_READ_COUNT          NVTBIT(31,16)		// Bitstream read buffer counter
	#define BSM_INC_VALID_COUNT     NVTBIT(15, 0)		// Bitstream buffer valid counter

#define REG_264_BSM_BUF_LENGTH		(H264D_BA+0x048)   	/* Bitstream buffer length */
	#define BSM_BUF_LENGTH          NVTBIT(15, 0)		// Prepared space of external memory for bitstream buffer (unit : 16 words)

#define REG_264_MISC    			(H264D_BA+0x04C)   	/* Miscellaneous */
    #define LCD_MODE_LARGE          BIT4				// The frame size of the LCD display is larger than the reconstructed frame size
    #define LCD_MODE_SMALL          BIT3				// The frame size of the LCD display is smaller than the reconstructed frame size
    #define DISPLAY_DIS             BIT2				// Display the data moved function
	#define DISP_MODE               NVTBIT( 1, 0)		// Display format

#define REG_264_DISP_U_BASE 		(H264D_BA+0x050)   	/* Display the chroma U base address */
#define REG_264_DISP_V_BASE			(H264D_BA+0x054)   	/* Display the chroma V base address */
#define REG_264_LCD_PARAM			(H264D_BA+0x058)   	/* LCD display control parameter */
	#define LCD_LEFT_SHIFT          NVTBIT(23,20)		//
	#define LCD_TOP_SHIFT           NVTBIT(19,16)
	#define LCD_DISPLAY_HEIGHT      NVTBIT(15, 8)
	#define LCD_DISPLAY_WIDTH       NVTBIT( 7, 0)

#define REG_264_LCD_FRAME_LINE_OFF	(H264D_BA+0x05C)   	/* LCD display line offset */
	#define LCD_C_FRAME_LINE_OFFSET NVTBIT(27,16)
	#define LCD_Y_FRAME_LINE_OFFSET NVTBIT(11, 0)

#define REG_264_SREG0   			(H264D_BA+0x080)   	/* System register 0 */
	#define PIC_WIDTH_IN_MBS        NVTBIT(31,24)       // The width of the decoded picture in units of MB
	#define PIC_HEIGHT_IN_MAP_UNITS NVTBIT(23,16)       // The height in the slice group map unit of a decoded frame
    #define FRAME_MBS_ONLY_FLGA     BIT15				// Frame or filed macro block selection
    #define MB_AFF_FLAG             BIT14				// No switching between the field macro blocks within a picture
    #define DIRECT_8X8_INFERENCE_FLAG BIT13				//
    #define ENTROPY_CODING_MODE_FLAG BIT12				// Entropy coding table selection
	#define NUM_REF_IDX_L0_ACTIVE   NVTBIT(11, 7)	    // Maximum reference index for the reference picture list 0
    #define FIELD_PIC_FLAG          BIT1				// Coded frame slice

#define REG_264_SREG1       		(H264D_BA+0x084)   	/* System register 1 */
	#define SLICE_TYPE              NVTBIT(21,20)	    // Slice type
	#define FRAME_NUM               NVTBIT(19,15)	    // Frame Number
	#define QP                      NVTBIT(11, 6)	    // QP of the current slice
	#define CHROMA_QP_INDEX_OFFSET  NVTBIT( 5, 1)	    // Chroma QP index offset
    #define CONSTRAINED_INTRA_PRED_FLAG BIT0			//

#define REG_264_SREG2   			(H264D_BA+0x088)   	/* System register 2 */
	#define CURR_SLICE_NR           NVTBIT(16,12)	    //
	#define IF_DISABLE_IDC          NVTBIT( 9, 8)	    // Enable the in-loop filter function
	#define IF_ALPHA_C0_OFFSET_DIV2 NVTBIT( 7, 4)	    // In accessing the alpha and tc0 de-blocking filter table
	#define IF_BETA_OFFSET_DIV2     NVTBIT( 3, 0)	    // In accessing the beta de-blocking filter table

#define REG_264_ADDR_BSM_CTL        (H264D_BA+0x08C)   	/* Bitstream management control register */
	#define SYS_PARSER_CTL          NVTBIT(10, 8)	    // System parser control
	#define CTL_SHIFT_BITS          NVTBIT( 4, 0)	    // Bitstream shift n bits

#define REG_264_ADDR_STATUS0		(H264D_BA+0x090)   	/* Bitstream management control status */
	#define CURRENT_MB_X            NVTBIT(31,24)	    // Current MB number in the X axis
	#define CURRENT_MB_Y            NVTBIT(31,24)	    // Current MB number in the Y axis
    #define PARSER_IDLE             BIT0				// Parser is at the idle state

#define REG_264_STREAM_STATUS	    (H264D_BA+0x094)   	/* Stream status */
    #define RBSP_EMPTY              BIT23				// RBSP buffer empty
    #define RBSP_Q_FULL             BIT22				// RBSP buffer full
    #define IQIT2PPC_Q_FULL         BIT21				// IQIT to the prediction pixel compensator buffer full
    #define IQIT2PPC_Q_EMPTY        BIT20				// IQIT to the prediction pixel compensator buffer empty
    #define INTRA_MQ_EMPTY          BIT19				// Prediction queue buffer empty
    #define INTRA_MQ_FULL           BIT18				// Prediction queue buffer full
    #define PPC2LIF_Q_EMPTY         BIT17				// PPC to the in-loop filter buffer empty
    #define PPC2LIF_Q_FULL          BIT16				// PPC to the in-loop filter buffer full
	#define VERSION_ID              NVTBIT(15,12)	    // Version ID
    #define IQIT_PARAM_EMPTY        BIT9				// IQIT parameter buffer empty
    #define PPC_PARAM_EMPTY         BIT8				// PPC parameter buffer empty
    #define ILF_PARAM_EMPTY         BIT7				// ILF parameter buffer empty
    #define BSB_EMPTY               BIT6				// Bitstream buffer empty
    #define BSB_LE16                BIT5				// Bistream buffer count shift left 16

#define REG_264_ADDR_BSM            (H264D_BA+0x098)   	/* Current bitstream data */
#define REG_264_ADDR_UVLDEN			(H264D_BA+0x09C)   	/* Current UVLD length */
	#define UVLD_LENGTH             NVTBIT( 4, 0)	    // Read port of the UVLD length

#define REG_264_ADDR_DECODE_CTL0	(H264D_BA+0x0A0)   	/* Enable decode slice layer */
    #define GO_SD_LAYER             BIT0				// Start decoding the slice data layer

#define REG_264_FER0_FRAME			(H264D_BA+0x100)   	/* Reference frame base address 0 */
	#define REFX_FRAME              NVTBIT(31,10)	    // Reference X frame base address


#endif
